

Internet Engineering Task Force                               M. Arango
Internet Draft                                         SUN Microsystems
Document: draft-andreasen-mgcp-rfc2705bis-00.txt               A. Dugan
Category: Informational                                      I. Elliott
                                                  Level3 Communications
                                                             C. Huitema
                                                              Microsoft
                                                             S. Pickett
                                                      Vertical Networks
                                                           F. Andreasen
                                                              B. Foster
                                                               R. Kumar
                                                          Cisco Systems
                                                       January 16, 2001


                 Media Gateway Control Protocol (MGCP)
                              Version 1.0bis

Status of this Memo

   This document is an Internet-Draft and is in full conformance with
   all provisions of Section 10 of RFC2026 [1].

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups. Note that
   other groups may also distribute working documents as Internet-
   Drafts. Internet-Drafts are draft documents valid for a maximum of
   six months and may be updated, replaced, or obsoleted by other
   documents at any time. It is inappropriate to use Internet- Drafts
   as reference material or to cite them other than as "work in
   progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.


Abstract

   This document describes an application programming interface and a
   corresponding protocol (MGCP) for controlling Voice over IP (VoIP)
   Gateways from external call control elements. MGCP assumes a call
   control architecture where the call control "intelligence" is
   outside the gateways and handled by external call control elements.

   The document is structured in 8 main sections:

   *  The introduction presents the basic assumptions and the relation
      to other protocols such as H.323, RTSP, SAP or SIP.


Arango, et al.      Informational - Expires July 2001          [Page 1]

Internet Draft                MGCP 1.0bis                  January 2001

   *  The interface section presents a conceptual overview of the MGCP,
      presenting the naming conventions, the usage of the session
      description protocol SDP, and the procedures that compose MGCP:
      Endpoint Configuration, Notification Request, Notification,
      Create Connection, Modify Connection, Delete Connection,
      AuditEndpoint, AuditConnection and RestartInProgress.

   *  The protocol description section presents the MGCP encodings,
      which are based on simple text formats, and the transmission
      procedure over UDP.

   *  A section describing race conditions and fail-over
      considerations.

   *  The security section presents the security requirement of MGCP,
      and its usage of IP security services (IPSEC).

   *  A section describing the extension mechanisms using packages.

   *  The description of the changes made in combining SGCP 1.1 and
      IPDC to create MGCP 1.0 and the enhancements and clarifications
      introduced in RFC 2705bis.

   Comments on this document should be sent to the MGCP mailing list at
   "mgcp@pulver.com" and/or the authors.


Table of Contents


1.  INTRODUCTION......................................................6

 1.1.  Relation with the H.323 Standards..............................7
 1.2.  Relation with the IETF Standards...............................8
 1.3.  Definitions....................................................9

2.  MEDIA GATEWAY CONTROL INTERFACE..................................11

 2.1.  Model and Naming Conventions..................................11
   2.1.1.  Types of Endpoints........................................11
     2.1.1.1.  Digital Channel (DS0).................................12
     2.1.1.2.  Analog Line...........................................12
     2.1.1.3.  Announcement Server Access Point......................13
     2.1.1.4.  Interactive Voice Response Access Point...............13
     2.1.1.5.  Conference Bridge Access Point........................14
     2.1.1.6.  Packet Relay..........................................14
     2.1.1.7.  Wiretap Access Point..................................14
     2.1.1.8.  ATM "trunk side" Interface............................15
   2.1.2.  Endpoint Identifiers......................................15
   2.1.3.  Calls and Connections.....................................17
     2.1.3.1.  Names of Calls........................................19
     2.1.3.2.  Names of Connections..................................20
     2.1.3.3.  Management of Resources, Attributes of Connections....20
     2.1.3.4.  Special Case of Local Connections.....................22
   2.1.4.  Names of Call Agents and Other Entities...................23

Arango, et al.      Informational - Expires  July 2001         [Page 2]

Internet Draft                MGCP 1.0bis                  January 2001

   2.1.5.  Digit Maps................................................24
   2.1.6.  Packages..................................................26
   2.1.7.  Events and Signals........................................27
 2.2.  Usage of SDP..................................................31
 2.3.  Gateway Control Commands......................................31
   2.3.1. Overview of Commands.......................................31
   2.3.2. EndpointConfiguration......................................33
   2.3.3.  NotificationRequest.......................................34
   2.3.4.  Notify....................................................40
   2.3.5. CreateConnection...........................................41
   2.3.6.  ModifyConnection..........................................45
   2.3.7.  DeleteConnection (from the Call Agent)....................47
   2.3.8.  DeleteConnection (from the gateway).......................51
   2.3.9.  DeleteConnection (multiple connections, from the Call Agent)
    ..................................................................51
   2.3.10.  AuditEndpoint............................................52
   2.3.11.  AuditConnection..........................................56
   2.3.12.  RestartInProgress........................................57
 2.4.  Return Codes and Error Codes..................................59
 2.5.  Reason Codes..................................................62
 2.6. Use of Local Connection Options and Connection Descriptors.....62
 2.7. Resource Reservations..........................................64

3.  MEDIA GATEWAY CONTROL PROTOCOL...................................66

 3.1.  General Description...........................................66
 3.2.  Command Header................................................66
   3.2.1.  Command Line..............................................67
     3.2.1.1.  Coding of the Requested Verb..........................67
     3.2.1.2.  Transaction Identifiers...............................68
     3.2.1.3.  Coding of the Endpoint Identifiers and Entity Names...68
     3.2.1.4.  Coding of the Protocol Version........................69
   3.2.2.  Parameter Lines...........................................69
     3.2.2.1.  Response Acknowledgement..............................72
     3.2.2.2.  Local Connection Options..............................72
     3.2.2.3.  Capabilities..........................................75
     3.2.2.4.  Connection Parameters.................................76
     3.2.2.5.  Reason Codes..........................................78
     3.2.2.6.  Connection Mode.......................................78
     3.2.2.7.  Coding of Event Names.................................78
     3.2.2.8.  RequestedEvents.......................................79
     3.2.2.9.  SignalRequests........................................81
     3.2.2.10.  ObservedEvents.......................................81
     3.2.2.11.  RequestedInfo........................................81
     3.2.2.12.  QuarantineHandling...................................82
     3.2.2.13.  DetectEvents.........................................82
     3.2.2.14.  EventStates..........................................82
     3.2.2.15.  RestartMethod........................................83
     3.2.2.16.  Bearer Information...................................83
 3.3.  Format of response headers....................................83
   3.3.1. CreateConnection Response..................................85
   3.3.2. ModifyConnection Response..................................86
   3.3.3. DeleteConnection Response..................................87
   3.3.4. NotificationRequest Response...............................87

Arango, et al.      Informational - Expires  July 2001         [Page 3]

Internet Draft                MGCP 1.0bis                  January 2001

   3.3.5. Notify Response............................................87
   3.3.6. AuditEndpoint Response.....................................87
   3.3.7. AuditConnection Response...................................88
   3.3.8. RestartInProgress Response.................................88
 3.4.  Encoding of the Session Description (SDP).....................89
   3.4.1.  Usage of SDP for an Audio Service.........................90
   3.4.2.  Usage of SDP for LOCAL Connections........................90
 3.5.  Transmission over UDP.........................................91
   3.5.1.  Providing the At-Most-Once Functionality..................91
   3.5.2.  Transaction Identifiers and Three Ways Handshake..........92
   3.5.3.  Computing Retransmission Timers...........................93
   3.5.4.  Piggy Backing.............................................94
   3.5.5.  Provisional Responses.....................................95

4.  STATES, FAILOVER AND RACE CONDITIONS.............................97

 4.1.  Failover Assumptions and Highlights...........................97
 4.2.  Communicating with Gateways...................................99
 4.3.  Retransmission, and Detection of Lost Associations:...........99
 4.4.  Race Conditions..............................................103
   4.4.1.  Quarantine List..........................................103
   4.4.2.  Explicit Detection.......................................107
   4.4.3.  Transactional Semantics..................................108
   4.4.4.  Ordering of Commands, and Treatment of Disorder..........109
   4.4.5.  Fighting the Restart Avalanche...........................110
   4.4.6.  Disconnected Endpoints...................................112

5.  SECURITY REQUIREMENTS...........................................114

 5.1.  Protection of Media Connections..............................114

6. PACKAGES.........................................................116

 6.1 BearerInformation..............................................116
 6.2 LocalConnectionOptions.........................................117
 6.3 ExtensionParameters............................................117
 6.4 ConnectionModes................................................118
 6.5 Events and Signals.............................................118
   6.5.1 Default and Reserved Events................................120
 6.6 Actions........................................................121
 6.7 DigitMapLetters................................................121
 6.8 ConnectionParameters...........................................122
 6.9 RestartMethods.................................................122
 6.10 Reason Codes..................................................122
 6.11 Return Codes..................................................123

7.  VERSIONS AND COMPATIBILITY......................................124

 7.1.  Differences between RFC 2705bis and RFC 2705.................124
 7.2.  Differences between Version 1.0 and draft-0.5................126
 7.3.  Differences between draft-04 and draft-05....................127
 7.4.  Differences between draft-03 and draft-04....................127
 7.5.  Differences between draft-02 and draft-03....................127
 7.6.  Differences between draft-01 and draft-02....................127
 7.7.  The making of MGCP from IPDC and SGCP........................128
 7.8.  Changes between MGCP and Initial Versions of SGCP............128


Arango, et al.      Informational - Expires  July 2001         [Page 4]

Internet Draft                MGCP 1.0bis                  January 2001

8.  SECURITY CONSIDERATIONS.........................................131

9.  ACKNOWLEDGEMENTS................................................132

10.  REFERENCES.....................................................133

11.  AUTHORS' ADDRESSES.............................................135

APPENDIX A: FORMAL SYNTAX DESCRIPTION OF THE PROTOCOL...............137

APPENDIX B: IANA CONSIDERATIONS.....................................144

 B.1. Packages......................................................144
 B.2. Local Connection Options......................................144

APPENDIX C: MODE INTERACTIONS.......................................145

APPENDIX D: EXAMPLE COMMAND ENCODINGS...............................147

 D.1. NotificationRequest...........................................147
 D.2. Notify........................................................147
 D.3. CreateConnection..............................................148
 D.4. ModifyConnection..............................................150
 D.5. DeleteConnection (from the Call Agent)........................151
 D.6. DeleteConnection (from the gateway)...........................151
 D.7. DeleteConnection (multiple connections from the Call Agent)...151
 D.8. AuditEndpoint.................................................152
 D.9. AuditConnection...............................................153
 D.10. RestartInProgress............................................154

APPENDIX E: ENDPOINT NAMING CONVENTIONS.............................156

 E.1. Analog Access Line Endpoints..................................156
 E.2. Digital Trunks................................................156
 E.3. Virtual Endpoints.............................................156

APPENDIX F: EXAMPLE CALL FLOWS......................................158

 F.1. Restart.......................................................158
   F.1.1. Residential Gateway Restart...............................158
   F.1.2. Call Agent Restart........................................161
 F.2. Connection Creation...........................................162
   F.2.1  Residential Gateway to Residential Gateway................163
 F.3  Connection Deletion...........................................168
   F.3.1  Residential Gateway to Residential Gateway................168

FULL COPYRIGHT STATEMENT............................................171

ACKNOWLEDGEMENT.....................................................172









Arango, et al.      Informational - Expires  July 2001         [Page 5]

Internet Draft                MGCP 1.0bis                  January 2001

1.  Introduction

   This document describes an abstract application programming
   interface and a corresponding protocol (MGCP) for controlling
   Telephony Gateways from external call control elements called media
   gateway controllers or Call Agents. A telephony gateway is a network
   element that provides conversion between the audio signals carried
   on telephone circuits and data packets carried over the Internet or
   over other packet networks. Example of gateways are:

   *  Trunking gateways, that interface between the telephone network
      and a Voice over IP network. Such gateways typically manage a
      large number of digital circuits.

   *  Voice over ATM gateways, which operate much the same way as voice
      over IP trunking gateways, except that they interface to an ATM
      network.

   *  Residential gateways, that provide a traditional analog (RJ11)
      interface to a Voice over IP network. Examples of residential
      gateways include cable modem/cable set-top boxes, xDSL devices,
      broad-band wireless devices

   *  Access gateways, that provide a traditional analog (RJ11) or
      digital PBX interface to a Voice over IP network. Examples of
      access gateways include small-scale voice over IP gateways.

   *  Business gateways, that provide a traditional digital PBX
      interface or an integrated "soft PBX" interface to a Voice over
      IP network.

   *  Network Access Servers, that can attach a "modem" to a telephone
      circuit and provide data access to the Internet. We expect that,
      in the future, the same gateways will combine Voice over IP
      services and Network Access services.

   *  Circuit switches, or packet switches, which can offer a control
      interface to an external call control element.

   MGCP assumes a call control architecture where the call control
   "intelligence" is outside the gateways and handled by external call
   control elements. The MGCP assumes that these call control elements,
   or Call Agents, will synchronize with each other to send coherent
   commands to the gateways under their control. MGCP does not define a
   mechanism for synchronizing Call Agents. MGCP is, in essence, a
   master/slave protocol, where the gateways are expected to execute
   commands sent by the Call Agents. In consequence, this document
   specifies in great detail the expected behavior of the gateways, but
   only specify those parts of a Call Agent implementation, such as
   timer management, that are mandated for proper operation of the
   protocol.



Arango, et al.      Informational - Expires  July 2001         [Page 6]

Internet Draft                MGCP 1.0bis                  January 2001

   MGCP assumes a connection model where the basic constructs are
   endpoints and connections. Endpoints are sources or sinks of data
   and could be physical or virtual. Examples of physical endpoints
   are:

   *  An interface on a gateway that terminates a trunk connected to a
      PSTN switch (e.g., Class 5, Class 4, etc.). A gateway that
      terminates trunks is called a trunk gateway.

   *  An interface on a gateway that terminates an analog POTS
      connection to a phone, key system, PBX, etc. A gateway that
      terminates residential POTS lines (to phones) is called a
      residential gateway.

   An example of a virtual endpoint is an audio source in an audio-
   content server. Creation of physical endpoints requires hardware
   installation, while creation of virtual endpoints can be done by
   software.

   Connections may be either point to point or multipoint. A point to
   point connection is an association between two endpoints with the
   purpose of transmitting data between these endpoints. Once this
   association is established for both endpoints, data transfer between
   these endpoints can take place. A multipoint connection is
   established by connecting the endpoint to a multipoint session.

   Connections can be established over several types of bearer
   networks:

   *  Transmission of audio packets using RTP and UDP over a TCP/IP
      network.

   *  Transmission of audio packets using AAL2, or another adaptation
      layer, over an ATM network.

   *  Transmission of packets over an internal connection, for example
      the TDM backplane or the interconnection bus of a gateway. This
      is used, in particular, for "hairpin" connections, connections
      that terminate in a gateway but are immediately rerouted over the
      telephone network.

   For point-to-point connections the endpoints of a connection could
   be in separate gateways or in the same gateway.

1.1.  Relation with the H.323 Standards

   MGCP is designed as an internal protocol within a distributed system
   that appears to the outside as a single VoIP gateway. This system is
   composed of a Call Agent, that may or may not be distributed over
   several computer platforms, and of a set of gateways, including at
   least one "media gateway" that perform the conversion of media
   signals between circuits and packets, and at least one "signaling
   gateway" when connecting to an SS7 controlled network.  In a typical

Arango, et al.      Informational - Expires  July 2001         [Page 7]

Internet Draft                MGCP 1.0bis                  January 2001

   configuration, this distributed gateway system will interface on one
   side with one or more telephony (i.e. circuit) switches, and on the
   other side with H.323 conformant systems, as indicated in the
   following table:

    ------------------------------------------------------------------
   | Functional|  Phone     |  Terminating    |  H.323 conformant     |
   | Plane     |  switch    |  Entity         |  systems              |
   |-----------|------------|-----------------|-----------------------|
   | Signaling |  Signaling |  Call agent     |  Signaling exchanges  |
   | Plane     |  exchanges |                 |  with the Call Agent  |
   |           |  through   |                 |  through H.225/RAS and|
   |           |  SS7/ISUP  |                 |  H.225/Q.931.         |
   |-----------|------------|-----------------|-----------------------|
   |           |            |                 |  Possible negotiation |
   |           |            |                 |  of logical channels  |
   |           |            |                 |  and transmission     |
   |           |            |                 |  parameters through   |
   |           |            |                 |  H.245 with the call  |
   |           |            |                 |  agent.               |
   |-----------|------------|-----------------|-----------------------|
   |           |            |  Internal       |                       |
   |           |            |  synchronization|                       |
   |           |            |  through MGCP   |                       |
   |-----------|------------|-----------------|-----------------------|
   | Bearer    |  Connection|  Telephony      |  Transmission of VOIP |
   | Data      |  through   |  gateways       |  data using RTP       |
   | Transport |  high speed|                 |  directly between the |
   | Plane     |  trunk     |                 |  H.323 station and the|
   |           |  groups    |                 |  gateway.             |
    ------------------------------------------------------------------


   In the MGCP model, the gateways focus on the audio signal
   translation function, while the Call Agent handles the signaling and
   call processing functions. As a consequence, the Call Agent
   implements the "signaling" layers of the H.323 standard, and
   presents itself as an "H.323 Gatekeeper" or as one or more "H.323
   Endpoints" to the H.323 systems.

1.2.  Relation with the IETF Standards

   While H.323 is the recognized standard for VoIP terminals, the IETF
   has also produced specifications for other types of multi-media
   applications. These other specifications include:

   *  the Session Description Protocol (SDP), RFC 2327,

   *  the Session Announcement Protocol (SAP),

   *  the Session Initiation Protocol (SIP),

   *  the Real Time Streaming Protocol (RTSP), RFC 2326.

Arango, et al.      Informational - Expires  July 2001         [Page 8]

Internet Draft                MGCP 1.0bis                  January 2001


   The latter three specifications are in fact alternative signaling
   standards that allow for the transmission of a session description
   to an interested party. SAP is used by multicast session managers to
   distribute a multicast session description to a large group of
   recipients, SIP is used to invite an individual user to take part in
   a point-to-point or unicast session, RTSP is used to interface a
   server that provides real time data. In all three cases, the session
   description is described according to SDP; when audio is
   transmitted, it is transmitted through the Real-time Transport
   Protocol, RTP.

   The distributed gateway systems and MGCP will enable PSTN telephony
   users to access sessions set up using SAP, SIP or RTSP. The Call
   Agent provides for signaling conversion, according to the following
   table:

    ------------------------------------------------------------------
   | Functional|  Phone     |  Terminating  |  IETF conforming systems|
   | Plane     |  switch    |  Entity       |                         |
   |-----------|------------|---------------|-------------------------|
   | Signaling |  Signaling |  Call agent   |  Signaling exchanges    |
   | Plane     |  exchanges |               |  with the Call Agent    |
   |           |  through   |               |  through SAP, SIP or    |
   |           |  SS7/ISUP  |               |  RTSP.                  |
   |-----------|------------|---------------|-------------------------|
   |           |            |               |  Negotiation of session |
   |           |            |               |  description parameters |
   |           |            |               |  through SDP (telephony |
   |           |            |               |  gateway terminated but |
   |           |            |               |  passed via the call    |
   |           |            |               |  agent to and from the  |
   |           |            |               |  IETF conforming system)|
   |-----------|------------|---------------|-------------------------|
   |           |            | Internal syn- |                         |
   |           |            | chronization  |                         |
   |           |            | through MGCP  |                         |
   |-----------|------------|---------------|-------------------------|
   | Bearer    |  Connection|  Telephony    |  Transmission of VoIP   |
   | Data      |  through   |  gateways     |  data using RTP,        |
   | Transport |  high speed|               |  directly between the   |
   | Plane     |  trunk     |               |  remote IP end system   |
   |           |  groups    |               |  and the gateway.       |
    ------------------------------------------------------------------


   The SDP standard has a pivotal status in this architecture. We will
   see in the following description that we also use it to carry
   session descriptions in MGCP.

1.3.  Definitions



Arango, et al.      Informational - Expires  July 2001         [Page 9]

Internet Draft                MGCP 1.0bis                  January 2001

   Trunk: A communication channel between two switching systems. E.g.,
   a DS0 on a T1 or E1 line.




















































Arango, et al.      Informational - Expires  July 2001        [Page 10]

Internet Draft                MGCP 1.0bis                  January 2001

2.  Media Gateway Control Interface

   The interface functions provide for connection control and endpoint
   control. Both use the same system model and the same naming
   conventions.


2.1.  Model and Naming Conventions

   The MGCP assumes a connection model where the basic constructs are
   endpoints and connections. Connections are grouped in calls. One or
   more connections can belong to one call. Connections and calls are
   set up at the initiative of one or several Call Agents.

2.1.1.  Types of Endpoints

   In the introduction, we presented several classes of gateways. Such
   classifications, however, can be misleading. Manufacturers can
   arbitrarily decide to provide several types of services in a single
   packaging. A single product could well, for example, provide some
   trunk connections to telephony switches, some primary rate
   connections and some analog line interfaces, thus sharing the
   characteristics of what we described in the introduction as
   "trunking", "access" and "residential" gateways. MGCP does not make
   assumptions about such groupings. We simply assume that media
   gateways support collections of endpoints. The type of the endpoint
   determines its functionality. Our analysis, so far, has led us to
   isolate the following basic endpoint types:

   *  Digital channel (DS0),

   *  Analog line,

   *  Announcement server access point,

   *  Interactive Voice Response access point,

   *  Conference bridge access point,

   *  Packet relay,

   *  Wiretap access point,

   *  ATM "trunk side" interface.

   In this section, we will develop the expected behavior of such
   endpoints.

   This list is not final. There may be other types of endpoints
   defined in the future, for example test endpoint that could be used
   to check network quality, or frame-relay endpoints that could be
   used to managed audio channels multiplexed over a frame-relay
   virtual circuit.

Arango, et al.      Informational - Expires  July 2001        [Page 11]

Internet Draft                MGCP 1.0bis                  January 2001


2.1.1.1.  Digital Channel (DS0)

   Digital channels provide an 8Khz*8bit service. Such channels are
   found in trunk and ISDN interfaces. They are typically part of
   digital multiplexes, such as T1, E1, T3 or E3 interfaces. Media
   gateways that support such channels are capable of translating the
   digital signals received on the channel, which may be encoded
   according to A or mu-law, using either the complete set of 8 bits or
   only 7 of these bits, into audio packets. When the media gateway
   also supports a NAS service, the gateway shall be capable of
   receiving either audio-encoded data (modem connection) or binary
   data (ISDN connection) and convert them into data packets.

                                         +-------
                           +------------+|
              (channel) ===|DS0 endpoint| -------- Connections
                           +------------+|
                                         +-------

   Media gateways should be able to establish several connections
   between the endpoint and the packet networks, or between the
   endpoint and other endpoints in the same gateway. The signals
   originating from these connections shall be mixed according to the
   connection "mode", as specified later in this document. The precise
   number of connections that an endpoint support is a characteristic
   of the gateway, and may in fact vary according with the allocation
   of resource within the gateway.

   In some cases, digital channels are used to carry signaling. This is
   the case for example of SS7 "F" links, or ISDN "D" channels. Media
   gateways that support these signaling functions shall be able to
   send and receive the signaling packets to and from a Call Agent,
   using the "back haul" procedures defined by the SIGTRAN working
   group of the IETF. Digital channels are sometimes used in
   conjunction with channel associated signaling, such as "MF R2".
   Media gateways that support these signaling functions shall be able
   to detect and produce the corresponding signals, such as for example
   "wink" or "A", according to the event signaling and reporting
   procedures defined in MGCP.

2.1.1.2.  Analog Line

   Analog lines can be used either as a "client" interface, providing
   service to a classic telephone unit, or as a "service" interface,
   allowing the gateway to send and receive analog calls.  When the
   media gateway also supports a NAS service, the gateway shall be
   capable of receiving audio-encoded data (modem connection) and
   convert them into data packets.





Arango, et al.      Informational - Expires  July 2001        [Page 12]

Internet Draft                MGCP 1.0bis                  January 2001

                                         +-------
                        +---------------+|
              (line) ===|analog endpoint| -------- Connections
                        +---------------+|
                                         +-------

   Media gateways should be able to establish several connections
   between the endpoint and the packet networks, or between the
   endpoint and other endpoints in the same gateway.  The audio signals
   originating from these connections shall be mixed according to the
   connection "mode", as specified later in this document.  The precise
   number of connections that an endpoint support is a characteristic
   of the gateway, and may in fact vary according with the allocation
   of resource within the gateway.  A typical gateway should however be
   able to support two or three connections per endpoint, in order to
   provide services such as "call waiting" or "three way calling".

2.1.1.3.  Announcement Server Access Point

   An announcement server endpoint provides access to an announcement
   service. Under requests from the Call Agent, the announcement server
   will "play" a specified announcement. The requests from the call
   agent will follow the event signaling and reporting procedures
   defined in MGCP.

                  +----------------------+
                  | Announcement endpoint| -------- Connection
                  +----------------------+

   A given announcement endpoint is not supposed to support more than
   one connection at a time. If several connections were established to
   the same endpoint, then the same announcements would be played
   simultaneously over all the connections.

   Connections to an announcement server are typically one way, or
   "half duplex" -- the announcement server is not expected to listen
   to the audio signals from the connection.

2.1.1.4.  Interactive Voice Response Access Point

   An Interactive Voice Response (IVR) endpoint provides access to an
   IVR service. Under requests from the Call Agent, the IVR server will
   "play" announcements and tones, and will "listen" to responses from
   the user. The requests from the Call Agent will follow the event
   signaling and reporting procedures defined in MGCP.

                      +-------------+
                      | IVR endpoint| -------- Connection
                      +-------------+

   A given IVR endpoint is not supposed to support more than one
   connection at a time. If several connections were established to the


Arango, et al.      Informational - Expires  July 2001        [Page 13]

Internet Draft                MGCP 1.0bis                  January 2001

   same endpoint, then the same tones and announcements would be played
   simultaneously over all the connections.

2.1.1.5.  Conference Bridge Access Point

   A conference bridge endpoint is used to provide access to a specific
   conference.

                                           +-------
               +--------------------------+|
               |Conference bridge endpoint| -------- Connections
               +--------------------------+|
                                           +-------

   Media gateways should be able to establish several connections
   between the endpoint and the packet networks, or between the
   endpoint and other endpoints in the same gateway. The signals
   originating from these connections shall be mixed according to the
   connection "mode", as specified later in this document. The precise
   number of connections that an endpoint support is a characteristic
   of the gateway, and may in fact vary according with the allocation
   of resource within the gateway.

2.1.1.6.  Packet Relay

   A packet relay endpoint is a specific form of conference bridge,
   that typically only supports two connections. Packets relays can be
   found in firewalls between a protected and an open network, or in
   transcoding servers used to provide interoperation between
   incompatible gateways, for example gateways that do not support
   compatible compression algorithms, or gateways that operate over
   different transmission networks such as IP and ATM.

                                           +-------
                   +---------------------+ |
                   |Packet relay endpoint|  2 connections
                   +---------------------+ |
                                           +-------

2.1.1.7.  Wiretap Access Point

   A wiretap access point provides access to a wiretap service,
   providing either a recording or a life playback of a connection.

                    +-----------------+
                    | Wiretap endpoint| -------- Connection
                    +-----------------+

   A given wiretap endpoint is not supposed to support more than one
   connection at a time. If several connections were established to the
   same endpoint, then the recording or playback would mix the audio
   signals received on this connections.


Arango, et al.      Informational - Expires  July 2001        [Page 14]

Internet Draft                MGCP 1.0bis                  January 2001

   Connections to an wiretap endpoint are typically one-way, or "half
   duplex" -- the wiretap server is not expected to signal its presence
   in a call.

2.1.1.8.  ATM "trunk side" Interface.

   ATM "trunk side" endpoints are typically found when one or several
   ATM permanent virtual circuits are used as a replacement for the
   classic "TDM" trunks linking switches.  When ATM/AAL2 is used,
   several trunks or channels are multiplexed on a single virtual
   circuit; each of these trunks correspond to a single endpoint.

                                          +-------
                      +------------------+|
          (channel) = |ATM trunk endpoint| -------- Connections
                      +------------------+|
                                          +-------

   Media gateways should be able to establish several connections
   between the endpoint and the packet networks, or between the
   endpoint and other endpoints in the same gateway. The signals
   originating from these connections shall be mixed according to the
   connection "mode", as specified later in this document. The precise
   number of connections that an endpoint support is a characteristic
   of the gateway, and may in fact vary according with the allocation
   of resource within the gateway.

2.1.2.  Endpoint Identifiers

   Endpoints identifiers have two components that both are case
   insensitive:

   *  the domain name of the gateway that is managing the endpoint,

   *  a local name within that gateway,

   Endpoint names will be of the form:

      local-endpoint-name@domain-name

   where domain-name is an absolute domain-name as defined in RFC 1034
   and includes a host portion, thus an example domain-name could be:

      mygateway.whatever.net

   Also, domain-name may be an IP-address on the form defined for
   domain name in RFC 821, thus another example could be

      [192.168.1.2]

   Both IPv4 and IPv6 addresses can be specified, however use of IP
   addresses as endpoint identifiers is generally discouraged.


Arango, et al.      Informational - Expires  July 2001        [Page 15]

Internet Draft                MGCP 1.0bis                  January 2001

   The local endpoint name is case-insensitive. The syntax of the local
   endpoint name is hierarchical, where the least specific component of
   the name is the leftmost term, and the most specific component is
   the rightmost term. The syntax depends on the type of endpoint being
   named and MAY start with a term that identifies the endpoint type.
   The local endpoint name MUST adhere to the following naming rules:

   1) The individual terms of the naming path MUST be separated by a
      single slash ("/", ASCII 2F hex).

   2) The individual terms are character strings composed of letters,
      digits or other printable characters, with the exception of
      characters used as delimiters ("/", "@"), characters used for
      wildcarding ("*", "$") and white spaces.

   3) Wild-carding is represented either by an asterisk ("*") or a
      dollar sign ("$") for the terms of the naming path which are to
      be wild-carded. Thus, if the full local endpoint name looks like

          term1/term2/term3

      then the Entity Name field looks like this depending on which
      terms are wild-carded:

          */term2/term3 if term1 is wild-carded
          term1/*/term3 if term2 is wild-carded
          term1/term2/* if term3 is wild-carded
          term1/*/*     if term2 and term3 are wild-carded, etc.

      In each of these examples a dollar sign could have appeared
      instead of an asterisk.

   4) A term represented by an asterisk is to be interpreted as: "use
      ALL values of this term known within the scope of the Media
      Gateway". This generally refers to all endpoints configured for
      service, regardless of their actual service state, i.e. in
      service or out of service. A term represented by a dollar sign is
      to be interpreted as: "use ANY ONE value of this term known
      within the scope of the Media Gateway". This generally only
      refers to endpoints that are in service. The description of a
      specific command may add further criteria for selection within
      the general rules given here.

   Note, that wild-cards may be applied to more than one term in which
   case they shall be evaluated from left to right. For example, if we
   have the endpoint names "a/1", "a/2", "b/1", and "b/2", then "$/*"
   will evaluate to either "a/1, a/2", or "b/1, b/2". However, "*/$"
   may evaluate to "a/1, b/1", "a/1, b/2", "a/2, b/1", or "a/2, b/2".
   The use of mixed wild-cards is considered error prone and is
   consequently discouraged.

   If the Media Gateway controls multiple physical gateways, the first
   term of the naming MUST identify the physical gateway containing the

Arango, et al.      Informational - Expires  July 2001        [Page 16]

Internet Draft                MGCP 1.0bis                  January 2001

   desired entity.  If the Media Gateway controls only a single
   physical gateway, the first term of the naming string MAY identify
   that physical gateway, depending on local practice.  A local name
   that is composed of only a wildcard character refers to either all
   (*) or any ($) endpoints within the media gateway.

2.1.3.  Calls and Connections

   Connections are created on the Call Agent on each endpoint that will
   be involved in the "call". In the classic example of a connection
   between two "DS0" endpoints (EP1 and EP2), the Call Agents
   controlling the end points will establish two connections (C1 and
   C2):

                  +---+                            +---+
    (channel1) ===|EP1|--(C1)--...        ...(C2)--|EP2|===(channel2)
                  +---+                            +---+

   Each connection will be designated locally by a connection
   identifier, and will be characterized by connection attributes.

   When the two endpoints are located on gateways that are managed by
   the same Call Agent, the creation is done via the three following
   steps:

   1) The Call Agent asks the first gateway to "create a connection" on
      the first endpoint. The gateway allocates resources to that
      connection, and respond to the command by providing a "session
      description". The session description contains the information
      necessary for a third party to send packets towards the newly
      created connection, such as for example IP address, UDP port, and
      packetization parameters.

   2) The Call Agent then asks the second gateway to "create a
      connection" on the second endpoint. The command carries the
      "session description" provided by the first gateway. The gateway
      allocates resources to that connection, and respond to the
      command by providing its own "session description".

   3) The Call Agent uses a "modify connection" command to provide this
      second "session description" to the first endpoint. Once this is
      done, communication can proceed in both directions.

   When the two endpoints are located on gateways that are managed by
   the different Call Agents, these two Call Agents shall exchange
   information through a call-agent to call-agent signaling protocol,
   in order to synchronize the creation of the connection on the two
   endpoints.

   Once established, the connection parameters can be modified at any
   time by a "modify connection" command. The Call Agent may for
   example instruct the gateway to change the compression algorithm


Arango, et al.      Informational - Expires  July 2001        [Page 17]

Internet Draft                MGCP 1.0bis                  January 2001

   used on a connection, or to modify the IP address and UDP port to
   which data should be sent, if a connection is "redirected".

   The Call Agent removes a connection by sending to the gateway a
   "delete connection" command.  The gateway may also, under some
   circumstances, inform a gateway that a connection could not be
   sustained.

   The following diagram provides a view of the states of a connection,
   as seen from the gateway:












































Arango, et al.      Informational - Expires  July 2001        [Page 18]

Internet Draft                MGCP 1.0bis                  January 2001

           Create connection
              received
                  |
                  V
         +-------------------+
         |resource allocation|-(failed)-+
         +-------------------+          |
                  |           (connection refused)
            (successful)
                  |
                  v
     +----------->+
     |            |
     |   +-------------------+
     |   |  remote session   |
     |   |   description     |----------(yes)--------+
     |   |    available ?    |                       |
     |   +-------------------+                       |
     |            |                                  |
     |          (no)                                 |
     |            |                                  |
     |      +-----------+                         +------+
     | +--->| half open |------> Delete   <-------| open |<----------+
     | |    |  (wait)   |      Connection         |(wait)|           |
     | |    +-----------+       received          +------+           |
     | |          |                 |              |                 |
     | |   Modify Connection        |         Modify Connection      |
     | |      received              |            received            |
     | |          |                 |                |               |
     | | +--------------------+     |       +--------------------+   |
     | | |assess modification |     |       |assess modification |   |
     | | +--------------------+     |       +--------------------+   |
     | |    |             |         |          |             |       |
     | |(failed)     (successful)   |      (failed)     (successful) |
     | |    |             |         |          |             |       |
     | +<---+             |         |          +-------------+-------+
     |                    |         |
     +<-------------------+         |
                                    |
                           +-----------------+
                           | Free connection |
                           | resources.      |
                           | Report.         |
                           +-----------------+
                                    |
                                    V

2.1.3.1.  Names of Calls

   One of the attributes of each connection is the "call identifier".

   Calls are identified by unique identifiers, independent of the
   underlying platforms or agents. Call identifiers are hexadecimal

Arango, et al.      Informational - Expires  July 2001        [Page 19]

Internet Draft                MGCP 1.0bis                  January 2001

   strings, which are created by the Call Agent. The maximum length of
   call identifiers is 32 characters.

   Call identifiers are expected to be unique within the system, or at
   a minimum, unique within the collection of Call Agents that control
   the same gateways. From the gateways perspective, the Call
   identifier is thus unique. When a Call Agent builds several
   connections that pertain to the same call, either on the same
   gateway or in different gateways, these connections that belong to
   the same call share the same call-id. This identifier can then be
   used by accounting or management procedures, which are outside the
   scope of MGCP.

2.1.3.2.  Names of Connections

   Connection identifiers are created by the gateway when it is
   requested to create a connection. They identify the connection
   within the context of an endpoint. Connection identifiers are
   treated in MGCP as hexadecimal strings.  The gateway should make
   sure that a proper waiting period, at least 3 minutes, elapses
   between the end of a connection that used this identifier and its
   use in a new connection for the same endpoint. (Gateways may decide
   to use identifiers that are unique within the context of the
   gateway.). The maximum length of a connection identifier is 32
   characters.

2.1.3.3.  Management of Resources, Attributes of Connections

   Many types of resources will be associated to a connection, such as
   specific signal processing functions or packetization functions.
   Generally, these resources fall in two categories:

   1) Externally visible resources, that affect the format of "the bits
      on the network" and must be communicated to the second endpoint
      involved in the connection.

   2) Internal resources, that determine which signal is being sent
      over the connection and how the received signals are processed by
      the endpoint.

   The resources allocated to a connection, and more generally the
   handling of the connection, are chosen by the gateway under
   instructions from the Call Agent.  The  Call Agent will provide
   these instructions by sending two set of parameters to the gateway:

   1) The local directives instruct the gateway on the choice of
      resources that should be used for a connection,

   2) When available, the "session description" provided by the other
      end of the connection (referred to as the remote session
      description).



Arango, et al.      Informational - Expires  July 2001        [Page 20]

Internet Draft                MGCP 1.0bis                  January 2001

   The local directives specify such parameters as the mode of the
   connection (e.g. send only, send-receive), preferred coding or
   packetization methods, usage of echo cancellation or silence
   suppression. (A detailed list can be found in the specification of
   the LocalConnectionOptions parameter of the CreateConnection
   command.) For each of these parameters, the Call Agent can either
   specify a value, a range of values, or no value at all. This allows
   various implementations to implement various levels of control, from
   a very tight control where the Call Agent specifies minute details
   of the connection handling to a very loose control where the Call
   Agent only specifies broad guidelines, such as the maximum
   bandwidth, and lets the gateway choose the detailed values.

   Based on the value of the local directives, the gateway will
   determine the resources allocated to the connection.  When this is
   possible, the gateway will choose values that are in line with the
   remote session description - but there is no absolute requirement
   that the parameters be exactly the same.

   Once the resource have been allocated, the gateway will compose a
   "session description" that describes the way it intends to receive
   packets. Note that the session description may in some cases present
   a range of values. For example, if the gateway is ready to accept
   one of several compression algorithm, it can provide a list of these
   accepted algorithms.





























Arango, et al.      Informational - Expires  July 2001        [Page 21]

Internet Draft                MGCP 1.0bis                  January 2001

                 Local Directives
                (from  Call Agent 1)
                        |
                        V
                 +-------------+
                 | resources   |
                 | allocation  |
                 | (gateway 1) |
                 +-------------+
                   |         |
                   V         |
                 Local       |
              Parameters     V
                   |      Session
                   |    Description               Local Directives
                   |         |                   (from Call Agent 2)
                   |         +---> Transmission----+      |
                   |                (CA to CA)     |      |
                   |                               V      V
                   |                           +-------------+
                   |                           | resources   |
                   |                           | allocation  |
                   |                           | (gateway 2) |
                   |                           +-------------+
                   |                               |      |
                   |                               |      V
                   |                               |    Local
                   |                               |  Parameters
                   |                            Session
                   |                          Description
                   |         +---- Transmission<---+
                   |         |      (CA to CA)
                   V         V
                 +-------------+
                 | modification|
                 | (gateway 1) |
                 +-------------+
                   |
                   V
                 Local
              Parameters

      -- Information flow: local directives & session descriptions --

2.1.3.4.  Special Case of Local Connections

   Large gateways include a large number of endpoints which are often
   of different types. In some networks, we may often have to set-up
   connections between endpoints that are located within the same
   gateway. Examples of such connections may be:

   *  Connecting a call to an Interactive Voice-Response unit,


Arango, et al.      Informational - Expires  July 2001        [Page 22]

Internet Draft                MGCP 1.0bis                  January 2001

   *  Connecting a call to a Conferencing unit,

   *  Routing a call from on endpoint to another, something often
      described as a "hairpin" connection.

   Local connections are much simpler to establish than network
   connections. In most cases, the connection will be established
   through some local interconnecting device, such as for example a TDM
   bus.

   When two endpoints are managed by the same gateway, it is possible
   to specify the connection in a single command that conveys the name
   of the two endpoints that will be connected. The command is
   essentially a "Create Connection" command which includes the name of
   the second endpoint in lieu of the "remote session description".

2.1.4.  Names of Call Agents and Other Entities

   The media gateway control protocol has been designed to allow the
   implementation of redundant Call Agents, for enhanced network
   reliability.  This means that there is no fixed binding between
   entities and hardware platforms or network interfaces.

   Call Agent names consist of two parts, similar to endpoint names.
   Semantically, the local portion of the name does not exhibit any
   internal structure. An example Call Agent name is:

      ca1@ca.whatever.net

   Reliability can be improved by the following precautions:

   *  Entities such as endpoints or Call Agents are identified by their
      domain name, not their network addresses. Several addresses can
      be associated with a domain name. If a command or a response
      cannot be forwarded to one of the network addresses,
      implementations should retry the transmission using another
      address.

   *  Entities may move to another platform. The association between a
      logical name (domain name) and the actual platform are kept in
      the domain name service. Call Agents and Gateways should keep
      track of the time-to-live of the record they read from the DNS.
      They should query the DNS to refresh the information if the time
      to live has expired.

   In addition to the indirection provided by the use of domain names
   and the DNS, the concept of "notified entity" is central to
   reliability and fail-over in MGCP. The "notified entity" for an
   endpoint is the Call Agent currently controlling that endpoint. At
   any point in time, an endpoint has one, and only one, "notified
   entity" associated with it, and when the endpoint needs to send a
   command to the Call Agent, it MUST send the command to the current
   "notified entity" for which endpoint(s) the command pertains. Upon

Arango, et al.      Informational - Expires  July 2001        [Page 23]

Internet Draft                MGCP 1.0bis                  January 2001

   startup, the "notified entity" MUST be set to a provisioned value.
   Most commands sent by the Call Agent include the ability to
   explicitly name the "notified entity" through the use of a
   "NotifiedEntity" parameter. The "notified entity" will stay the same
   until either a new "NotifiedEntity" parameter is received or the
   endpoint reboots. If a "NotifiedEntity" parameter is sent with an
   "empty" value, the "notified entity" for the endpoint will be set to
   empty. If the "notified entity" for an endpoint is empty or has not
   been set explicitly, the "notified entity" will then default to the
   source address of the last connection handling command or
   notification request received for the endpoint. Auditing will thus
   not change the "notified entity".

2.1.5.  Digit Maps

   The Call Agent can ask the gateway to collect digits dialed by the
   user. This facility is intended to be used with residential gateways
   to collect the numbers that a user dials; it may also be used with
   trunking gateways and access gateways alike, to collect the access
   codes, credit card numbers and other numbers requested by call
   control services.

   An alternative procedure is for the gateway to notify the Call Agent
   of the dialed digits, as soon as they are dialed. However, such a
   procedure generates a large number of interactions. It is preferable
   to accumulate the dialed numbers in a buffer, and to transmit them
   in a single message.

   The problem with this accumulation approach, however, is that it is
   hard for the gateway to predict how many numbers it needs to
   accumulate before transmission. For example, using the phone on our
   desk, we can dial the following numbers:

        ------------------------------------------------------
       |  0                     |  Local operator             |
       |  00                    |  Long distance operator     |
       |  xxxx                  |  Local extension number     |
       |  8xxxxxxx              |  Local number               |
       |  #xxxxxxx              |  Shortcut to local number at|
       |                        |  other corporate sites      |
       |  *xx                   |  Star services              |
       |  91xxxxxxxxxx          |  Long distance number       |
       |  9011 + up to 15 digits|  International number       |
        ------------------------------------------------------

   The solution to this problem is to load the gateway with a digit map
   that corresponds to the dial plan. This digit map is expressed using
   a syntax derived from the Unix system command, egrep. For example,
   the dial plan described above results in the following digit map:

      (0T|00T|[1-7]xxx|8xxxxxxx|#xxxxxxx|*xx|91xxxxxxxxxx|9011x.T)



Arango, et al.      Informational - Expires  July 2001        [Page 24]

Internet Draft                MGCP 1.0bis                  January 2001

   The formal syntax of the digit map is described by the DigitMap rule
   in the formal syntax description of the protocol (Appendix A) –
   support for basic digit map letters is mandatory while support for
   extension digit map letters is optional. A gateway receiving a digit
   map with an extension digit map letter not supported SHOULD return
   error code 537 (unknown digit map extension).

   A Digit-Map, according to this syntax, is defined either by a (case
   insensitive) "string" or by a list of strings. Each string in the
   list is an alternative numbering scheme, specified either as a set
   of digits or timers, or as regular expression over which the gateway
   will attempt to find a shortest possible match. A gateway that
   detects digits, letters or timers will:

   1) Add the event parameter code as a token to the end of an internal
      state variable called the "current dial string"

   2) Apply the current dial string to the digit map table, attempting
      a match to each regular expression in the Digit Map

   3) If the result is under-qualified (partially matches at least one
      entry in the digit map and doesn't completely match another
      entry), do nothing further.

   If the result matches an entry, or is over-qualified (i.e. no
   further digits could possibly produce a match), send the current
   digit string to the Call Agent. A match, in this specification, can
   be either a "perfect match," exactly matching one of the specified
   alternatives, or an impossible match, which occurs when the dial
   string does not match any of the alternatives. Unexpected timers,
   for example, can cause "impossible matches". Both perfect matches
   and impossible matches trigger notification of the accumulated
   digits.

   The following example illustrates the above. Assume we have the
   digit map:

      (xxxxxxx|x11)

   and a current dial string of "41". Given the input "1" the current
   dial string becomes "411". We have a partial match with "xxxxxxx",
   but a complete match with "x11", and hence we send "411" to the Call
   Agent.

   Timer T is a digit input timer that can be used in two ways:

   *  When timer T is used with a digit map, the timer is not started
      until the first digit is entered, and the timer is restarted
      after each new digit is entered until either a digit map match or
      mismatch occurs. In this case, timer T functions as an inter-
      digit timer.



Arango, et al.      Informational - Expires  July 2001        [Page 25]

Internet Draft                MGCP 1.0bis                  January 2001

   *  When timer T is used without a digit map, the timer is started
      immediately and simply cancelled (but not restarted) as soon as a
      digit is entered. In this case, timer T can be used as an inter-
      digit timer when overlap sending is used.

   When used with a digit map, timer T takes on one of two values,
   T-partial or T-critical. When at least one more digit is required
   for the digit string to match any of the patterns in the digit map,
   timer T takes on the value T-partial, corresponding to partial dial
   timing. If a timer is all that is required to produce a match, timer
   T takes on the value T-critical corresponding to critical dial
   timing. When timer T is used without a digit map, timer T takes on
   the value T-critical. The default value for T-partial is 16 seconds
   and the default value for T-critical is 4 seconds. The provisioning
   process may alter both of these.

   Digit maps are provided to the gateway by the Call Agent, whenever
   the Call Agent instructs the gateway to listen for digits.

2.1.6.  Packages

   MGCP is a modular and extensible protocol, however with
   extensibility comes the need to manage, identify, and name the
   extensions. This is achieved by the concept of packages, which are
   simply well-defined groupings of extensions. For example, one
   package may support a certain group of events and signals, e.g. off-
   hook and ringing, for analog access lines. Another package may
   support another group of events and signals for analog access lines
   or another type of endpoint such as video. One or more packages may
   exist for a given endpoint.

   MGCP allows the following types of extensions to be defined in a
   package:

   *  BearerInformation

   *  LocalConnectionOptions

   *  ExtensionParameters

   *  ConnectionModes

   *  Events

   *  Signals

   *  Actions

   *  DigitMapLetters

   *  ConnectionParameters



Arango, et al.      Informational - Expires  July 2001        [Page 26]

Internet Draft                MGCP 1.0bis                  January 2001

   *  RestartMethods

   *  ReasonCodes

   *  Return codes

   each of which will be explained in more detail below. The rules for
   defining each of these extensions in a package are described in
   Section 6.

   With the exception of DigitMapLetters a package defines a separate
   namespace for each type of extension by adding the package name as a
   prefix to the extension, i.e.:

      package-name/extension

   Thus the package-name is followed by a slash ("/") and the name of
   the extension.

   An endpoint supporting one or more packages may define one of those
   packages as the default package for the endpoint. Use of the package
   name for events and signals in the default package for an endpoint
   is optional, however it is recommended to always include the package
   name. All other extensions, except DigitMapLetter, defined in the
   package must include the package-name when referring to the
   extension.

   Package names are case insensitive strings of letters, hyphens and
   digits, with the restriction that hyphens shall never be the first
   or last character in a name. Examples of package names are "D", "T",
   and "XYZ". Package names are not case sensitive – names such as
   "XYZ", "xyz", and "xYz" are equal.

   Package definitions will be provided in other documents and with
   package names and extensions names registered with IANA. For more
   details, refer to section 6.

   Implementers can gain experience by using experimental packages. The
   name of an experimental package must start with the two characters
   "x-"; the IANA shall not register package names that start with
   these characters or the characters "x+" which are reserved. A
   gateway that receives a command referring to an unsupported package
   MUST return an error (error code 518 – unsupported package, is
   recommended).


2.1.7.  Events and Signals

   The concept of events and signals is central to MGCP. A Call Agent
   may ask to be notified about certain events occurring in an endpoint
   (e.g. off-hook events) by including the name of the event in a
   RequestedEvents parameter (in a NotificationRequest command - see
   later).

Arango, et al.      Informational - Expires  July 2001        [Page 27]

Internet Draft                MGCP 1.0bis                  January 2001


   A Call Agent may also request certain signals to be applied to an
   endpoint (e.g. dial-tone) by supplying the name of the event in a
   SignalRequests parameter.

   Events and signals are grouped in packages within which they share
   the same namespace which we will refer to as event names in the
   following. Event names are case insensitive strings of letters,
   hyphens and digits, with the restriction that hyphens shall never be
   the first or last character in a name. Some event codes may need to
   be parameterized with additional data, which is accomplished by
   adding the parameters between a set of parentheses. Event names are
   not case sensitive - values such as "hu", "Hu", "HU" or "hU" should
   be considered equal.

   Examples of event names can be "hu" (off hook or "hang-up"
   transition), "hf" (flash hook) or "0" (the digit zero).

   The package name is optional for events in the default package for
   an endpoint, however it is recommended to always include the package
   name. If the package name is excluded from the event name, the
   default package name for that endpoint is assumed. For example, for
   an analog access line which has the line package as a default with
   dial-tone ("dl") as one of the events in that package, the following
   two event names are equal:

      l/dl

   and

      dl

   For any other non-default packages that are associated with that
   endpoint-type, (such as the generic package for an analog access
   endpoint-type for example), the package name MUST be included with
   the event name. Again, unconditional inclusion of the package name
   is recommended.

   Digits, or letters, are supported in some packages, notably "DTMF".
   Digits and letters are defined by the rules "Digit" and "Letter" in
   the definition of digit maps. This definition refers to the digits
   (0 to 9), to the asterisk or star ("*") and orthotrope, number or
   pound sign ("#"), and to the letters "A", "B", "C" and "D", as well
   as the timer indication "T". These letters can be combined in "digit
   string" that represent the keys that a user punched on a dial. In
   addition, the letter "X" can be used to represent all digits, and
   the sign "$" can be used in wildcard notations. Also, extensions may
   define use of other letters. The need to easily express the digit
   strings has a consequence on the form of event names:

   An event name that does not denote a digit should always contain at
   least one character that is neither a digit, nor one of the letters


Arango, et al.      Informational - Expires  July 2001        [Page 28]

Internet Draft                MGCP 1.0bis                  January 2001

   A, B, C, D, T or X. (Such names should not contain the special signs
   "*", "#", "/" or "$".)

   A Call Agent may often have to ask a gateway to detect a group of
   events. Two conventions can be used to denote such groups:

   *  The wildcard convention can be used to detect any event belonging
      to a package, or a given event in many packages, or any event in
      any package supported by the gateway.

   *  The regular expression Range notation can be used to detect a
      range of digits.

   The star sign (*) can be used as a wildcard instead of a package
   name, and the keyword "all" can be used as a wildcard instead of an
   event name:

   *  A name such as "foo/all" denotes all events in package "foo".
   *  A name such as "*/bar" denotes the event "bar" in any package
      supported by the gateway.
   *  The names "*" or "*/all" denote all events supported by the
      gateway.

   The Call Agent can ask a gateway to detect a set of digits or
   letters either by individually describing those letters, or by using
   the "range" notation defined in the syntax of digit strings. For
   example, the Call Agent can:

   Use the letter "x" to denote "any letter or digit". Use the notation
   "[0-9#]" to denote the digits 0 to 9 and the pound sign.

   In some cases, Call Agents will request the gateway to generate or
   detect events on connections rather than on the endpoint itself. For
   example, gateways may be asked to provide a ringback tone on a
   connection. When an event shall be applied on a connection, the name
   of the connection is added to the name of the event, using an "at"
   sign (@) as a delimiter, as in:

      G/rt@0A3F58

   where G is the name of the package and rt is the name of the event.
   The wildcard character "*" (star) can be used to denote "all
   connections". When this convention is used, the gateway will
   generate or detect the event on all the connections that are
   connected to the endpoint. An example of this convention could be:

      R/qa@*

   where R is the name of the package and qa is the name of the event.
   The wildcard character "$" can be used to denote "the current
   connection". It should only be used by the Call Agent, when the
   event notification request is "encapsulated" within a connection
   creation or modification command. When this convention is used, the

Arango, et al.      Informational - Expires  July 2001        [Page 29]

Internet Draft                MGCP 1.0bis                  January 2001

   gateway will generate or detect the event on the connection that is
   currently being created or modified. An example of this convention
   is:

      G/rt@$

   The connection id, or a wildcard replacement, can be used in
   conjunction with the "all packages" and "all events" conventions.
   For example, the notation:

      */all@*

   can be used to designate all events on all connections.

   Signals are divided into different types depending on their
   behavior:

   *  On/off (OO):       Once applied, these signals last until they
      are turned off. This can only happen as the result of a new
      SignalRequests where the signal is turned off (see later).
      Signals of type OO are defined to be idempotent, thus multiple
      requests to turn a given OO signal on (or off) are perfectly
      valid and MUST NOT result in any errors. An On/Off signal could
      be a visual message waiting indicator (VMWI). Once turned on, it
      MUST NOT be turned off until explicitly instructed to by the Call
      Agent, or as a result of an endpoint restart, i.e. these signals
      will not turn off as a result the arrival of a requested event

   *  Time-out (TO):     Once applied, these signals last until they
      are either cancelled (by the occurrence of an event or by not
      being included in a subsequent (possibly empty) list of signals),
      or a signal-specific period of time has elapsed. A signal that
      times out will generate an "operation complete" event. A TO
      signal could be "ringback" timing out after 180 seconds. If an
      event occurs prior to the 180 seconds, the signal will, by
      default, be stopped (the "Keep signals active" action may
      override this behavior). If the signal is not stopped, the signal
      will time out, stop and generate an "operation complete" event,
      about which the Call Agent may or may not have requested to be
      notified. If the Call Agent has asked for the "operation
      complete" event to be notified, the "operation complete" event
      sent to the Call Agent will include the name(s) of the signal(s)
      that timed out (note that if parameters were passed to the
      signal, the parameters will not be reported). Time-out signals
      have a default time-out value defined for them, which may be
      altered by the provisioning process. Also, the time-out period
      may be provided as a parameter to the signal. A value of zero
      indicates that the time-out period is infinite. A TO signal that
      fails after being started, but before having generated on
      "operation complete" event will generate an "operation failure"
      event which will include the name of the signal that timed out.



Arango, et al.      Informational - Expires  July 2001        [Page 30]

Internet Draft                MGCP 1.0bis                  January 2001

   *  Brief (BR):        The duration of these signals is normally so
      short that they stop on their own. If a signal stopping event
      occurs, or a new SignalRequests is applied, a currently active BR
      signal will not stop. However, any pending BR signals not yet
      applied will be cancelled.  As an example, a brief tone could be
      a DTMF digit. If the DTMF digit "1" is currently being played,
      and a signal stopping event occurs, the "1" would finish playing.

   Signal(s) generated on a connection will include the name of that
   connection.

2.2.  Usage of SDP

   The Call Agent uses the MGCP to provision the gateways with the
   description of connection parameters such as IP addresses, UDP port
   and RTP profiles. These descriptions will follow the conventions
   delineated in the Session Description Protocol which is now an IETF
   proposed standard, documented in RFC 2327.

2.3.  Gateway Control Commands

2.3.1. Overview of Commands

   This section describes the commands of the MGCP. The service
   consists of connection handling and endpoint handling commands.
   There are nine commands in the protocol:

   *  The Call Agent can issue an EndpointConfiguration command to a
      gateway, instructing the gateway about the coding characteristics
      expected by the "line-side" of the endpoint.

   *  The Call Agent can issue a NotificationRequest command to a
      gateway, instructing the gateway to watch for specific events
      such as hook actions or DTMF tones on a specified endpoint .

   *  The gateway will then use the Notify command to inform the Call
      Agent when the requested events occur.

   *  The Call Agent can use the CreateConnection command to create a
      connection that terminates in an "endpoint" inside the gateway.

   *  The Call Agent can use the ModifyConnection command to change the
      parameters associated to a previously established connection.

   *  The Call Agent can use the DeleteConnection command to delete an
      existing connection. The DeleteConnection command may also be
      used by a gateway to indicate that a connection can no longer be
      sustained.

   *  The Call Agent can use the AuditEndpoint and AuditConnection
      commands to audit the status of an "endpoint" and any connections
      associated with it. Network management beyond the capabilities
      provided by these commands are generally desirable, e.g.

Arango, et al.      Informational - Expires  July 2001        [Page 31]

Internet Draft                MGCP 1.0bis                  January 2001

      information about the status of the gateway. Such capabilities
      are expected to be supported by the use of the Simple Network
      Management Protocol (SNMP) and definition of a MIB which is
      outside the scope of this specification.

   *  The Gateway can use the RestartInProgress command to notify the
      Call Agent that the gateway, or a group of endpoints managed by
      the gateway, is being taken out of service or is being placed
      back in service.

   These services allow a controller (normally, the Call Agent) to
   instruct a gateway on the creation of connections that terminate in
   an "endpoint" attached to the gateway, and to be informed about
   events occurring at the endpoint. An endpoint may be for example:

   *  A specific trunk circuit, within a trunk group terminating in a
      gateway,

   *  A specific announcement handled by an announcement server.

   Connections are grouped into "calls". Several connections, that may
   or may not belong to the same call, can terminate in the same
   endpoint. Each connection is qualified by a "mode" parameter, which
   can be set to "send only" (sendonly), "receive only" (recvonly),
   "send/receive" (sendrecv), "conference" (confrnce), "inactive"
   (inactive), "loopback", "continuity test" (conttest), "network loop
   back" (netwloop) or "network continuity test" (netwtest).

   Media generated by the endpoint is sent on connections whose mode is
   either "send only", "send/receive", or "conference". However, media
   generated by applying a signal to a connection is always sent on the
   connection, regardless of the mode.

   The handling of the audio streams received on connections is
   determined by the mode parameters:

   *  Audio streams received through connections in "receive",
      "conference" or "send/receive" mode are mixed and sent to the
      endpoint.

   *  Audio streams originating from the endpoint are transmitted over
      all the connections whose mode is "send", "conference" or
      "send/receive".

   *  In addition to being sent to the endpoint, an audio stream
      received through connections in "conference" mode are forwarded
      to all the other connections whose mode is "conference". The
      details of this forwarding, e.g., RTP translator or mixer, etc.,
      is outside the scope of this document.

   Note that in order to detect events on a connection, the connection
   must be in one of the modes "receive", "conference", or


Arango, et al.      Informational - Expires  July 2001        [Page 32]

Internet Draft                MGCP 1.0bis                  January 2001

   "send/receive". The event detection only applies to the incoming
   media.

   The "loopback" and "continuity test" modes are used during
   maintenance and continuity test operations. There are two flavors of
   continuity test, one specified by ITU and one used in the US. In the
   first case, the test is a loopback test. The originating switch will
   send a tone (the go tone) on the bearer circuit and expects the
   terminating switch to loopback the circuit. If the originating
   switch sees the same tone returned (the return tone), the COT has
   passed. If not, the COT has failed. In the second case, the go and
   return tones are different. The originating switch sends a certain
   go tone. The terminating switch detects the go tone, it asserts a
   different return tone in the backwards direction. When the
   originating switch detects the return tone, the COT is passed. If
   the originating switch never detects the return tone, the COT has
   failed.

   If the mode is set to "loopback", the gateway is expected to return
   the incoming signal from the endpoint back into that same endpoint.
   This procedure will be used, typically, for testing the continuity
   of trunk circuits according to the ITU specifications. If the mode
   is set to "continuity test", the gateway is informed that the other
   end of the circuit has initiated a continuity test procedure
   according to the GR specification. The gateway will place the
   circuit in the transponder mode required for dual-tone continuity
   tests.

   If the mode is set to "network loopback", the audio signals received
   from the connection will be echoed back on the same connection.

   If the mode is set to "network continuity test", the gateway will
   process the packets received from the connection according to the
   transponder mode required for dual-tone continuity test, and send
   the processed signal back on the connection.

2.3.2. EndpointConfiguration

   The EndpointConfiguration commands are used to specify the encoding
   of the signals that will be received by the endpoint.  For example,
   in certain international telephony configurations, some calls will
   carry mu-law encoded audio signals, while other will use A-law.  The
   Call Agent will use the EndpointConfiguration command to pass this
   information to the gateway. The configuration may vary on a call by
   call basis, but can also be used in the absence of any connection.

         ReturnCode
         <-- EndpointConfiguration(EndpointId,
                                   BearerInformation)

   EndpointId is the name of the endpoint in the gateway where
   EndpointConfiguration executes. The "any of" wildcard convention
   shall not be used. If the "all of" wildcard convention is used, the

Arango, et al.      Informational - Expires  July 2001        [Page 33]

Internet Draft                MGCP 1.0bis                  January 2001

   command applies to all the endpoints whose name matches the
   wildcard.

   BearerInformation is a parameter defining the coding of the data
   received from the line side. These information is encoded as a list
   of sub-parameters. The only sub-parameter defined in this version of
   the specification is the encoding method, whose values can be set to
   "A-law" and "mu-law". The set of sub-parameters may be extended.

   ReturnCode is a parameter returned by the gateway. It indicates the
   outcome of the command and consists of an integer number optionally
   followed by commentary.

2.3.3.  NotificationRequest

   The NotificationRequest commands are used to request the gateway to
   send notifications upon the occurrence of specified events in an
   endpoint. For example, a notification may be requested for when a
   gateway detects that an endpoint is receiving tones associated with
   fax communication. The entity receiving this notification may decide
   to use a different type of encoding method in the connections bound
   to this endpoint and instruct the gateway accordingly with a
   ModifyConnection Command.

         ReturnCode
         <-- NotificationRequest(EndpointId,
                                 [NotifiedEntity,]
                                 [RequestedEvents,]
                                 RequestIdentifier,
                                 [DigitMap,]
                                 [SignalRequests,]
                                 [QuarantineHandling,]
                                 [DetectEvents,]
                                 [encapsulated EndpointConfiguration])

   EndpointId is the identifier for the endpoint in the gateway where
   the NotificationRequest. The "any of" wildcard MUST NOT be used.

   NotifiedEntity is an optional parameter that specifies a new
   "notified entity" for the endpoint.

   RequestIdentifier is used to correlate this request with the
   notifications that it triggers. It will be repeated in the
   corresponding Notify command.

   RequestedEvents is a list of events, possibly qualified by event
   parameters, that the gateway is requested to detect and report. Such
   events include, for example, fax tones, continuity tones, or on-hook
   transition. Unless otherwise specified, events are detected on the
   endpoint, however some events can be detected on a connection.

   To each event is associate an action, which can be:


Arango, et al.      Informational - Expires  July 2001        [Page 34]

Internet Draft                MGCP 1.0bis                  January 2001

   *  Notify the event immediately, together with the accumulated list
      of observed events,

   *  Swap audio,

   *  Accumulate the event in an event buffer, but don't notify yet,

   *  Accumulate according to Digit Map,

   *  Keep Signal(s) active,

   *  Process the Embedded Notification Request,

   *  Ignore the event.

   Support for Notify, Accumulate, Keep Signal(s) Active, Embedded
   Notification Request, and Ignore is mandatory. Support for
   Accumulate according to Digit Map is mandatory on any endpoint
   capable of detecting DTMF. Support for any other action is optional.
   The set of actions can be extended.

   Some actions can be combined as shown in the table below, where "Y"
   means the two actions can be combined, and "N" means they can not:

       --------------------------------------------------------------
      |       | Notif | Swap | Accum | AccDi | KeSiA | EmbNo | Ignor |
      |--------------------------------------------------------------|
      | Notif |   N   |   Y  |   N   |   N   |   Y   |   Y*  |   N   |
      | Swap  |   -   |   N  |   Y   |   N   |   N   |   N   |   Y   |
      | Accum |   -   |   -  |   N   |   N   |   Y   |   Y   |   N   |
      | AccDi |   -   |   -  |   -   |   N   |   Y   |   N   |   N   |
      | KeSiA |   -   |   -  |   -   |   -   |   N   |   Y   |   Y   |
      | EmbNo |   -   |   -  |   -   |   -   |   -   |   N   |   N   |
      | Ignor |   -   |   -  |   -   |   -   |   -   |   -   |   N   |
       --------------------------------------------------------------
      Note (*): The "Embedded Notification Request" can only be
      combined with "Notify", if the gateway is allowed to issue
      several Notify commands in response to a single Notification
      request.

   When more than two two are combined, each action must be combinable
   with all the other actions as determined by the table above.

   If a client receives a request with an invalid or unsupported action
   or an illegal combination of actions, it MUST return an error to the
   Call Agent (error code 523 – unknown or illegal combination of
   actions recommended).

   When multiple actions are specified, e.g., "Keep signal(s) active"
   and "Notify", the individual actions are assumed to occur
   simultaneously.



Arango, et al.      Informational - Expires  July 2001        [Page 35]

Internet Draft                MGCP 1.0bis                  January 2001

   In addition to the RequestedEvents parameter specified in the
   command, some MGCP packages may contain "persistent events".

   Persistent events in a given package are always detected on an
   endpoint that implement that package. If a persistent event is not
   included in the list of RequestedEvents, and the event occurs, the
   event will be detected anyway, and processed like all other events,
   as if the persistent event had been requested with a Notify action.
   Thus, informally, persistent events can be viewed as always being
   implicitly included in the list of RequestedEvents with an action to
   Notify, although no glare detection, etc., will be performed.

   Non-persistent events are those events that need to be explicitly
   included in the RequestedEvents list. The (possibly empty) list of
   requested events completely replaces the previous list of requested
   events. In addition to the persistent events, only the events
   specified in the requested events list will be detected by the
   endpoint. If a persistent event is included in the RequestedEvents
   list, the action specified will then replace the default action
   associated with the event for the life of the RequestedEvents list,
   after which the default action is restored. For example, if "off-
   hook" was a persistent event, "Ignore off-hook" was specified, and a
   new request without any off-hook instructions were received, the
   default "Notify off-hook" operation then would be restored. A given
   event MUST NOT appear more than once in a RequestedEvents.

   The gateway will detect the union of the persistent events and the
   requested events. If an event is not included in either list, it
   will be ignored.

   The Call Agent can send a NotificationRequest with an empty
   RequestedEvents list to the gateway. The Call Agent can do so, for
   example, to a gateway when it does not want to collect any more DTMF
   digits. However, persistent events will still be detected and
   notified.

   The Swap Audio action can be used when a gateway handles more than
   one connection on an endpoint. This will be the case for three-way
   calling, call waiting, and possibly other feature scenarios. In
   order to avoid the round-trip to the Call Agent when just changing
   which connection is attached to the audio functions of the endpoint,
   the NotificationRequest can map an event (usually hook flash, but
   could be some other event) to a local function swap audio, which
   selects the "next" connection in a round robin fashion. If there is
   only one connection, this action is effectively a no-op.

   If signal(s) are desired to start when an event being looked for
   occurs, the "Embedded NotificationRequest" action can be used. The
   embedded NotificationRequest may include a new list of
   RequestedEvents, SignalRequests and a new digit map as well. The
   semantics of the embedded NotificationRequest is as if a new
   NotificationRequest was just received with the same NotifiedEntity,
   RequestIdentifier, QuarantineHandling and DetectEvents. When the

Arango, et al.      Informational - Expires  July 2001        [Page 36]

Internet Draft                MGCP 1.0bis                  January 2001

   "Embedded NotificationRequest" is activated, the "current dial
   string" will be cleared; the list of observed events and the
   quarantine buffer will be unaffected.

   MGCP implementations shall be able to support at least one level of
   embedding.  An embedded NotificationRequest that respects this
   limitation shall not contain another Embedded NotificationRequest.

   DigitMap is an optional parameter that allows the Call Agent to
   provision the endpoint with a digit map according to which digits
   will be accumulated. If this optional parameter is absent, the
   previously defined value is retained. This parameter must be
   defined, either explicitly or through a previous command, if the
   RequestedEvents parameters contain an request to "accumulate
   according to the digit map". The collection of these digits will
   result in a digit string. The digit string is initialized to a null
   string upon reception of the NotificationRequest, so that a
   subsequent notification only returns the digits that were collected
   after this request. Digits that were accumulated according to the
   digit map are reported as any other accumulated event, in the order
   in which they occur. It is therefore possible that other events
   accumulated are found in between the list of digits. If the gateway
   is requested to "accumulate according to digit map" and the gateway
   currently does not have a digit map for the endpoint in question,
   the gateway MUST return an error (error code 519 – endpoint does not
   have a digit map).

   SignalRequests is a parameter that contains the set of signals that
   the gateway is asked to apply. When multiple signals are specified,
   the signals will be applied in parallel. Unless otherwise specified,
   signals are applied to the endpoint, however some signals can be
   applied to a connection. Signals are identified by their name, which
   is an event name, and may be qualified by signal parameters. The
   following are examples of signals:

   *  Ringing,

   *  Busy tone,

   *  Call waiting tone,

   *  Off hook warning tone,

   *  Ringback tones on a connection

   Names and descriptions of signals are defined in the appropriate
   package.

   Signals are, by default, applied to endpoints. If a signal applied
   to an endpoint results in the generation of a media stream (audio,
   video, etc.), the media stream MUST NOT be forwarded on any
   connection associated with that endpoint, regardless of the mode of
   the connection. For example, if a call-waiting tone is applied to an

Arango, et al.      Informational - Expires  July 2001        [Page 37]

Internet Draft                MGCP 1.0bis                  January 2001

   endpoint involved in an active call, only the party using the
   endpoint in question will hear the call-waiting tone. However,
   individual signals may define a different behavior.

   When a signal is applied to a connection that has received a
   RemoteConnectionDescriptor the media stream generated by that signal
   will be forwarded on the connection regardless of the current mode
   of the connection. If a RemoteConnectionDescriptor has not been
   received, the gateway MUST return an error (error code 527 – missing
   RemoteConnectionDescriptor).

   When a (possibly empty) list of signal(s) is supplied, this list
   completely replaces the current list of active time-out signals.
   Currently active time-out signals that are not provided in the new
   list MUST be stopped and the new signal(s) provided will now become
   active. Currently active time-out signals that are provided in the
   new list of signals MUST remain active without interruption, thus
   the timer for such time-out signals will not be affected.
   Consequently, there is currently no way to restart the timer for a
   currently active time-out signal without turning the signal off
   first. If the time-out signal is parameterized, the original set of
   parameters will remain in effect, regardless of what values are
   provided subsequently. A given signal MUST NOT appear more than once
   in a SignalRequests.

   The action triggered by the SignalRequests is synchronized with the
   collection of events specified in the RequestedEvents parameter. For
   example, if the NotificationRequest mandates "ringing" and the event
   request ask to look for an "off-hook" event, the ringing shall stop
   as soon as the gateway detects an off hook event. The formal
   definition is that the generation of all "Time Out" signals shall
   stop as soon as one of the requested events is detected, unless the
   "Keep signals active" action is associated to the specified event.
   The RequestedEvents and SignalRequests may refer to the same event
   definitions. In one case, the gateway is asked to detect the
   occurrence of the event, and in the other case it is asked to
   generate it. The specific events and signals that a given endpoint
   can detect or perform are determined by the list of event packages
   that are supported by that end point. Each package specifies a list
   of events and actions that can be detected or performed. A gateway
   that is requested to detect or perform an event belonging to a
   package that is not supported by the specified endpoint must return
   an error (error code 518 - unsupported or unknown package
   recommended). When the event name is not qualified by a package
   name, the default package name for the end point is assumed. If the
   event name is not registered in this default package, the gateway
   must return an error(error code 522 – no such event or signal
   recommended).

   The Call Agent can send a NotificationRequest whose requested signal
   list is empty. It will do so for example when a time-out signal(s)
   should stop.


Arango, et al.      Informational - Expires  July 2001        [Page 38]

Internet Draft                MGCP 1.0bis                  January 2001

   If signal(s) are desired to start as soon as a "looked-for" event
   occurs, the "Embedded NotificationRequest" action can be used. The
   embedded NotificationRequest may include a new list of
   RequestedEvents, SignalRequests and a new Digit Map as well. The
   embedded NotificationRequest action allows the Call Agent to set up
   a "mini-script" to be processed by the gateway immediately following
   the detection of the associated event. Any SignalRequests specified
   in the embedded NotificationRequest will start immediately.
   Considerable care must be taken to prevent discrepancies between the
   Call Agent and the gateway. However, long-term discrepancies should
   not occur as new SignalRequests completely replaces the old list of
   active time-out signals, and BR-type signals always stop on their
   own. Limiting the number of On/Off-type signals is encouraged. It is
   considered good practice for a Call Agent to occasionally turn on
   all On/Off signals that should be on, and turn off all On/Off
   signals that should be off.

   The Ignore action can be used to ignore an event, e.g., to prevent a
   persistent event from being notified. However, the synchronization
   between the event and an active time-out signal will still occur by
   default (e.g. a time-out dial-tone signal will stop when an off-hook
   occurs even if off-hook was a requested event with action "Ignore").
   The optional QuarantineHandling parameter specifies the handling of
   "quarantine" events, i.e. events that have been detected by the
   gateway before the arrival of this NotificationRequest command, but
   have not yet been notified to the Call Agent.  The parameter
   provides a set of handling options:

   *  whether the quarantined events should be processed or discarded
      (the default is to process them.)

   *  whether the gateway is expected to generate at most one
      notification (step by step), or multiple notifications (loop), in
      response to this request (the default is exactly one.)

   When the parameter is absent, the default value is assumed.

   We should note that the quarantine-handling parameter also governs
   the handling of events that were detected and processed but not yet
   notified when the command is received.

   DetectEvents is an optional parameter that specifies a list of
   events that the gateway is requested to detect during the quarantine
   period. When this parameter is absent, the events that should be
   detected in the quarantine period are those listed in the last
   received DetectEvents list. In addition, the gateway should also
   detect the events specified in the request list, including those for
   which the "ignore" action is specified.

   Some events and signals, such as the in-line ringback or the quality
   alert, are performed or detected on connections terminating in the
   end point rather than on the endpoint itself.  The structure of the


Arango, et al.      Informational - Expires  July 2001        [Page 39]

Internet Draft                MGCP 1.0bis                  January 2001

   event names allow the Call Agent to specify the connection (or
   connections) on which the events should be performed or detected.

   The command may carry an encapsulated EndpointConfiguration command,
   that will apply to the same endpoint.  When this command is present,
   the parameters of the EndpointConfiguration command are inserted
   after the normal parameters of the NotificationRequest, with the
   exception of the EndpointId, which is not replicated.

   The encapsulated EndpointConfiguration command shares the fate of
   the NotificationRequest command. If the NotificationRequest is
   rejected, the EndpointConfiguration is not executed. ReturnCode is a
   parameter returned by the gateway. It indicates the outcome of the
   command and consists of an integer number optionally followed by
   commentary.

2.3.4.  Notify

   Notifications are sent via the Notify command and are sent by the
   gateway when the observed events occur.

         ReturnCode
         <-- Notify(EndpointId,
                    [NotifiedEntity,]
                    RequestIdentifier,
                    ObservedEvents)

   EndpointId is the name for the endpoint in the gateway which is
   issuing the Notify command. The identifier should be a fully
   qualified endpoint identifier, including the domain name of the
   gateway. The local part of the name shall not use the wildcard
   convention.

   NotifiedEntity is an optional parameter that identifies the entity
   to which the notifications is sent. This parameter is equal to the
   NotifiedEntity parameter of the NotificationRequest that triggered
   this notification. The parameter is absent if there was no such
   parameter in the triggering request. Regardless of the value of the
   NotifiedEntity parameter, the notification MUST be sent to the
   current "notified entity" for the endpoint.

   RequestIdentifier is a parameter that repeats the RequestIdentifier
   parameter of the NotificationRequest that triggered this
   notification. It is used to correlate this notification with the
   request that triggered it. Persistent events will be viewed here as
   if they had been included in the last NotificationRequest. When no
   NotificationRequest has been received, the RequestIdentifier used
   will be zero ("0").

   ObservedEvents is a list of events that the gateway detected. A
   single notification may report a list of events that will be
   reported in the order in which they were detected. The list may only
   contain the identification of events that were requested in the

Arango, et al.      Informational - Expires  July 2001        [Page 40]

Internet Draft                MGCP 1.0bis                  January 2001

   RequestedEvents parameter of the triggering NotificationRequest. It
   will contain the events that were either accumulated (but not
   notified) or treated according to digit map (but no match yet), and
   the final event that triggered the detection or provided a final
   match in the digit map. . It should be noted that digits are added
   to the list of observed events as they are accumulated, irrespective
   of whether they are accumulated according to the digit map or not.
   For example, if a user enters the digits "1234" and some event E is
   accumulated between the digits "3" and "4" being entered, the list
   of observed events would be "1, 2, 3, E, 4". Events that were
   detected on a connection will include the name of that connection.

   ReturnCode is a parameter returned by the Call Agent. It indicates
   the outcome of the command and consists of an integer number
   optionally followed by commentary.

2.3.5. CreateConnection

   This command is used to create a connection between two endpoints.

         ReturnCode,
         [ConnectionId,]
         [SpecificEndPointId,]
         [LocalConnectionDescriptor,]
         [SecondEndPointId,]
         [SecondConnectionId]
         <-- CreateConnection(CallId,
                              EndpointId,
                              [NotifiedEntity,]
                              [LocalConnectionOptions,]
                              Mode,
                              [{RemoteConnectionDescriptor |
                              SecondEndpointId}, ]
                              [Encapsulated NotificationRequest,]
                              [Encapsulated EndpointConfiguration])

   A connection is defined by its endpoints. The input parameters in
   CreateConnection provide the data necessary to build a gateway's
   "view" of a connection.

   CallId is a parameter that identifies the call (or session) to which
   this connection belongs. This parameter is, at a minimum, unique
   within the collection of Call Agents that control the same gateways.
   Connections that belong to the same call share the same call-id. The
   call-id can be used to identify calls for reporting and accounting
   purposes. It does not affect the handling of connections by the
   gateway.

   EndpointId is the identifier for the connection endpoint in the
   gateway where CreateConnection executes. The EndpointId can be
   fully-specified by assigning a value to the parameter EndpointId in
   the function call or it may be under-specified by using the "anyone"
   wildcard convention. If the endpoint is underspecified, the endpoint

Arango, et al.      Informational - Expires  July 2001        [Page 41]

Internet Draft                MGCP 1.0bis                  January 2001

   identifier will be assigned by the gateway and its complete value
   returned in the SpecificEndPointId parameter of the response. The
   endpoint assigned must be in service and must not already have any
   connections on it. The "all of" wildcard must not be used.

   The NotifiedEntity is an optional parameter that specifies a new
   "notified entity" for the endpoint.

   LocalConnectionOptions is a structure used by the Call Agent to
   direct the handling of the connection by the gateway. The fields
   contained in a LocalConnectionOptions structure may include one or
   more of the following:

   *  Codec compression algorithm: One or more codecs, listed in order
      of preference. See Section 2.6 for details on the codec selection
      process.

   *  Packetization period:        A single millisecond value or a
      range may be specified. The packetization period should not
      contradict the specification of the codec compression algorithm.
      If a codec is specified that has a frame size which is
      inconsistent with the packetization period, and that codec is
      selected, the gateway is authorized to use a packetization period
      that is consistent with the frame size even if it is different
      from that specified. In so doing, the gateway should choose a
      packetization period as close to that specified as possible.

   *  Bandwidth:                   The allowable bandwidth excluding
      lower level transports, but including header overhead at this
      level, e.g., RTP header plus payload. The bandwidth specification
      should not contradict the specification of codec compression
      algorithm or packetization period. If a codec is specified, then
      the gateway is authorized to use it, even if it results in the
      usage of a larger bandwidth than specified. Any discrepancy
      between the bandwidth and codec specification will not be
      reported as an error.

   *  Type of Service:             This indicates the class of service
      to be used for this connection. When the Type of Service is not
      specified, the gateway shall use a default or configured value.

   *  Usage of echo cancellation:  By default, the telephony gateways
      always perform echo cancellation. However, it may be necessary,
      for some calls, to turn off these operations. The echo
      cancellation parameter can have two values, "on" (when the echo
      cancellation is requested) and "off" (when it is turned off.)

   *  Silence Suppression:         The telephony gateways may perform
      voice activity detection, and avoid sending packets during
      periods of silence. However, it is necessary, for example for
      modem calls, to turn off this detection. The silence suppression
      parameter can have two values, "on" (when the detection is


Arango, et al.      Informational - Expires  July 2001        [Page 42]

Internet Draft                MGCP 1.0bis                  January 2001

      requested) and "off" (when it is turned off.) The default is
      "off".

   *  Gain Control:                The telephony gateways may perform
      gain control, in order to adapt the level of the signal. However,
      it is necessary, for example for modem calls, to turn off this
      function. The gain control parameter may either be specified as
      "automatic", or as an explicit number of decibels of gain. The
      default is to not perform gain control, which is equivalent to
      specifying a gain of 0 decibels.

   *  RTP security:                The Call agent can request the
      gateway to enable encryption of the audio Packets. It does so by
      providing a key specification, as specified in RFC 2327. By
      default, encryption is not performed.

   *  Network Type:                The Call Agent may instruct the
      gateway to prepare the connection on a specified type of network.
      If absent, the value is based on the network type of the gateway
      being used.

   *  Resource reservation:        The Call Agent may instruct the
      gateway to use network resource reservation for the connection.
      See Section 2.7 for details.

   The Call Agent specifies the relevant fields it cares about in the
   command and leaves the rest to the discretion of the gateway. For a
   detailed list of local connection options included with this
   specification refer to section 3.2.2.2. The set of local connection
   options can be extended.

   The Mode indicates the mode of operation for this side of the
   connection. The basic modes are "send", "receive", "send/receive",
   "conference", "inactive", "loopback", "continuity test", "network
   loop back" or "network continuity test". The expected handling of
   these modes is specified in the introduction of the "Gateway Control
   Commands", section 2.3. Some endpoints may not be capable of
   supporting all modes. If the command specifies a mode that the
   endpoint cannot support, an error shall be returned (error 517 -
   unsupported mode recommended). Also, if a connection has not yet
   received a RemoteConnectionDescriptor, an error MUST be returned if
   the connection is attempted to be placed in any of the modes "send
   only", "send/receive", "conference", or if a signal is to be applied
   to the connection (error code 527 – missing
   RemoteConnectionDescriptor recommended). The set of modes can be
   extended.

   The gateway returns a ConnectionId, that uniquely identifies the
   connection within one endpoint, and a LocalConnectionDescriptor,
   which is a session description that contains information about the
   connection, e.g. IP address and port for the media, as defined in
   SDP. The SpecificEndPointId is an optional parameter that identifies
   the responding endpoint. It is returned when the EndpointId argument

Arango, et al.      Informational - Expires  July 2001        [Page 43]

Internet Draft                MGCP 1.0bis                  January 2001

   referred to an "any of" wildcard name and the command succeeded.
   When a SpecificEndPointId is returned, the Call Agent shall use it
   as the EndpointId value in successive commands referring to this
   call.

   The SecondEndpointId can be used instead of the
   RemoteConnectionDescriptor to establish a connection between two
   endpoints located on the same gateway.  The connection is by
   definition a local connection. The SecondEndpointId can be fully-
   specified by assigning a value to the parameter SecondEndpointId in
   the function call or it may be under-specified by using the "any of"
   wildcard convention. If the SecondEndpointId is underspecified, the
   second endpoint identifier will be assigned by the gateway and its
   complete value returned in the SecondEndPointId parameter of the
   response.

   When a SecondEndpointId is specified, the command really creates two
   connections that can be manipulated separately through
   ModifyConnection and DeleteConnection commands.  The response to the
   creation provides a SecondConnectionId parameter that identifies the
   second connection. The second connection is established in
   "send/receive" mode.

   After receiving a "CreateConnection" request that did not include a
   RemoteConnectionDescriptor parameter, a gateway is in an ambiguous
   situation. Because it has exported a LocalConnectionDescriptor
   parameter, it can potentially receive packets. Because it has not
   yet received the RemoteConnectionDescriptor parameter of the other
   gateway, it does not know whether the packets that it receives have
   been authorized by the Call Agent. It must thus navigate between two
   risks, i.e. clipping some important announcements or listening to
   insane data. The behavior of the gateway is determined by the value
   of the Mode parameter:

   *  If the mode was set to ReceiveOnly, the gateway should accept the
      voice signals and transmit them through the endpoint.

   *  If the mode was set to Inactive, Loopback, or Continuity Test,
      the gateway should refuse the voice signals.

   *  If the mode was set to Network Loopback or Network Continuity
      Test, the gateway should perform the expected echo or Response.

   Note that the mode values SendReceive, Conference, and SendOnly
   don't make sense in this situation. They should be treated as
   errors, and the command should be rejected (Error code 517 or 527).

   The command may optionally contain an encapsulated Notification
   Request command, which applies to the EndpointId, in which case a
   RequestIdentifier parameter must be present, as well as, optionally,
   other parameters of the NotificationRequest with the exception of
   the EndpointId, which is not replicated. The encapsulated
   NotificationRequest is executed simultaneously with the creation of

Arango, et al.      Informational - Expires  July 2001        [Page 44]

Internet Draft                MGCP 1.0bis                  January 2001

   the connection. For example, when the Call Agent wants to initiate a
   call to a residential gateway, it should:

   *  ask the residential gateway to prepare a connection, in order to
      be sure that the user can start speaking as soon as the phone
      goes off hook,

   *  ask the residential gateway to start ringing,

   *  ask the residential gateway to notify the Call Agent when the
      phone goes off-hook.

   This can be accomplished in a single CreateConnection command, by
   also transmitting the RequestedEvents parameters for the off-hook
   event, and the SignalRequests parameter for the ringing signal.

   When these parameters are present, the creation and the
   NotificationRequest should be synchronized, which means that both
   should be accepted, or both refused. In our example, the
   CreateConnection may be refused if the gateway does not have
   sufficient resources, or cannot get adequate resources from the
   local network access, and the off-hook NotificationRequest can be
   refused in the glare condition, if the user is already off-hook. In
   this example, the phone should not ring if the connection cannot be
   established, and the connection should not be established if the
   user is already off-hook.

   The NotifiedEntity parameter, if present, applies to both the
   CreateConnection and the NotificationRequest command. It defines the
   new "notified entity" for the endpoint.

   The command may carry an encapsulated EndpointConfiguration command,
   which applies to the EndpointId.  When this command is present, the
   parameters of the EndpointConfiguration command are included with
   the normal parameters of the CreateConnection with the exception of
   the EndpointId, which is not replicated. The EndpointConfiguration
   command may be encapsulated together with an encapsulated
   NotificationRequest command. Note that both of these apply to the
   EndpointId only.

   The encapsulated EndpointConfiguration command shares the fate of
   the CreateConnection command. If the CreateConnection is rejected,
   the EndpointConfiguration is not executed.

   ReturnCode is a parameter returned by the gateway. It indicates the
   outcome of the command and consists of an integer number optionally
   followed by commentary.

2.3.6.  ModifyConnection

   This command is used to modify the characteristics of a gateway's
   "view" of a connection. This "view" of the call includes both the


Arango, et al.      Informational - Expires  July 2001        [Page 45]

Internet Draft                MGCP 1.0bis                  January 2001

   local connection descriptor as well as the remote connection
   descriptor.

         ReturnCode,
         [LocalConnectionDescriptor]
         <-- ModifyConnection(CallId,
                              EndpointId,
                              ConnectionId,
                              [NotifiedEntity,]
                              [LocalConnectionOptions,]
                              [Mode,]
                              [RemoteConnectionDescriptor,]
                              [Encapsulated NotificationRequest,]
                              [Encapsulated EndpointConfiguration])

   The parameters used are the same as in the CreateConnection command,
   with the addition of a ConnectionId that identifies the connection
   within the endpoint. This parameter is returned by the
   CreateConnection function, in addition to the local connection
   descriptor. It uniquely identifies the connection within the context
   of the endpoint.

   The EndpointId should be a fully qualified endpoint identifier.  The
   local name shall not use the wildcard conventions.

   The ModifyConnection command can be used to affect parameters of a
   connection in the following ways:

   *  Provide information about the other end of the connection,
      through the RemoteConnectionDescriptor.

   *  Activate or deactivate the connection, by changing the value of
      the Mode parameter. This can occur at any time during the
      connection, with arbitrary parameter values.

   *  Change the sending parameters of the connection, for example by
      switching to a different coding scheme, changing the
      packetization period, or modifying the handling of echo
      cancellation.

   Connections can only be activated if the RemoteConnectionDescriptor
   has been provided to the gateway. The receive only mode, however,
   can be activated without the provision of this descriptor.

   The command will only return a LocalConnectionDescriptor if the local
   connection parameters, such as RTP ports, were modified. Thus, if,
   for example, only the mode of the connection is changed, a
   LocalConnectionDescriptor will not be returned. Note however, that
   inclusion of LocalConnectionOptions in the command is not a
   prerequisite for local connection parameter changes to occur. If a
   connection parameter is omitted, (e.g. mode or silence suppression),
   the old value of that parameter will be retained if possible. If a
   parameter change necessitates a change in one or more unspecified

Arango, et al.      Informational - Expires  July 2001        [Page 46]

Internet Draft                MGCP 1.0bis                  January 2001

   parameters, the gateway is free to choose suitable values for the
   unspecified parameters that must change. This can for instance
   happen if the packetization period was not specified. If the new
   codec supported the old packetization period, the value of this
   parameter would not change, as a change would not be necessary.
   However, if it did not support the old packetization period, it
   would choose a suitable value.

   The command may optionally contain an encapsulated Notification
   Request command, in which case a RequestIdentifier parameter must be
   present, as well as, optionally, other parameters of the
   NotificationRequest with the exception of the EndpointId, which is
   not replicated. The encapsulated NotificationRequest is executed
   simultaneously with the modification of the connection. For example,
   when a connection is accepted, the calling gateway should be
   instructed to place the circuit in send-receive mode and to stop
   providing ringing tones. This can be accomplished in a single
   ModifyConnection command, by also transmitting the RequestedEvents
   parameters, for the on-hook event, and an empty SignalRequests
   parameter, to stop the provision of ringing tones.

   When these parameters are present, the modification and the
   NotificationRequest should be synchronized, which means that both
   should be accepted, or both refused.  The NotifiedEntity parameter,
   if present, applies to both the ModifyConnection and the
   NotificationRequest command.

   The command may carry an encapsulated EndpointConfiguration command,
   that will apply to the same endpoint.  When this command is present,
   the parameters of the EndpointConfiguration command are included
   with the normal parameters of the ModifyConnection with the
   exception of the EndpointId, which is not replicated. The
   EndpointConfiguration command may be encapsulated together with an
   encapsulated NotificationRequest command.

   The encapsulated EndpointConfiguration command shares the fate of
   the ModifyConnection command. If the ModifyConnection is rejected,
   the EndpointConfiguration is not executed.

   ReturnCode is a parameter returned by the gateway. It indicates the
   outcome of the command and consists of an integer number optionally
   followed by commentary.

2.3.7.  DeleteConnection (from the Call Agent)

   This command is used to terminate a connection. As a side effect, it
   collects statistics on the execution of the connection.







Arango, et al.      Informational - Expires  July 2001        [Page 47]

Internet Draft                MGCP 1.0bis                  January 2001

         ReturnCode,
         Connection-parameters
         <-- DeleteConnection(CallId,
                              EndpointId,
                              ConnectionId,
                              [Encapsulated NotificationRequest,]
                              [Encapsulated EndpointConfiguration])

   The endpoint identifier, in this form of the DeleteConnection
   command, shall be fully qualified. Wildcard conventions shall not be
   used.

   In the case of IP multicast, connections can be deleted individually
   and independently. However, in the unicast case where a connection
   has two ends, a DeleteConnection command has to be sent to both
   gateways involved in the connection. After the connection has been
   deleted, media streams previously supported by the connection are no
   longer available. Any media packets received for the old connection
   are simply discarded and no new media packets for the stream are
   sent.

   After the connection has been deleted, any loopback that has been
   requested for the connection should be cancelled.

   In response to the DeleteConnection command, the gateway returns a
   list of connection parameters that describe statistics for the
   connection.

   When the connection was for an Internet media stream, these
   parameters are:

   Number of packets sent:

      The total number of media packets transmitted by the sender since
      starting transmission on this connection. In the case of RTP, the
      count is not reset if the sender changes its synchronization
      source identifier (SSRC, as defined in RTP), for example as a
      result of a ModifyConnection command. The value is zero if the
      connection was always set in "receive only" mode and no signals
      were applied to the connection.

   Number of octets sent:

      The total number of payload octets (i.e., not including header or
      padding) transmitted in media packets by the sender since
      starting transmission on this connection. In the case of RTP, the
      count is not reset if the sender changes its SSRC identifier, for
      example as a result of a ModifyConnection command. The value is
      zero if the connection was always set in "receive only" mode and
      no signals were applied to the connection.

   Number of packets received:


Arango, et al.      Informational - Expires  July 2001        [Page 48]

Internet Draft                MGCP 1.0bis                  January 2001

      The total number of media packets received by the sender since
      starting reception on this connection. In the case of RTP, the
      count includes packets received from different SSRC, if the
      sender used several values. The value is zero if the connection
      was always set in "send only" mode.

   Number of octets received:

      The total number of payload octets (i.e., not including header,
      e.g. RTP, or padding) transmitted in media packets by the sender
      since starting transmission on this connection. In the case of
      RTP, the count includes packets received from different SSRC, if
      the sender used several values. The value is zero if the
      connection was always set in "send only" mode.

   Number of packets lost:

      The total number of media packets that have been lost since the
      beginning of reception. This number is defined to be the number
      of packets expected less the number of packets actually received,
      where the number of packets received includes any which are late
      or duplicates. For RTP. the count includes packets received from
      different SSRC, if the sender used several values. Thus packets
      that arrive late are not counted as lost, and the loss may be
      negative if there are duplicates. The count includes packets
      received from different SSRC, if the sender used several values.
      The number of packets expected is defined to be the extended last
      sequence number received, as defined next, less the initial
      sequence number received. The count includes packets received
      from different SSRC, if the sender used several values. The value
      is zero if the connection was always set in "send only" mode.

   Interarrival jitter:

      An estimate of the statistical variance of the media packet
      interarrival time measured in milliseconds and expressed as an
      unsigned integer. For RTP, the interarrival jitter J is defined
      to be the mean deviation (smoothed absolute value) of the
      difference D in packet spacing at the receiver compared to the
      sender for a pair of packets. Detailed computation algorithms are
      found in RFC 1889. The count includes packets received from
      different SSRC, if the sender used several values. The value is
      zero if the connection was always set in "send only" mode.

   Average transmission delay:

      An estimate of the network latency, expressed in milliseconds.
      For RTP, this is the average value of the difference between the
      NTP timestamp indicated by the senders of the RTCP messages and
      the NTP timestamp of the receivers, measured when this messages
      are received. The average is obtained by summing all the
      estimates, then dividing by the number of RTCP messages that have
      been received. When the gateway's clock is not synchronized by

Arango, et al.      Informational - Expires  July 2001        [Page 49]

Internet Draft                MGCP 1.0bis                  January 2001

      NTP, the latency value can be computed as one half of the round
      trip delay, as measured through RTCP. When the gateway cannot
      compute the one way delay or the round trip delay, the parameter
      conveys a null value.

   For a detailed definition of these variables, refer to RFC 1889.

   When the connection was set up over a LOCAL interconnect, the
   meaning of these parameters is defined as follows:

   Number of packets sent:
      Not significant – may be omitted.

   Number of octets sent:
      The total number of payload octets transmitted over the local
      connection.

   Number of packets received:
      Not significant – may be omitted.

   Number of octets received:
      The total number of payload octets received over the connection.

   Number of packets lost:
      Not significant – may be omitted. A value of zero is assumed.

   Interarrival jitter:
      Not significant – may be omitted. A value of zero is assumed.

   Average transmission delay:
      Not significant – may be omitted. A value of zero is assumed.

   The set of connection parameters can be extended. Also, the meaning
   may be further defined by other types of networks which may
   furthermore elect to not return all, or even any, of the above
   specified parameters.

   The command may optionally contain an encapsulated Notification
   Request command, in which case a RequestIdentifier parameter must be
   present, as well as, optionally, other parameters of the
   NotificationRequest with the exception of the EndpointId, which is
   not replicated. The encapsulated NotificationRequest is executed
   simultaneously with the deletion of the connection. For example,
   when a user hang-up is notified, the gateway should be instructed to
   delete the connection and to start looking for an off-hook event.
   This can be accomplished in a single DeleteConnection command, by
   also transmitting the RequestedEvents parameters, for the off-hook
   event, and an empty SignalRequests parameter.

   When these parameters are present, the DeleteConnection and the
   NotificationRequest should be synchronized, which means that both
   should be accepted, or both refused.


Arango, et al.      Informational - Expires  July 2001        [Page 50]

Internet Draft                MGCP 1.0bis                  January 2001

   The command may carry an encapsulated EndpointConfiguration command,
   that will apply to the same endpoint.  When this command is present,
   the parameters of the EndpointConfiguration command are included
   with the normal parameters of the DeleteConnection with the
   exception of the EndpointId, which is not replicated. The
   EndpointConfiguration command may be encapsulated together with an
   encapsulated NotificationRequest command.

   The encapsulated EndpointConfiguration command shares the fate of
   the DeleteConnection command. If the DeleteConnection is rejected,
   the EndpointConfiguration is not executed.

   ReturnCode is a parameter returned by the gateway. It indicates the
   outcome of the command and consists of an integer number optionally
   followed by commentary.

2.3.8.  DeleteConnection (from the gateway)

   In some circumstances, a gateway may have to clear a connection, for
   example because it has lost the resource associated with the
   connection, or because it has detected that the endpoint no longer
   is capable or willing to send or receive voice. The gateway
   terminates the connection by using a variant of the DeleteConnection
   command:

         ReturnCode,
         <-- DeleteConnection(CallId,
                              EndpointId,
                              ConnectionId,
                              ReasonCode,
                              Connection-parameters)

   The EndpointId, in this form of the DeleteConnection command, MUST
   be fully qualified. Wildcard conventions MUST NOT be used.

   The ReasonCode is a text string starting with a numeric reason code
   and optionally followed by a descriptive text string. The reason
   code indicates the cause of the DeleteConnection. A list of reason
   codes can be found in Section 2.5.

   In addition to the call, endpoint and connection identifiers, the
   gateway will also send the connection parameters that would have
   been returned to the Call Agent in response to a DeleteConnection
   command.

   ReturnCode is a parameter returned by the Call Agent. It indicates
   the outcome of the command and consists of an integer number
   optionally followed by commentary.

2.3.9.  DeleteConnection (multiple connections, from the Call Agent)

   A variation of the DeleteConnection function can be used by the Call
   Agent to delete multiple connections at the same time. The command

Arango, et al.      Informational - Expires  July 2001        [Page 51]

Internet Draft                MGCP 1.0bis                  January 2001

   can be used to delete all connections that relate to a Call for an
   endpoint:

         ReturnCode,
         <-- DeleteConnection(CallId,
                              EndpointId)

   The EndpointId, in this form of the DeleteConnection command, MUST
   NOT use the "any of" wildcard. All connections for the endpoint(s)
   with the CallId specified will be deleted. Note that the command
   will succeed if there were no connections with the CallId specified,
   as long as the EndpointId was valid. However, if EndpointId is
   invalid, the command will fail. The command does not return any
   individual statistics or call parameters.

   It can also be used to delete all connections that terminate in a
   given endpoint:

         ReturnCode,
         <-- DeleteConnection(EndpointId)

   The EndpointId, in this form of the DeleteConnection command, MUST
   NOT use the "any of" wildcard. Again, the command succeeds even if
   there were no connections on the endpoint(s).

   Finally, Call Agents can take advantage of the hierarchical
   structure of endpoint names to delete all the connections that
   belong to a group of endpoints. In this case, the "local name"
   component of the EndpointId will be specified using the "all value"
   wildcarding convention. The "any of" convention shall not be used.
   For example, if endpoint names are structured as the combination of
   a physical interface name and a circuit number, as in "X35V3+A4/13",
   the Call Agent may replace the circuit number by a wild card
   character "*", as in "X35V3+A4/*". This "wildcard" command instructs
   the gateway to delete all the connections that where attached to
   circuits connected to the physical interface "X35V3+A4".

   After the connections have been deleted, any loopback that has been
   requested for the connections should be cancelled.

   This command does not return any individual statistics or call
   parameters.

   ReturnCode is a parameter returned by the gateway. It indicates the
   outcome of the command and consists of an integer number optionally
   followed by commentary.

2.3.10.  AuditEndpoint

   The AuditEndPoint command can be used by the Call Agent to find out
   the status of a given endpoint.



Arango, et al.      Informational - Expires  July 2001        [Page 52]

Internet Draft                MGCP 1.0bis                  January 2001

         ReturnCode,
         EndPointIdList|{
         [RequestedEvents,]
         [QuarantineHandling,]
         [DigitMap,]
         [SignalRequests,]
         [RequestIdentifier,]
         [NotifiedEntity,]
         [ConnectionIdentifiers,]
         [DetectEvents,]
         [ObservedEvents,]
         [EventStates,]
         [BearerInformation,]
         [RestartMethod,]
         [RestartDelay,]
         [ReasonCode,]
         [Capabilities]}
         <-- AuditEndPoint(EndpointId,
                           [RequestedInfo])

   The EndpointId identifies the endpoint that is being audited. The
   "any of" wildcard convention MUST NOT be used.

   The EndpointId identifies the endpoint that is being audited. The
   "all of" wildcard convention can be used to start auditing of a
   group of endpoints. If this convention is used, the gateway shall
   return the list of endpoint identifiers that match the wildcard in
   the EndPointIdList parameter, which is simply one or more
   SpecificEndpointIds (each supplied separately). In the case where
   the "all of" wild card is used, RequestedInfo should not be included
   (if it is included, it must be ignored). Note that the use of the
   "all of" wildcard can potentially generate a large EndPointIdList.
   If the the resulting EndPointIdList is considered too large, the
   gateway returns an error (error code 555 - response too large, is
   recommended)

   When a non-wildcard EndpointId is specified, the (possibly empty)
   RequestedInfo parameter describes the information that is requested
   for the EndpointId specified. The following endpoint info can be
   audited with this command:

   RequestedEvents, DigitMap, SignalRequests, RequestIdentifier,
   QuarantineHandling, NotifiedEntity, ConnectionIdentifiers,
   DetectEvents, ObservedEvents, EventStates, BearerInformation,
   RestartMethod, RestartDelay, ReasonCode, and Capabilities.

   The list may be extended by extension parameters. The response will
   in turn include information about each of the items for which
   auditing info was requested. If an endpoint is queried about a
   parameter it does not understand, the endpoint MUST NOT generate an
   error; instead the parameter MUST be omitted from the response:



Arango, et al.      Informational - Expires  July 2001        [Page 53]

Internet Draft                MGCP 1.0bis                  January 2001

   *  RequestedEvents: The current value of RequestedEvents the
      endpoint is using including the action(s) associated with each
      event. Persistent events are included in the list.

   *  DigitMap: the digit map the endpoint is currently using. The
      parameter will be empty if the endpoint does not have a digit
      map.

   *  SignalRequests: A list of the; Time-Out signals that are
      currently active, On/Off signals that are currently "on" for the
      endpoint (with or without parameter), and any pending Brief
      signals. Time- Out signals that have timed-out, and currently
      playing Brief signals are not included.

   *  RequestIdentifier: the RequestIdentifier for the last
      Notification Request received by this endpoint (includes
      NotificationRequest encapsulated in Connection handling
      primitives). If no notification request has been received, the
      value zero will be returned.

   *  QuarantineHandling, the QuarantineHandling for the last
      NotificationRequest received by this endpoint. If
      QuarantineHandling was not included, or no notification request
      has been received, the default parameters will be returned.

   *  DetectEvents, the list of events that are currently detected in
      quarantine mode.

   *  NotifiedEntity, the current "notified entity" for the endpoint.

   *  ConnectionIdentifiers, the list of ConnectionIdentifiers for all
      connections that currently exist for the specified endpoint.

   *  ObservedEvents: the current list of observed events for the
      endpoint.

   *  EventStates: For events that have auditable states associated
      with them, the event corresponding to the state the endpoint is
      in, e.g., off-hook if the endpoint is off-hook. Note that the
      definition of the individual events will state if the event in
      question has an auditable state associated with it. Only
      persistent events and events from the last RequestedEvents can be
      included in this list.

   *  BearerInformation: the value of the last received
      BearerInformation parameter for this endpoint. The parameter will
      be empty if the endpoint has not received a BearerInformation
      parameter.

   *  RestartMethod: "restart" if the endpoint is in-service and
      operation is normal. Otherwise the value of the restart method
      parameter in the last RestartInProgress command issued by the
      endpoint. Note that a "disconnected" endpoint will thus only

Arango, et al.      Informational - Expires  July 2001        [Page 54]

Internet Draft                MGCP 1.0bis                  January 2001

      report "disconnected" as long as it actually is disconnected, and
      "restart" will be reported once it is no longer disconnected.
      Similarly, "cancel-graceful" should not be reported, but
      "graceful" might.

   *  RestartDelay: the value of the restart delay parameter if a
      RestartInProgress command was issued by the endpoint at the time
      of the response, or zero if the command would not include this
      parameter.

   *  ReasonCode: the value of the ReasonCode parameter in the last
      RestartInProgress or DeleteConnection command issued by the
      gateway for the endpoint, or the special value 000 if the
      endpoint's state is normal.

   *  Capabilities: the capabilities for the endpoint similar to the
      LocalConnectionOptions parameter and including event packages and
      connection modes. Extensions may be included as well. If an
      endpoint is queried about a capability it does not understand,
      the endpoint MUST NOT generate an error; instead the parameter
      MUST be omitted from the response. If there is a need to specify
      that some parameters, such as e.g., silence suppression, are only
      compatible with some codecs, then the gateway will return several
      capability sets:

      -  Compression Algorithm: A list of supported codecs. The rest of
         the parameters will apply to all codecs specified in this
         list.

      -  Packetization Period: A single value or a range may be
         specified.

      -  Bandwidth: A single value or a range corresponding to the
         range for packetization periods may be specified (assuming no
         silence suppression).

      -  Echo Cancellation: Whether echo cancellation is supported or
         not.

      -  Silence Suppression: Whether silence suppression is supported
         or not.

      -  Gain Control: Whether gain control is supported or not

      -  Type of Service: Whether type of service is supported or not.

      -  Resource Reservation: Whether resource reservation is
         supported or not

      -  Security: Whether media encryption is supported or not.

      -  Type of network: The type(s) of network supported


Arango, et al.      Informational - Expires  July 2001        [Page 55]

Internet Draft                MGCP 1.0bis                  January 2001

      -  Event Packages: A list of event packages supported. The first
         event package in the list will be the default package.

      -  Modes: A list of supported connection modes.

   The Call Agent may then decide to use the AuditConnection command to
   obtain further information about the connections.

   If no info was requested and the EndpointId refers to a valid
   endpoint, the gateway simply returns a positive acknowledgement.

   ReturnCode is a parameter returned by the gateway. It indicates the
   outcome of the command and consists of an integer number optionally
   followed by commentary.

2.3.11.  AuditConnection

   The AuditConnection command can be used by the Call Agent to
   retrieve the parameters attached to a connection:

         ReturnCode,
         [CallId,]
         [NotifiedEntity,]
         [LocalConnectionOptions,]
         [Mode,]
         [RemoteConnectionDescriptor,]
         [LocalConnectionDescriptor,]
         [ConnectionParameters]
         <-- AuditConnection(EndpointId,
                             ConnectionId,
                             RequestedInfo)

   The EndpointId parameter specifies the endpoint that handles the
   connection. The wildcard conventions shall not be used.

   The ConnectionId parameter is the identifier of the audited
   connection, within the context of the specified endpoint.

   The (possibly empty) RequestedInfo describes the information that is
   requested for the ConnectionId within the EndpointId specified. The
   following connection info can be audited with this command:

   CallId, NotifiedEntity, LocalConnectionOptions, Mode,
   RemoteConnectionDescriptor, LocalConnectionDescriptor,
   ConnectionParameters

   The AuditConnection response will in turn include information about
   each of the items auditing info was requested for:

   *  CallId, the CallId for the call the connection belongs to.

   *  NotifiedEntity, the current "notified entity" for the Connection.
      Note this is the same as the "notified entity" for the endpoint.

Arango, et al.      Informational - Expires  July 2001        [Page 56]

Internet Draft                MGCP 1.0bis                  January 2001


   *  LocalConnectionOptions, the LocalConnectionOptions that was
      supplied for the connection. Note that default parameters omitted
      from the LocalConnectionOptions will not be included.

   *  Mode, the current mode of the connection.

   *  RemoteConnectionDescriptor, the RemoteConnectionDescriptor that
      was supplied to the gateway for the connection.

   *  LocalConnectionDescriptor, the LocalConnectionDescriptor the
      gateway supplied for the connection.

   *  ConnectionParameters, the current values of the connection
      parameters for the connection.

   If no info was requested and the EndpointId is valid, the gateway
   simply checks that the connection exists, and if so returns a
   positive acknowledgement.

   ReturnCode is a parameter returned by the gateway. It indicates the
   outcome of the command and consists of an integer number optionally
   followed by commentary.

2.3.12.  RestartInProgress

   The RestartInProgress command is used by the gateway to signal that
   an endpoint, or a group of endpoints, is taken in or out of service.

         ReturnCode,
         [NotifiedEntity]
         <-- RestartInProgress(EndPointId,
                               RestartMethod,
                               [RestartDelay,]
                               [ReasonCode])

   The EndPointId identifies the endpoint(s) that are taken in or out
   of service.  The "all of" wildcard convention may be used to apply
   the command to a group of endpoint, such as for example all
   endpoints that are attached to a specified interface, or even all
   endpoints that are attached to a given gateway.  The "any of"
   wildcard convention shall not be used.

   The RestartMethod parameter specified the type of restart. The
   following values have been defined:

   *  A "graceful" restart method indicates that the specified
      endpoints will be taken out of service after the specified delay.
      The established connections are not yet affected, but the Call
      Agent should refrain to establish new connections, and should try
      to gracefully tear down the existing connections.



Arango, et al.      Informational - Expires  July 2001        [Page 57]

Internet Draft                MGCP 1.0bis                  January 2001

   *  A "forced" restart method indicates that the specified endpoints
      are taken abruptly out of service. The established connections,
      if any, are lost.

   *  A "restart" method indicates that service will be restored on the
      endpoints after the specified "restart delay", i.e. the endpoints
      will be in service. There are no connections that are currently
      established on the endpoints.

   *  A "disconnected" method indicates that the endpoint has become
      disconnected and is now trying to establish connectivity. The
      "restart delay" specifies the number of seconds the endpoint has
      been disconnected. Established connections are not affected.

   *  A "cancel-graceful" method indicates that a gateway is canceling
      a previously issued "graceful" restart command. The endpoints are
      still in service.

   The list of restart methods may be extended.

   The optional "restart delay" parameter is expressed as a number of
   seconds. If the number is absent, the delay value should be
   considered null.  In the case of the "graceful" method, a null delay
   indicates that the Call Agent should simply wait for the natural
   termination of the existing connections, without establishing new
   connections. The restart delay is always considered null in the case
   of the "forced" method.

   A restart delay of null for the "restart" method indicates that
   service has already been restored. This typically will occur after
   gateway startup/reboot. To mitigate the effects of a gateway IP
   address change as a result of a re-boot, the Call Agent MAY wish to
   either flush its DNS cache for the gateway's domain name or resolve
   the gateway's domain name by querying the DNS regardless of the TTL
   of a current resource record for the restarted gateway.

   The optional reason code parameter indicates the cause of the
   restart.

   Gateways SHOULD send a "graceful" or "forced" RestartInProgress
   message as a courtesy to the Call Agent when they are taken out of
   service, e.g., by being shutdown, or taken out of service by a
   network management system, although the Call Agent cannot rely on
   always receiving such messages. Gateways MUST send a "restart"
   RestartInProgress message with a null delay to their Call Agent when
   they are back in service according to the restart procedure
   specified in Section 4.4.5 - Call Agents can rely on receiving this
   message. Also, gateways MUST send a "disconnected" RestartInProgress
   message to their current "notified entity" according to the
   "disconnected" procedure specified in Section 4.4.6. The "restart
   delay" parameter MUST NOT be used with the "forced" restart method.



Arango, et al.      Informational - Expires  July 2001        [Page 58]

Internet Draft                MGCP 1.0bis                  January 2001

   The RestartInProgress message will be sent to the current notified
   entity for the EndpointId in question. It is expected that a default
   Call Agent, i.e., "notified entity", has been provisioned so that
   after a reboot, the default Call Agent will be the notified entity
   for the endpoint. Gateways should take full advantage of wild-
   carding to minimize the number of RestartInProgress messages
   generated when multiple endpoints in a gateway restart and the
   endpoints are managed by the same Call Agent.

   ReturnCode is a parameter returned by the gateway. It indicates the
   outcome of the command and consists of an integer number optionally
   followed by commentary.

   A NotifiedEntity may additionally be returned with the response from
   the Call Agent:

   *  If the response indicated success (return code 200 - transaction
      executed), the restart procedure has completed, and the
      NotifiedEntity returned is the new "notified entity" for the
      endpoint(s).

   *  If the response from the Call Agent indicated an error, the
      restart procedure is not yet complete, and must therefore be
      initiated again:

      -  If a NotifiedEntity parameter was returned, it then specifies
         the new "notified entity" for the endpoint(s), which must
         consequently be used when retrying the restart procedure. This
         should only be done with error code 521 (endpoint redirected).

2.4.  Return Codes and Error Codes.

   All MGCP commands are acknowledged. The acknowledgment carries a
   return code, which indicates the status of the command. The return
   code is an integer number, for which the following ranges of values
   have been defined:

   *  values between 000 and 099 indicate a response acknowledgement,

   *  values between 100 and 199 indicate a provisional response,

   *  values between 200 and 299 indicate a successful completion,

   *  values between 400 and 499 indicate a transient error

   *  values between 500 and 599 indicate a permanent error.

   *  values between 800 and 899 are package specific response codes.

   A broad description of transient errors (4XX error codes) versus
   permanent errors (5XX error codes) is as follows:



Arango, et al.      Informational - Expires  July 2001        [Page 59]

Internet Draft                MGCP 1.0bis                  January 2001

   *  If a Call Agent receives a transient error, there is the
      expectation of the possibility that a future similar request will
      be honored by the endpoint. In some cases, this may require some
      state change in the environment of the endpoint (e.g. hook state
      as in the case of error codes 401 or 402; resource availability
      as in the case of error code 403, or bandwidth availability as in
      the case of error code 404).

   *  Permanent errors (error codes 500 to 599) indicate one or more
      permanent conditions either due to protocol error or
      incompatibility between the endpoint and the Call Agent, or
      because of some error condition over which the Call Agent has no
      control. Examples are protocol errors, requests for endpoint
      capabilities that do not exist, errors on interfaces associated
      with the endpoint, missing or incorrect information in the
      request or any number of other conditions which will simply not
      disappear with time.

   The values that have been already defined are listed in the
   following list:

   000   Response Acknowledgement

   100   The transaction is currently being executed.  An actual
         completion message will follow on later.

   200   The requested transaction was executed normally. This return
         code may be used for a successful response to any command.

   250   The connection was deleted. This return code may only be used
         for a successful response to a DeleteConnection command.

   400   The transaction could not be executed, due to a transient
         error.

   401   The phone is already off hook

   402   The phone is already on hook

   403   The transaction could not be executed, because the endpoint
         does not have sufficient resources at this time

   404   Insufficient bandwidth at this time

   405   The transaction could not be executed, because the endpoint is
         "restarting".

   500   The transaction could not be executed, because the endpoint is
         unknown.

   501   The transaction could not be executed, because the endpoint is
         not ready. This includes the case where the endpoint is out of
         service.

Arango, et al.      Informational - Expires  July 2001        [Page 60]

Internet Draft                MGCP 1.0bis                  January 2001


   502   The transaction could not be executed, because the endpoint
         does not have sufficient resources

   510   The transaction could not be executed, because a protocol
         error was detected.

   511   The transaction could not be executed, because the command
         contained an unrecognized extension.

   512   The transaction could not be executed, because the gateway is
         not equipped to detect one of the requested events.

   513   The transaction could not be executed, because the gateway is
         not equipped to generate one of the requested signals.

   514   The transaction could not be executed, because the gateway
         cannot send the specified announcement.

   515   The transaction refers to an incorrect connection-id (may have
         been already deleted)

   516   The transaction refers to an unknown call-id.

   517   Unsupported or invalid mode.

   518   Unsupported or unknown package.

   519   Endpoint does not have a digit map.

   520   The transaction could not be executed, because the endpoint is
         "restarting". In most cases this would be a transient error,
         in which case, error code 405 should be used instead.

   521   Endpoint redirected to another Call Agent.

   522   No such event or signal.

   523   Unknown action or illegal combination of actions

   524   Internal inconsistency in LocalConnectionOptions

   525   Unknown extension in LocalConnectionOptions

   526   Insufficient bandwidth. In cases where this is a transient
         error, error code 404 should be used instead.

   527   Missing RemoteConnectionDescriptor

   528   Incompatible protocol version

   529   Internal hardware failure


Arango, et al.      Informational - Expires  July 2001        [Page 61]

Internet Draft                MGCP 1.0bis                  January 2001

   530   CAS signaling protocol error.

   531   Failure of a grouping of trunks (e.g. facility failure).

   532   Unsupported value(s) in LocalConnectionOptions

   533   Response too large

   534   Codec negotiation failure

   535   Packetization period not supported

   536   Unknown or unsupported RestartMethod

   537   Unknown or unsupported digit map extension

   540   Per endpoint connection limit exceeded

   The set of return codes may be extended in a future version of the
   protocol. Implementations that receive a return code equal to or
   larger than 300 which they do not understand, should assume the
   return code indicates an error.

2.5.  Reason Codes

   Reason codes are used by the gateway when deleting a connection to
   inform the Call Agent about the reason for deleting the connection.
   They may also be used in a RestartInProgress command, to inform the
   gateway of the Restart's reason.

   The reason code is an integer number, and the following values have
   been defined:

   000   Endpoint state is normal. (This code is used only in response
         to audit requests.)

   900   Endpoint malfunctioning

   901   Endpoint taken out of service

   902   Loss of lower layer connectivity (e.g., downstream sync)

   903   QoS resource reservation was lost

   The set of reason codes can be extended.

2.6. Use of Local Connection Options and Connection Descriptors

   As indicated previously, the normal sequence in setting up a bi-
   directional connection involves at least 3 steps:

   1) The Call Agent asks the first gateway to "create a connection" on
      an endpoint. The gateway allocates resources to that connection,

Arango, et al.      Informational - Expires  July 2001        [Page 62]

Internet Draft                MGCP 1.0bis                  January 2001

      and responds to the command by providing a "session description"
      (referred to as its LocalConnectionDescriptor). The session
      description contains the information necessary for another party
      to send packets towards the newly created connection.

   2) The Call Agent then asks the second gateway to "create a
      connection" an endpoint. The command carries the "session
      description" provided by the first gateway (now referred to as
      the RemoteConnectionDescriptor). The gateway allocates resources
      to that connection, and responds to the command by providing its
      own "session description" (LocalConnectionDescriptor).

   3) The Call Agent uses a "modify connection" command to provide this
      second "session description" (now referred to as the
      RemoteConnectionDescriptor ) to the first endpoint. Once this is
      done, communication can proceed in both directions.

   When the Call Agent issues a Create or Modify Connection command,
   there are thus three parameters that determine the media supported
   by that connection:

   *  LocalConnectionOptions:      Supplied by the Call Agent to
      control the media parameters used by the gateway for the
      connection. When supplied, the gateway must conform to these
      media parameters until either the connection is deleted, or a
      ModifyConnection command is received.

   *  RemoteConnectionDescriptor:  Supplied by the Call Agent to convey
      the media parameters supported by the other side of the
      connection. When supplied, the gateway must conform to these
      media parameters until either the connection is deleted, or a
      ModifyConnection command is received.

   *  LocalConnectionDescriptor:   Supplied by the gateway to the Call
      Agent to convey the media parameters it supports for the
      connection. When supplied, the gateway must honor the media
      parameters until either the connection is deleted, or the gateway
      issues a new LocalConnectionDescriptor.

   In determining which codec(s) to provide in the
   LocalConnectionDescriptor, there are three lists of codecs that a
   gateway needs to consider:

   *  A list of codecs provided in the LocalConnectionOptions (either
      explicitly or implicitly).

   *  A list of codecs in the RemoteConnectionDescriptor

   *  An internal list of codecs that the gateway can support for the
      connection. A gateway may support one or more codecs for a given
      connection.



Arango, et al.      Informational - Expires  July 2001        [Page 63]

Internet Draft                MGCP 1.0bis                  January 2001

   Codec selection (incl. all relevant media parameters) can then be
   described by the following steps:

   1. An approved list of codecs is formed by taking the intersection
      of the internal list of codecs and codecs allowed by the
      LocalConnectionOptions. If LocalConnectionOptions were not
      provided, the approved list of codecs thus contains the internal
      list of codecs.

   2. If the approved list of codecs is empty, a codec negotiation
      failure has occurred and an error response is generated (error
      code 534 – codec negotiation failure – is recommended)

   3. Otherwise, a negotiated list of codecs is formed by taking the
      intersection of the approved list of codecs and codecs allowed by
      the RemoteConnectionDescriptor. If a RemoteConnectionDescriptor
      was not provided, the negotiated list of codecs thus contains the
      approved list of codecs.

   4. If the negotiated list of codecs is empty, a codec negotiation
      failure has occurred and an error response is generated (error
      code 534 – codec negotiation failure – is recommended)

   5. Otherwise, codec negotiation has succeeded, and the negotiated
      list of codecs is returned in the LocalConnectionDescriptor.

   Note that both LocalConnectionOptions and the
   RemoteConnectionDescriptor can contain a list of codecs ordered by
   preference. When both are supplied, the gateway should adhere to the
   preferences provided in the LocalConnectionOptions.

2.7. Resource Reservations

   The gateways can be instructed to perform a reservation, for example
   using RSVP, on a given connection.  When a reservation is needed,
   the call agent will specify the reservation profile that should be
   used, which is either "controlled load" or "guaranteed service".
   The absence of reservation can be indicated by asking for the "best
   effort" service, which is the default value of this parameter. When
   reservation has been asked on a connection, the gateway will:

   *  start emitting RSVP "PATH" messages if the connection is in
      "send-only", "send-receive", "conference", "network loop back" or
      "network continuity test" mode (if a remote connection descriptor
      has been received,)

   *  start emitting RSVP "RESV" messages as soon as it receives "PATH"
      messages if the connection is in "receive-only", "send-receive",
      "conference", "network loop back" or "network continuity test"
      mode.




Arango, et al.      Informational - Expires  July 2001        [Page 64]

Internet Draft                MGCP 1.0bis                  January 2001

   The RSVP filters will be deduced from the characteristics of the
   connection. The RSVP resource profiles will be deduced from the
   connection's bandwidth and packetization period.



















































Arango, et al.      Informational - Expires  July 2001        [Page 65]

Internet Draft                MGCP 1.0bis                  January 2001

3.  Media Gateway Control Protocol

   The MGCP implements the media gateway control interface as a set of
   transactions. The transactions are composed of a command and a
   mandatory response. There are nine commands:

   *  EndpointConfiguration

   *  CreateConnection

   *  ModifyConnection

   *  DeleteConnection

   *  NotificationRequest

   *  Notify

   *  AuditEndpoint

   *  AuditConnection

   *  RestartInProgress

   The first five commands are sent by the Call Agent to a gateway. The
   Notify command is sent by the gateway to the Call Agent. The gateway
   may also send a DeleteConnection as defined in 2.3.6. The Call Agent
   may send either of the Audit commands to the gateway.  The Gateway
   may send a RestartInProgress command to the Call Agent.

3.1.  General Description

   All commands are composed of a Command header, optionally followed
   by a session description.

   All responses are composed of a Response header, optionally followed
   by a session description.

   Headers and session descriptions are encoded as a set of text lines,
   separated by a carriage return and line feed character (or,
   optionally, a single line-feed character). The headers are separated
   from the session description by an empty line.

   MGCP uses a transaction identifier to correlate commands and
   responses. The transaction identifier is encoded as a component of
   the command header and repeated as a component of the response
   header (see sections 3.2.1.2 and 3.3).

   An ABNF grammar for MGCP is provided in Appendix A.

3.2.  Command Header

   The command header is composed of:

Arango, et al.      Informational - Expires  July 2001        [Page 66]

Internet Draft                MGCP 1.0bis                  January 2001


   *  A command line, identifying the requested action or verb, the
      transaction identifier, the endpoint towards which the action is
      requested, and the MGCP protocol version,

   *  A set of parameter lines, composed of a parameter name followed
      by a parameter value.

   Unless otherwise noted or dictated by other referenced standards,
   each component in the command header is case insensitive. This goes
   for verbs as well as parameters and values, and all comparisons MUST
   treat upper and lower case as well as combinations of these as being
   equal.

3.2.1.  Command Line

   The command line is composed of:

   *  The name of the requested verb,

   *  The identification of the transaction,

   *  The name of the endpoint(s) that should execute the command (in
      notifications or restarts, the name of the endpoint(s) that is
      issuing the command),

   *  The protocol version.

   These four items are encoded as strings of printable ASCII
   characters, separated by white spaces, i.e. the ASCII space (0x20)
   or tabulation (0x09) characters. It is recommended to use exactly
   one ASCII space separator. However, MGCP entities must be able to
   parse messages with additional white space characters.

3.2.1.1.  Coding of the Requested Verb

   The verbs that can be requested are encoded as four letter upper or
   lower case ASCII codes (comparisons should be case insensitive) as
   defined in the following table:

                  -----------------------------
                 |       Verb           | Code |
                 |----------------------|------|
                 | EndpointConfiguration| EPCF |
                 | CreateConnection     | CRCX |
                 | ModifyConnection     | MDCX |
                 | DeleteConnection     | DLCX |
                 | NotificationRequest  | RQNT |
                 | Notify               | NTFY |
                 | AuditEndpoint        | AUEP |
                 | AuditConnection      | AUCX |
                 | RestartInProgress    | RSIP |
                  -----------------------------

Arango, et al.      Informational - Expires  July 2001        [Page 67]

Internet Draft                MGCP 1.0bis                  January 2001


   The transaction identifier is encoded as a string of up to 9 decimal
   digits. In the command line, it immediately follows the coding of
   the verb.

   New verbs may be defined in further versions of the protocol. It may
   be necessary, for experimentation purposes, to use new verbs before
   they are sanctioned in a published version of this protocol.
   Experimental verbs should be identified by a four letter code
   starting with the letter X, such as for example XPER.

3.2.1.2.  Transaction Identifiers

   MGCP uses a transaction identifier to correlate commands and
   responses.  A gateway supports two separate transaction identifier
   name spaces:

   * a transaction identifier name space for sending transactions, and

   * a transaction identifier name space for receiving transactions.

   At a minimum, transaction identifiers for commands sent to a given
   gateway MUST be unique for the maximum lifetime of the transactions
   within the collection of Call Agents that control that gateway.
   Thus, regardless of the sending Call Agent, gateways can always
   detect duplicate transactions by simply examining the transaction
   identifier. The coordination of these transaction identifiers
   between Call Agents is outside the scope of this specification
   though.

   Transaction identifiers for all commands sent from a given gateway
   MUST be unique for the maximum lifetime of the transactions
   regardless of which Call Agent the command is sent to. Thus, a Call
   Agent can always detect a duplicate transaction from a gateway by
   the combination of the domain-name of the endpoint and the
   transaction identifier.

   The transaction identifier is encoded as a string of up to nine
   decimal digits. In the command lines, it immediately follows the
   coding of the verb.

   Transaction identifiers have values between 1 and 999999999. An MGCP
   entity MUST NOT reuse a transaction identifier more quickly than
   three minutes after completion of the previous command in which the
   identifier was used.

3.2.1.3.  Coding of the Endpoint Identifiers and Entity Names

   The endpoint identifiers and entity names are encoded as case
   insensitive e-mail addresses, as defined in RFC 821, although with
   some syntactic restrictions on the local part of the name. In these
   addresses, the domain name identifies the system where the endpoint


Arango, et al.      Informational - Expires  July 2001        [Page 68]

Internet Draft                MGCP 1.0bis                  January 2001

   is attached, while the left side identifies a specific endpoint or
   entity on that system.

   Examples of such addresses can be:

    ------------------------------------------------------------------
   | hrd4/56@gw23.example.net     |  Circuit number 56 in             |
   |                              |  interface "hrd4" of the Gateway  |
   |                              |  23 of the "Example" network      |
   | Call-agent@ca.example.net    |  Call Agent for the               |
   |                              |  "example" network                |
   | Busy-signal@ann12.example.net|  The "busy signal" virtual        |
   |                              |  endpoint in the announcement     |
   |                              |  server number 12.                |
    ------------------------------------------------------------------

   The name of a notified entity is expressed with the same syntax,
   with the possible addition of a port number as in:

      Call-agent@ca.example.net:5234

   In case the port number is omitted, the default MGCP Call Agent port
   (2727) will be used.

3.2.1.4.  Coding of the Protocol Version

   The protocol version is coded as the key word MGCP followed by a
   white space and the version number, and optionally followed by a
   profile name.  The version number is composed of a major version,
   coded by a decimal number, a dot, and a minor version number, coded
   as a decimal number. The version described in this document is
   version 1.0.

   The profile name, if present, is represented by white-space
   separated strings of visible (printable) characters extending to the
   end of the line. Profile names may be defined for user communities
   who want to apply restrictions or other profiling to MGCP.

   In the initial messages, the version will be coded as:

      MGCP 1.0

   An entity that receives a command with a protocol version it does
   not support, MUST respond with an error (error code 528 –
   Incompatible Protocol Version).

3.2.2.  Parameter Lines

   Parameter lines are composed of a parameter name, which in most
   cases is composed of one or two characters, followed by a colon,
   optional white space(s) and the parameter value. The parameters that
   can be present in commands are defined in the following table:


Arango, et al.      Informational - Expires  July 2001        [Page 69]

Internet Draft                MGCP 1.0bis                  January 2001

    ------------------------------------------------------------------
   |Parameter name        |  Code|  Parameter value                   |
   |----------------------|------|------------------------------------|
   |ResponseAck           |   K  |  See description                   |
   |BearerInformation     |   B  |  See description                   |
   |CallId                |   C  |  Hexadecimal string, max. 32 chars.|
   |ConnectionId          |   I  |  Hexadecimal string, max. 32 chars.|
   |NotifiedEntity        |   N  |  An identifier, in RFC 821 format, |
   |                      |      |  composed of an arbitrary string   |
   |                      |      |  and of the domain name of the     |
   |                      |      |  requesting entity, possibly com-  |
   |                      |      |  pleted by a port number, as in:   |
   |                      |      |    Call-agent@ca.example.net:5234  |
   |RequestIdentifier     |   X  |  Hexadecimal string, max. 32 chars.|
   |LocalConnectionOptions|   L  |  See description                   |
   |Connection Mode       |   M  |  See description                   |
   |RequestedEvents       |   R  |  See description                   |
   |SignalRequests        |   S  |  See description                   |
   |DigitMap              |   D  |  A text encoding of a digit map    |
   |ObservedEvents        |   O  |  See description                   |
   |ConnectionParameters  |   P  |  See description                   |
   |ReasonCode            |   E  |  A string with a 3 digit integer   |
   |                      |      |  optionally followed by a set of   |
   |                      |      |  arbitrary characters              |
   |SpecificEndPointId    |   Z  |  An identifier, in RFC 821 format, |
   |                      |      |  composed of an arbitrary string,  |
   |                      |      |  followed by an "@" followed by    |
   |                      |      |  the domain name of the gateway to |
   |                      |      |  which this endpoint is attached.  |
   |SecondEndpointId      |   Z2 |  Endpoint Id.                      |
   |SecondConnectionId    |   I2 |  Connection Id.                    |
   |RequestedInfo         |   F  |  See description                   |
   |QuarantineHandling    |   Q  |  See description                   |
   |DetectEvents          |   T  |  See description                   |
   |RestartMethod         |   RM |  See description                   |
   |RestartDelay          |   RD |  A number of seconds, encoded as   |
   |                      |      |  a decimal number                  |
   |EventStates           |   ES |  See description                   |
   |Capabilities          |   A  |  See description                   |
   |----------------------|------|------------------------------------|
   |RemoteConnection      |   RC |  Session Description               |
   |Descriptor            |      |                                    |
   |LocalConnection       |   LC |  Session Description               |
   |Descriptor            |      |                                    |
    ------------------------------------------------------------------

   The parameters are not necessarily present in all commands. The
   following table provides the association between parameters and
   commands.  The letter M stands for mandatory, O for optional and F
   for forbidden.




Arango, et al.      Informational - Expires  July 2001        [Page 70]

Internet Draft                MGCP 1.0bis                  January 2001

    ------------------------------------------------------------------
   | Parameter name      |  EP|  CR|  MD|  DL|  RQ|  NT|  AU|  AU|  RS|
   |                     |  CF|  CX|  CX|  CX|  NT|  FY|  EP|  CX|  IP|
   |---------------------|----|----|----|----|----|----|----|----|----|
   | ResponseAck         |  O |  O |  O |  O |  O |  O |  O |  O |  O |
   | BearerInformation   |  M |  O |  O |  O |  O |  F |  F |  F |  F |
   | CallId              |  F |  M |  M |  O |  F |  F |  F |  F |  F |
   | ConnectionId        |  F |  F |  M |  O |  F |  F |  F |  M |  F |
   | RequestIdentifier   |  F |  O+|  O+|  O+|  M |  M |  F |  F |  F |
   | LocalConnection     |  F |  O |  O |  F |  F |  F |  F |  F |  F |
   | Options             |    |    |    |    |    |    |    |    |    |
   | Connection Mode     |  F |  M |  O |  F |  F |  F |  F |  F |  F |
   | RequestedEvents     |  F |  O |  O |  O |  O*|  F |  F |  F |  F |
   | SignalRequests      |  F |  O |  O |  O |  O*|  F |  F |  F |  F |
   | NotifiedEntity      |  F |  O |  O |  O |  O |  O |  F |  F |  F |
   | ReasonCode          |  F |  F |  F |  O |  F |  F |  F |  F |  O |
   | ObservedEvents      |  F |  F |  F |  F |  F |  M |  F |  F |  F |
   | DigitMap            |  F |  O |  O |  O |  O |  F |  F |  F |  F |
   | Connection          |  F |  F |  F |  O |  F |  F |  F |  F |  F |
   | parameters          |    |    |    |    |    |    |    |    |    |
   | Specific Endpoint ID|  F |  F |  F |  F |  F |  F |  F |  F |  F |
   | Second Endpoint ID  |  F |  O |  F |  F |  F |  F |  F |  F |  F |
   | RequestedInfo       |  F |  F |  F |  F |  F |  F |  O |  M |  F |
   | QuarantineHandling  |  F |  O |  O |  O |  O |  F |  F |  F |  F |
   | DetectEvents        |  F |  O |  O |  O |  O |  F |  F |  F |  F |
   | EventStates         |  F |  F |  F |  F |  F |  F |  F |  F |  F |
   | RestartMethod       |  F |  F |  F |  F |  F |  F |  F |  F |  M |
   | RestartDelay        |  F |  F |  F |  F |  F |  F |  F |  F |  O |
   | SecondConnectionId  |  F |  F |  F |  F |  F |  F |  F |  F |  F |
   | Capabilities        |  F |  F |  F |  F |  F |  F |  F |  F |  F |
   |---------------------|----|----|----|----|----|----|----|----|----|
   | RemoteConnection    |  F |  O |  O |  F |  F |  F |  F |  F |  F |
   | Descriptor          |    |    |    |    |    |    |    |    |    |
   | LocalConnection     |  F |  F |  F |  F |  F |  F |  F |  F |  F |
   | Descriptor          |    |    |    |    |    |    |    |    |    |
    ------------------------------------------------------------------

   Note (+) that the RequestIdentifier parameter is optional in
   connection creation, modification and deletion commands, but that it
   becomes mandatory if the command contains an encapsulated
   notification request.

   Note (*) that the RequestedEvents and SignalRequests parameters are
   optional in the NotificationRequest. If these parameters are omitted
   the corresponding lists will be considered empty.

   The set of parameters can be extended in two different ways:

   *  Package Extension Parameters (preferred)

   *  Vendor Extension Parameters



Arango, et al.      Informational - Expires  July 2001        [Page 71]

Internet Draft                MGCP 1.0bis                  January 2001

   Package Extension Parameters are defined in packages which provides
   the following benefits:

   *  a registration mechanism (IANA) for the package name.

   *  a separate name space for the parameters.

   *  a convenient grouping of the extensions.

   *  a simple way to determine support for them through auditing.

   The package extension mechanism is the preferred extension method.

   Vendor extension parameters can be used if implementers need to
   experiment with new parameters, for example when developing a new
   application of MGCP, they should identify these parameters by names
   that start with the string "X-" or "X+", such as for example:

      X-Flower: Daisy

   Parameter names that start with "X+" are critical parameter
   extensions.  An MGCP entity that receives a critical parameter
   extension that it cannot understand should refuse to execute the
   command.  It should respond with an error code 511 (Unrecognized
   extension).

   Parameter names that start with "X-" are non critical parameter
   extensions. An MGCP entity that receives a non critical parameter
   extension that it cannot understand can safely ignore that
   parameter.

   Note that vendor extension parameters use an unmanaged name space,
   which implies a potential for name clashing. Vendors are
   consequently encouraged to include some vendor specific string, e.g.
   vendor name, in their vendor extensions.

3.2.2.1.  Response Acknowledgement

   The response acknowledgement attribute is used to managed the "at-
   most-once" facility described in Section 3.5. It contains a comma
   separated list of "confirmed transaction-id ranges".

   Each "confirmed transaction-id ranges" is composed of either one
   decimal number, when the range includes exactly one transaction, or
   two decimal numbers separated by a single hyphen, describing the
   lower and higher transaction identifiers included in the range.

   An example of response acknowledgement is:

      K: 6234-6255, 6257, 19030-19044

3.2.2.2.  Local Connection Options


Arango, et al.      Informational - Expires  July 2001        [Page 72]

Internet Draft                MGCP 1.0bis                  January 2001

   The local connection options describe the operational parameters
   that the Call Agent suggests to the gateway in connection handling
   commands.  These include:

   *  The preferred type of codec, encoded as the keyword "a", followed
      by a colon and a character string. If the Call Agent specifies a
      list of values, these values will be separated by a semicolon.
      For RTP, codecs shall be specified by using encoding names
      defined in the RTP AV Profile [4] or its replacement, or by
      encoding names registered with the IANA.

   *  The packetization period in milliseconds, encoded as the keyword
      "p", followed by a colon and a decimal number. If the Call Agent
      specifies a range of values, the range will be specified as two
      decimal numbers separated by an hyphen (as specified for the
      "ptime parameter for SDP).

   *  The bandwidth in kilobits per second (1000 bits per second),
      encoded as the keyword "b", followed by a colon and a decimal
      number. If the Call Agent specifies a range of values, the range
      will be specified as two decimal numbers separated by an hyphen.

   *  The type of service parameter, encoded as the keyword "t",
      followed by a colon and the value encoded as two hexadecimal
      digits. When the connection is transmitted over an IP network,
      the parameters encode the 8-bit type of service value parameter
      of the IP header.

   *  The echo cancellation parameter, encoded as the keyword "e",
      followed by a colon and the value "on" or "off".

   *  The gain control parameter, encoded as the keyword "gc", followed
      by a colon a value which can be either the keyword "auto" or a
      decimal number (positive or negative) representing the number of
      decibels of gain.

   *  The silence suppression parameter, encoded as the keyword "s",
      followed by a colon and the value "on" or "off".

   *  The resource reservation parameter, encoded as the keyword "r",
      followed by a colon and the value "g" (guaranteed service), "cl"
      (controlled load) or "be" (best effort).

   *  The encryption key, encoded as the keyword "k" followed by a
      colon and a key specification, as defined for the parameter "K"
      of SDP (RFC 2327).

   *  The type of network, encoded as the keyword "nt" followed by a
      colon and the type of network encoded as the keyword "IN"
      (internet), "ATM", "LOCAL" (for a local connection), or possibly
      another type of network registered with the IANA as per SDP (RFC
      2327).


Arango, et al.      Informational - Expires  July 2001        [Page 73]

Internet Draft                MGCP 1.0bis                  January 2001

   *  The resource reservation parameter, encoded as the keyword "r",
      followed by a colon and the value "g" (guaranteed service), "cl"
      (controlled load) or "be" (best effort).

   The encoding of the first three fields, when they are present, will
   be compatible with the SDP and RTP profiles. Note that each of the
   parameters is optional. When several parameters are present, the
   values are separated by a comma.

   Examples of connection descriptors are:

      L: p:10, a:PCMU
      L: p:10, a:G726-32
      L: p:10-20, b:64
      L: b:32-64, e:off

   The set of Local Connection Options attributes can be extended in
   three different ways:

   *  Package Extension attributes (preferred)

   *  Vendor Extension attributes

   *  Other Extension attributes

   Package Extension Local Connection Options attributes are defined in
   packages which provides the following benefits:

   *  A registration mechanism (IANA) for the package name.

   *  A separate name space for the attributes.

   *  A convenient grouping of the extensions.

   *  A simple way to determine support for them through auditing.

   The package extension mechanism is the preferred extension method.

   Vendor extension attributes are composed of an attribute name,
   followed by a colon and by an attribute value. The attribute name
   must start with the two characters "x+", for a mandatory extension,
   or "x-", for a non mandatory extension. If a gateway receives a
   mandatory extension attribute that it does not recognize, it should
   reject the command with an error code 525 (Unknown extension in
   LocalConnectionOptions).

   Note that vendor extension attributes use an unmanaged name space,
   which implies a potential for name clashing. Vendors are
   consequently encouraged to include some vendor specific string, e.g.
   vendor name, in their vendor extensions.

   Finally, for backwards compatibility with some existing
   implementations, MGCP allows for other extension attributes as well

Arango, et al.      Informational - Expires  July 2001        [Page 74]

Internet Draft                MGCP 1.0bis                  January 2001

   (see grammar). Note however, that these attribute extensions do not
   provide the package extension attribute benefits. Use of this
   mechanism for new extensions is strongly discouraged.

3.2.2.3.  Capabilities

   Capabilities inform the Call Agent about endpoints' capabilities
   when audited. The encoding of capabilities is based on the Local
   Connection Options encoding for the parameters that are common to
   both. In addition, capabilities can also contain a list of supported
   packages, and a list of supported modes.

   The parameters used are:

   A list of supported codecs.
      The following parameters will apply to all codecs specified in
      this list. If there is a need to specify that some parameters,
      such as e.g. silence suppression, are only compatible with some
      codecs, then the gateway will return several Capability
      parameters, one for each set of codecs.

   Packetization Period:
      A range may be specified.

   Bandwidth:
      A range corresponding to the range for packetization periods may
      be specified (assuming no silence suppression). If absent, the
      values will be deduced from the codec type.

   Echo Cancellation:
      "on" if echo cancellation is supported for this codec, "off"
      otherwise. The default is support.

   Silence Suppression:
      "on" if silence suppression is supported for this codec, "off"
      otherwise. The default is support.

   Gain Control:
      "0" if gain control is not supported.  The default is support.

   Type of Service:
      The value "0" indicates no support for type of service, all other
      values indicate support for type of service. The default is
      support.

   Resource Reservation Service:
      The parameter indicates the reservation services that are
      supported, in addition to best effort.  The value "g" is encoded
      when the gateway supports both the guaranteed and the controlled
      load service, "cl" when only the controlled load service is
      supported.  The default is "best effort".



Arango, et al.      Informational - Expires  July 2001        [Page 75]

Internet Draft                MGCP 1.0bis                  January 2001

   Encryption Key:
      Encoding any value indicates support for encryption.  Default is
      no support which is implied by omitting the parameter.

   Type of network:
      The keyword "nt", followed by a colon and a semicolon separated
      list of supported network types.  This parameter is optional.

   Event Packages:
      The event packages supported by the endpoint(s) encoded as the
      keyword "v", followed by a colon and a character string. If a
      list of values is specified, these values will be separated by a
      semicolon.  The first value specified will be the default package
      for that endpoint.

   Modes:
      The modes supported by this endpoint encoded as the keyword "m",
      followed by a colon and a semicolon-separated list of supported
      connection modes for this endpoint.

   Lack of support for a capability can also be indicated by excluding
   the parameter from the capability set.

   Since Local Connection Options can be extended, the list of
   capability parameters can also be extended. Individual extensions
   may define how they are reported as capabilities. If no such
   definition is provided, the following defaults apply:

   *  Package Extension attributes: The individual attributes are not
      reported. Instead, the name of the package is simply reported in
      the list of supported packages.

   *  Vendor Extension attributes: The name of the attribute is
      reported without any value.

   *  Other Extension attributes: The name of the attribute is reported
      without any value.

3.2.2.4.  Connection Parameters

   Connection parameters are encoded as a string of type and value
   pairs, where the type is a either letter identifier of the parameter
   or an extension type, and the value a decimal integer. Types are
   separated from value by an `=' sign. Parameters are encoded from
   each other by a comma.

   The connection parameter types are specified in the following table:







Arango, et al.      Informational - Expires  July 2001        [Page 76]

Internet Draft                MGCP 1.0bis                  January 2001

    -----------------------------------------------------------------
   | Connection parameter| Code |  Connection parameter              |
   | name                |      |  value                             |
   |---------------------|------|------------------------------------|
   | Packets sent        |  PS  |  The number of packets that        |
   |                     |      |  were sent on the connection.      |
   | Octets sent         |  OS  |  The number of octets that         |
   |                     |      |  were sent on the connection.      |
   | Packets received    |  PR  |  The number of packets that        |
   |                     |      |  were received on the connection.  |
   | Octets received     |  OR  |  The number of octets that         |
   |                     |      |  were received on the connection.  |
   | Packets lost        |  PL  |  The number of packets that        |
   |                     |      |  were not received on the          |
   |                     |      |  connection, as deduced from       |
   |                     |      |  gaps in the sequence number.      |
   | Jitter              |  JI  |  The average inter-packet arrival  |
   |                     |      |  jitter, in milliseconds,          |
   |                     |      |  expressed as an integer number.   |
   | Latency             |  LA  |  Average latency, in milliseconds, |
   |                     |      |  expressed as an integer number.   |
    -----------------------------------------------------------------

   The set of connection parameters can be extended in two different
   ways:

   *  Package Extension Parameters (preferred)

   *  Vendor Extension Parameters

   Package Extension Connection Parameters are defined in packages
   which provides the following benefits:

   *  A registration mechanism (IANA) for the package name.

   *  A separate name space for the parameters.

   *  A convenient grouping of the extensions.

   *  A simple way to determine support for them through auditing.

  The package extension mechanism is the preferred extension method.

   Vendor extension parameters names are composed of the string "X-"
   followed by a two or more letters extension parameter name.

   Call agents that receive unrecognized package or vendor connection
   parameter extensions shall silently ignore these extensions.

   An example of connection parameter encoding is:

      P: PS=1245, OS=62345, PR=0, OR=0, PL=0, JI=0, LA=48


Arango, et al.      Informational - Expires  July 2001        [Page 77]

Internet Draft                MGCP 1.0bis                  January 2001

3.2.2.5.  Reason Codes

   Reason codes are three-digit numeric values. The reason code is
   optionally followed by a white space and commentary, e.g.:

      900 Endpoint malfunctioning

   A list of reason codes can be found in Section 2.5.

   The set of reason codes can be extended through packages.

3.2.2.6.  Connection Mode

   The connection mode describes the mode of operation of the
   connection.  The possible values are:

      --------------------------------------------------------
     |    Mode     |               Meaning                    |
     |-------------|------------------------------------------|
     | M: sendonly |  The gateway should only send packets    |
     | M: recvonly |  The gateway should only receive packets |
     | M: sendrecv |  The gateway should send                 |
     |             |  and receive packets                     |
     | M: confrnce |  The gateway should place                |
     |             |  the connection in conference mode       |
     | M: inactive |  The gateway should neither              |
     |             |  send nor receive packets                |
     | M: loopback |  The gateway should place                |
     |             |  the circuit in loopback mode.           |
     | M: conttest |  The gateway should place                |
     |             |  the circuit in test mode.               |
     | M: netwloop |  The gateway should place                |
     |             |  the connection in network loopback mode.|
     | M: netwtest |  The gateway should place the connection |
     |             |  in network continuity test mode.        |
      --------------------------------------------------------

   The set of connection modes can be extended through packages.

3.2.2.7.  Coding of Event Names

   Event names are composed of an optional package name, separated by a
   slash (/) from the name of the actual event.  The event name can
   optionally be followed by an at sign (@) and the identifier of a
   connection on which the event should be observed. Event names are
   used in the RequestedEvents, SignalRequests and ObservedEvents
   parameter. Events and signals may be qualified by parameters defined
   for the event/signal. The parameter name "!" (exclamation point) is
   reserved for future use for both events and signals

   Each signal has one of the following signal-types associated with
   it: On/Off (OO), Time-out (TO), or Brief (BR). (These signal types
   are specified in the package definitions, and are not present in the

Arango, et al.      Informational - Expires  July 2001        [Page 78]

Internet Draft                MGCP 1.0bis                  January 2001

   messages.) On/Off signals can be parameterized with a "+" to turn
   the signal on, or a "-" to turn the signal off. If an on/off signal
   is not parameterized, the signal is turned on. Both of the following
   will turn the vmwi signal on:

      vmwi(+), vmwi

   In addition to "!", "+" and "-", the signal parameter "to" is
   reserved as well. It can be used with Time-Out signals to override
   the default time-out value for the current request. A decimal value
   in milliseconds will be supplied. The individual signal and/or
   package definition must indicate if this parameter is supported for
   one or more TO signals in the package. All new package and TO signal
   definitions are strongly encouraged to support the "to" signal
   parameter.

   The following example illustrates how the "to" parameter can be used
   to apply a signal for 6 seconds:

      rg(to=6000)
      rg(to(6000))

   The following are examples of event names:

      -----------------------------------------------------------
     | L/hu        |   on-hook transition, in the line package   |
     | F/0         |   digit 0 in the MF package                 |
     | fh          |   Flash-hook, assuming that the line package|
     |             |   is a default package for the end point.   |
     | G/rt@0A3F58 |   Ring back signal on                       |
     |             |   connection "0A3F58".                      |
      -----------------------------------------------------------

   In addition, the range and wildcard notation of events can be used,
   instead of individual names, in the RequestedEvents and DetectEvents
   parameters. The star sign can be used to denote "all connections",
   and the dollar sign can be used to denote the "current" connection.
   The following are examples of such notations:

      ---------------------------------------------------------
     | M/[0-9]   |   Digits 0 to 9 in the MF package           |
     | fh        |   Flash-hook, assuming that the line package|
     |           |   is a default package for the end point.   |
     | [0-9*#A-D]|   All digits and letters in the DTMF        |
     |           |   packages (default for endpoint).          |
     | T/$       |   All events in the trunk package.         |
     | R/qa@*    |   The quality alert event in all            |
     |           |   connections                               |
     | R/rt@$    |   Ringback on current connection            |
      ---------------------------------------------------------

3.2.2.8.  RequestedEvents


Arango, et al.      Informational - Expires  July 2001        [Page 79]

Internet Draft                MGCP 1.0bis                  January 2001

   The RequestedEvents parameter provides the list of events that have
   been requested. The event codes are described in the previous
   section.

   Each event can be qualified by a requested action, or by a list of
   actions. The actions, when specified, are encoded as a list of
   keywords, enclosed in parenthesis and separated by commas. The codes
   for the various actions are:

                -------------------------------------
               |          Action              | Code |
               |------------------------------|------|
               | Notify immediately           |  N   |
               | Accumulate                   |  A   |
               | Treat according to digit map |  D   |
               | Swap                         |  S   |
               | Ignore                       |  I   |
               | Keep Signal(s) active        |  K   |
               | Embedded Notification Request|  E   |
                -------------------------------------

   When no action is specified, the default action is to notify the
   event.  This means that, for example, ft and ft(N) are equivalent.
   Events that are not listed are ignored.

   The digit-map action can only be specified for the digits, letters
   and interdigit timers in packages that define the encoding of digits
   and timers.

   The requested list is encoded on a single line, with event/action
   groups separated by commas. Examples of RequestedEvents encoding
   are:

      R: hu(N), hf(S,N)
      R: hu(N), [0-9#T](D)

   In the case of the "enable" action, the embedded notification
   request parameters are encoded as a list of up to three parameter
   groups, separated by commas. Each group starts by a one letter
   identifier, followed by a list of parameters enclosed between
   parenthesis. The first optional parameter group, identified by the
   letter "R", is the enabled value of the RequestedEvents parameter.
   The second optional group, identified by the letter "S", is the
   enabled value of the SignalRequests parameter. The third optional
   group, identified by the letter "D", is the enabled value of the
   DigitMap. (Note that some existing implementation may encode these
   three components in a different order. Implementers are encouraged
   to accept such encodings, but they should not generate them.)

   If the RequestedEvents is not present, the parameter will be set to
   a null value. If the SignalRequests is not present, the parameter
   will be set to a null value. If the DigitMap is absent, the current


Arango, et al.      Informational - Expires  July 2001        [Page 80]

Internet Draft                MGCP 1.0bis                  January 2001

   value should be used. The following are valid examples of embedded
   requests:

      R: hd(E(R([0-9#T](D),hu(N)),S(dl),D([0-9].[#T])))
      R: hd(E(R([0-9#T](D),hu(N)),S(dl)))

3.2.2.9.  SignalRequests

   The SignalRequests parameter provides the name of the signals that
   have been requested. Each signal is identified by a name, as
   indicated in the previous section.

   Several signals, such as for example announcement or ADSI display,
   can be qualified by additional parameters:

   *  the name and parameters of the announcement,

   *  the string that should be displayed.

   These parameters will be separated by commas and enclosed within
   parenthesis, as in:
      S: adsi("123456 Francois Gerard")
      S: ann(no-such-number, 1234567)

   When a quoted-string is provided, the string itself is UTF-8 encoded
   (RFC 2279).

   When several signals are requested, their codes are separated by a
   comma, as in:

      S: adsi("123456 Your friend"), rg

   Please refer to Section 3.2.2.7 for additional detail on signal
   parameters.

3.2.2.10.  ObservedEvents

   The observed events parameter provides the list of events that have
   been observed. The event codes are the same as those used in the
   NotificationRequest. Events that have been accumulated according to
   the digit map may be grouped in a single string, however such
   practice is discouraged; they should be reported as lists of
   isolated events if other events where detected during the digit
   accumulation. Examples of observed events are:

      O: L/hu
      O: 8295555T
      O: 8,2,9,5,5,L/hf,5,5,T
      O: L/hf, L/hf, L/hu

3.2.2.11.  RequestedInfo



Arango, et al.      Informational - Expires  July 2001        [Page 81]

Internet Draft                MGCP 1.0bis                  January 2001

   The RequestedInfo parameter contains a comma separated list of
   parameter codes, as defined in Section 3.2.2.  For example, if one
   wants to audit the value of the NotifiedEntity, RequestIdentifier,
   RequestedEvents, SignalRequests, DigitMap, QuarantineHandling and
   DetectEvents parameters, The value of the RequestedInfo parameter
   will be:

      F:N,X,R,S,D,Q,T

   Note that extension parameters in general can be audited as well.
   The individual extension will define the auditing operation.

   The capabilities request, in the AuditEndPoint command, is encoded
   by the keyword "A", as in:

      F:A

3.2.2.12.  QuarantineHandling

   The quarantine handling parameter contains a list of comma separated
   keywords:

   *  The keyword "process" or "discard" to indicate the treatment of
      quarantined events.  If neither process or discard is present,
      process is assumed.

   *  The keyword "step" or "loop" to indicate whether exactly at most
      one notification is expected, or whether multiple notifications
      are allowed. If neither step or loop is present, step is assumed.

   The following values are valid examples:

      Q:loop
      Q:process
      Q:discard,loop

3.2.2.13.  DetectEvents

   The DetectEvents parameter is encoded as a comma separated list of
   events, such as for example:

      T: hu,hd,hf,[0-9#*]

   It should be noted, that no actions can be associated with the
   events.

3.2.2.14.  EventStates

   The EventStates parameter is encoded as a comma separated list of
   events, such as for example:

      ES: hu


Arango, et al.      Informational - Expires  July 2001        [Page 82]

Internet Draft                MGCP 1.0bis                  January 2001

   It should be noted, that no actions can be associated with the
   events.

3.2.2.15.  RestartMethod

   The RestartMethod parameter is encoded as one of the keywords
   "graceful", "forced", "restart", "disconnected" or "cancel-graceful"
   as for example:

      RM:restart

   The set of restart methods can be extended through packages.

3.2.2.16.  Bearer Information

   The values of the bearer information are encoded as a comma
   separated list of attributes, represented by an attribute name,
   separated by a colon from an attribute value.

   The only attribute that is defined is the "encoding" (code "e"),
   whose defined values are "A" (A-law) and "mu" (mu-law).

   An example of bearer information encoding is:

      B: e:mu

   The set of bearer information attributes may be extended through
   packages.

3.3.  Format of response headers

   The response header is composed of a response line, optionally
   followed by headers that encode the response parameters.

   An example of a response header could be:

      200 1203 OK

   The response line starts with the response code, which is a three
   digit numeric value. The code is followed by a white space, and the
   transaction identifier. Response codes defined in packages (8xx) are
   followed by white space, a slash ("/") and the package name. All
   response codes may furthermore be followed by optional commentary
   preceded by a white space.

   The following table describes the parameters whose presence is
   mandatory or optional in a response header, as a function of the
   command that triggered the response. The letter M stands for
   mandatory, O for optional and F for forbidden. Note that the table
   only reflects the default for responses that have not defined any
   other behavior. If a response is received with a parameter that is
   either not understood or marked as forbidden, the offending
   parameter is simply ignored.

Arango, et al.      Informational - Expires  July 2001        [Page 83]

Internet Draft                MGCP 1.0bis                  January 2001


    ------------------------------------------------------------------
   | Parameter name      | EP | CR | MD | DL | RQ | NT | AU | AU | RS |
   |                     | CF | CX | CX | CX | NT | FY | EP | CX | IP |
   |---------------------|----|----|----|----|----|----|----|----|----|
   | ResponseAck         |  O*|  O*|  O*|  O*|  O*|  O*|  O*|  O*|  O*|
   | BearerInformation   |  F |  F |  F |  F |  F |  F |  O |  F |  F |
   | CallId              |  F |  F |  F |  F |  F |  F |  F |  O |  F |
   | ConnectionId        |  F |  O*|  F |  F |  F |  F |  F |  F |  F |
   | RequestIdentifier   |  F |  F |  F |  F |  F |  F |  O |  F |  F |
   | LocalConnection     |  F |  F |  F |  F |  F |  F |  O |  O |  F |
   | Options             |    |    |    |    |    |    |    |    |    |
   | Connection Mode     |  F |  F |  F |  F |  F |  F |  F |  O |  F |
   | RequestedEvents     |  F |  F |  F |  F |  F |  F |  O |  F |  F |
   | SignalRequests      |  F |  F |  F |  F |  F |  F |  O |  F |  F |
   | NotifiedEntity      |  F |  F |  F |  F |  F |  F |  F |  F |  O |
   | ReasonCode          |  F |  F |  F |  F |  F |  F |  O |  F |  F |
   | ObservedEvents      |  F |  F |  F |  F |  F |  F |  O |  F |  F |
   | DigitMap            |  F |  F |  F |  F |  F |  F |  O |  F |  F |
   | Connection          |  F |  F |  F |  O |  F |  F |  F |  O |  F |
   |   Parameters        |    |    |    |    |    |    |    |    |    |
   | Specific Endpoint ID|  F |  O |  F |  F |  F |  F |  F |  F |  F |
   | RequestedInfo       |  F |  F |  F |  F |  F |  F |  F |  F |  F |
   | QuarantineHandling  |  F |  F |  F |  F |  F |  F |  O |  F |  F |
   | DetectEvents        |  F |  F |  F |  F |  F |  F |  O |  F |  F |
   | EventStates         |  F |  F |  F |  F |  F |  F |  O |  F |  F |
   | RestartMethod       |  F |  F |  F |  F |  F |  F |  O |  F |  F |
   | RestartDelay        |  F |  F |  F |  F |  F |  F |  O |  F |  F |
   | Capabilities        |  F |  F |  F |  F |  F |  F |  O |  F |  F |
   | SecondConnectionId  |  F |  O |  F |  F |  F |  F |  F |  F |  F |
   | SecondEndpointId    |  F |  O |  F |  F |  F |  F |  F |  F |  F |
   |---------------------|----|----|----|----|----|----|----|----|----|
   | LocalConnection     |  F |  O*|  O |  F |  F |  F |  F |  O*|  F |
   | Descriptor          |    |    |    |    |    |    |    |    |    |
   | RemoteConnection    |  F |  F |  F |  F |  F |  F |  F |  O*|  F |
   | Descriptor          |    |    |    |    |    |    |    |    |    |
    ------------------------------------------------------------------

   Notes (*):

   *  The ResponseAck parameter MUST NOT be used with any other
      responses than a final response issued after a provisional
      response for the transaction in question. In that case, the
      presence of the ResponseAck parameter should trigger a Response
      Acknowledgement– any ResponseAck values provided will be ignored.

   *  In the case of a CreateConnection message, the response line is
      followed by a Connection-Id parameter and a
      LocalConnectionDescriptor. It may also be followed a Specific-
      Endpoint-Id parameter, if the creation request was sent to a
      wildcarded Endpoint-Id. The connection-Id and
      LocalConnectionDescriptor parameter are marked as optional in the
      Table. In fact, they are mandatory with all positive responses,

Arango, et al.      Informational - Expires  July 2001        [Page 84]

Internet Draft                MGCP 1.0bis                  January 2001

      when a connection was created, and forbidden when the response is
      negative, when no connection as created.

   *  A LocalConnectionDescriptor should be transmitted with a positive
      response (code 200) to a CreateConnection. It may be transmitted
      in response to a ModifyConnection command, if the modification
      resulted in a modification of the session parameters. The
      LocalConnectionDescriptor is encoded as a "session description",
      as defined in section 3.4. It is separated from the response
      header by an empty line.

   *  When several session descriptors are encoded in the same
      response, they are encoded one after each other, separated by an
      empty line. This is the case for example when the response to an
      audit connection request carries both a local session description
      and a remote session description, as in:

          200 1203 OK
          C: A3C47F21456789F0
          N: [128.96.41.12]
          L: p:10, a:PCMU;G726-32
          M: sendrecv
          P: PS=1245, OS=62345, PR=780, OR=45123, PL=10, JI=27,LA=48

          v=0
          o=- 25678 753849 IN IP4 128.96.41.1
          s=-
          c=IN IP4 128.96.41.1
          t=0 0
          m=audio 1296 RTP/AVP 0

          v=0
          o=- 33343 346463 IN IP4 128.96.63.25
          s=-
          c=IN IP4 128.96.63.25
          t=0 0
          m=audio 1296 RTP/AVP 0 96
          a=rtpmap:96 G726-32/8000

      In this example, according to the SDP syntax, each description
      starts with a "version" line, (v=...). The local description is
      always transmitted before the remote description. If a connection
      descriptor is requested, but it does not exist for the connection
      audited, that connection descriptor will appear with the SDP
      protocol version field only.

   The response parameters are described for each of the commands in
   the following.

3.3.1. CreateConnection Response

   In the case of a CreateConnection message, the response line is
   followed by a Connection-Id parameter with a successful response

Arango, et al.      Informational - Expires  July 2001        [Page 85]

Internet Draft                MGCP 1.0bis                  January 2001

   (code 200). A LocalConnectionDescriptor is furthermore transmitted
   with a positive response. The LocalConnectionDescriptor is encoded
   as a "session description", as defined by SDP (RFC 2327). It is
   separated from the response header by an empty line, e.g.:

      200 1204 OK
      I: FDE234C8

      v=0
      o=- 25678 753849 IN IP4 128.96.41.1
      s=-
      c=IN IP4 128.96.41.1
      t=0 0
      m=audio 3456 RTP/AVP 96
      a=rtpmap:96 G726-32/8000

   When a provisional response has been issued previously, the final
   response may furthermore contain the Response Acknowledgement
   parameter:

      200 1204 OK
      K:
      I: FDE234C8

      v=0
      o=- 25678 753849 IN IP4 128.96.41.1
      s=-
      c=IN IP4 128.96.41.1
      t=0 0
      m=audio 3456 RTP/AVP 96
      a=rtpmap:96 G726-32/8000

   The final response should then be acknowledged by a Response
   Acknowledgement:

      000 1204

3.3.2. ModifyConnection Response

   In the case of a successful ModifyConnection message, the response
   line is followed by a LocalConnectionDescriptor, if the modification
   resulted in a modification of the session parameters (e.g., changing
   only the mode of a connection does not alter the session
   parameters). The LocalConnectionDescriptor is encoded as a "session
   description", as defined by SDP. It is separated from the response
   header by an empty line.








Arango, et al.      Informational - Expires  July 2001        [Page 86]

Internet Draft                MGCP 1.0bis                  January 2001

      200 1207 OK

      v=0
      o=- 25678 753849 IN IP4 128.96.41.1
      s=-
      c=IN IP4 128.96.41.1
      t=0 0
      m=audio 3456 RTP/AVP 0

   When a provisional response has been issued previously, the final
   response may furthermore contain the Response Acknowledgement
   parameter as in:

      200 1207 OK
      K:

   The final response should then be acknowledged by a Response
   Acknowledgement:

      000 1207 OK

3.3.3. DeleteConnection Response

   Depending on the variant of the DeleteConnection message, the
   response line may be followed by a Connection Parameters parameter
   line, as defined in Section 3.2.2.4.

      250 1210 OK
      P: PS=1245, OS=62345, PR=780, OR=45123, PL=10, JI=27,LA=48

3.3.4. NotificationRequest Response

   A successful NotificationRequest response does not include any
   additional response parameters.

3.3.5. Notify Response

   A successful Notify response does not include any additional
   response parameters.

3.3.6. AuditEndpoint Response

   In the case of a successful AuditEndPoint the response line may be
   followed by information for each of the parameters requested - each
   parameter will appear on a separate line. Parameters for which no
   value currently exists, e.g., digit map, will still be provided.
   Each local endpoint name "expanded" by a wildcard character will
   appear on a separate line using the "SpecificEndPointId" parameter
   code, e.g.:





Arango, et al.      Informational - Expires  July 2001        [Page 87]

Internet Draft                MGCP 1.0bis                  January 2001

      200 1200 OK
      Z: aaln/1@rgw.whatever.net
      Z: aaln/2@rgw.whatever.net

   or:

      200 1200 OK
      A: a:PCMU;G728, p:10-100, e:on, s:off, t:1, v:L,
          m:sendonly;recvonly;sendrecv;inactive
      A: a:G729A; p:30-90, e:on, s:on, t:1, v:L,
          m:sendonly;recvonly;sendrecv;inactive;confrnce

   Note: The carriage return for Capabilities shown above is present
   for formatting reasons only. It is not permissible in a real command
   encoding.

3.3.7. AuditConnection Response

   In the case of a successful AuditConnection, the response may be
   followed by information for each of the parameters requested.
   Parameters for which no value currently exists will still be
   provided. Connection descriptors will always appear last and each
   will be preceded by an empty line, as for example:

      200 1203 OK
      C: A3C47F21456789F0
      N: [128.96.41.12]
      L: p:10, a:PCMU;G728
      M: sendrecv
      P: PS=622, OS=31172, PR=390, OR=22561, PL=5, JI=29, LA=50

      v=0
      o=- 4723891 7428910 IN IP4 128.96.63.25
      s=-
      c=IN IP4 128.96.63.25
      t=0 0
      m=audio 1296 RTP/AVP 96
      a=rtpmap:96 G726-32/8000

   If both a local and a remote connection descriptor are provided, the
   local connection descriptor will be the first of the two. If a
   connection descriptor is requested, but it does not exist for the
   connection audited, that connection descriptor will appear with the
   SDP protocol version field only.

3.3.8. RestartInProgress Response

   A successful RestartInProgress response does not include any
   additional response parameters.

   The response to a RestartInProgress may include the name of another
   Call Agent to contact, for instance when the Call Agent redirects
   the endpoint to another Call Agent as in:

Arango, et al.      Informational - Expires  July 2001        [Page 88]

Internet Draft                MGCP 1.0bis                  January 2001


      521 1204 Redirect
      N: CA-1@whatever.net

3.4.  Encoding of the Session Description (SDP)

   The session description (SDP) is encoded in conformance with the
   session description protocol, SDP. MGCP implementations are expected
   to be fully capable of parsing any conformant SDP message, and
   should send session descriptions that strictly conform to the SDP
   standard.

   The general description and explanation of SDP parameters can be
   found in RFC 2327. In particular, it should be noted that the

   *  Origin ("o="),

   *  Session Name ("s="), and

   *  Time active ("t=")

   are all mandatory in RFC 2327. While they are of little use to MGCP,
   they must be provided in conformance with RFC 2327 nevertheless. The
   following suggests values to be used for each of the fields, however
   the reader is encouraged to consult RFC 2327 for details:

   Origin
   o = <username> <session id> <version> <network type> <address type>
       <address>

   *  The username should be set to hyphen ("-").
   *  The session id is recommended to be an NTP timestamp as suggested
      in RFC 2327.
   *  The version is a version number that must increment with each
      change to the SDP. A counter initialized to zero or an NTP
      timestamp as suggested in RFC 2327 is recommended.
   *  The network type defines the type of network. For RTP sessions
      the network type should be "IN".
   *  The address type defines the type of address. For RTP sessions
      the address type should be "IP4" (or "IP6").
   *  The address should be the same address as provided in the
      connection information ("c=") field.

   Session Name
   s = <session name>

   The session name should be hyphen ("-").

   Time active
   t = <start time> <stop time>

   *  The start time may be set to zero.
   *  The stop time should be set to zero.

Arango, et al.      Informational - Expires  July 2001        [Page 89]

Internet Draft                MGCP 1.0bis                  January 2001


   Each of the three fields can be ignored upon reception.

   To further accommodate the extensibility principles of MGCP,
   implementations are encouraged to support the PINT "a=require"
   attribute - please refer to RFC 2848 for further details.

   The usage of SDP actually depends on the type of session that is
   being established. Below we describe usage of SDP for an audio
   service using the RTP/AVP profile [4], or the LOCAL interconnect
   defined in this document. In case of any conflicts between what is
   described below and SDP (RFC 2327), the SDP specification takes
   precedence.

3.4.1.  Usage of SDP for an Audio Service

   In a telephony gateway, we only have to describe sessions that use
   exactly one media, audio. The usage of SDP for this is
   straightforward and described in detail in RFC 2327.

   The following is an example of an RFC 2327 conformant session
   description for an audio connection:

      v=0
      o=- A7453949499 0 IN IP4 128.96.41.1
      s=-
      c=IN IP4 128.96.41.1
      t=0 0
      m=audio 3456 RTP/AVP 0 96
      a=rtpmap:96 G726-32/8000

3.4.2.  Usage of SDP for LOCAL Connections

   When MGCP is used to set up internal connections within a single
   gateway, the SDP format is used to encode the parameters of that
   connection. The connection and media parameters will be used as
   follows:

   *  The connection parameter (c=) will specify that the connection is
     local, using the keyword "LOCAL" as network type space, the
     keyword "EPN" (endpoint name) as address type, and the local name
     of the endpoint as the connection-address.

   *  The "m=audio" parameter will specify a port number, which will
      always be set to 0, the type of protocol, always set to the
      keyword LOCAL, and the type of encoding, using the same
      conventions used for the RTP AVP profile(RTP payload numbers).
      The type of encoding should normally be set to 0 (PCMU).

   A session-level attribute identifying the connection may furthermore
   be present. This enables endpoints to support multiple LOCAL
   connections. Use of this attribute is optional and indeed


Arango, et al.      Informational - Expires  July 2001        [Page 90]

Internet Draft                MGCP 1.0bis                  January 2001

   unnecessary for endpoints that only support a single LOCAL
   connection. The attribute is defined as follows:

   a=MGCPlocalcx:<ConnectionID>
      The MGCP Local Connection attribute is a session level only case-
      insensitive attribute that identifies the MGCP LOCAL connection,
      on the endpoint identified in the connection information, to
      which the SDP applies. The ConnectionID is a hexadecimal string
      containing at most 32 characters. The ConnectionID itself is
      case-insensitive. The MGCP Local Connection attribute is not
      subject to the charset attribute.

   An example of a LOCAL session description could be:

      v=0
      o=- A7453949499 0 LOCAL EPN X35V3+A4/13
      s=-
      c=LOCAL EPN X35V3+A4/13
      t=0 0
      a=MGCPlocalcx:FDE234C8
      m=audio 0 LOCAL 0

   Note that the MGCP Local Connection attribute is specified at the
   session level and that it could have been omitted in case only a
   single LOCAL connection per endpoint is supported.

3.5.  Transmission over UDP

   MGCP messages are transmitted over UDP. Commands are sent to one of
   the IP addresses defined in the DNS for the specified endpoint. The
   responses are sent back to the source address of the commands – the
   response may or may not arrive from the same address as the command
   was sent to.

   When no port is specified for the endpoint, the commands should be
   sent:

   *  by the Call Agents, to the default MGCP port for gateways, 2427.

   *  by the Gateways, to the default MGCP port for Call Agents, 2727.

3.5.1.  Providing the At-Most-Once Functionality

   MGCP messages, being carried over UDP, may be subject to losses. In
   the absence of a timely response, commands are repeated. Most MGCP
   commands are not idempotent.  The state of the gateway would become
   unpredictable if, for example, CreateConnection commands were
   executed several times.  The transmission procedures must thus
   provide an "at-most-once" functionality.

   MGCP entities are expected to keep in memory a list of the responses
   that they sent to recent transactions and a list of the transactions
   that are currently being executed. The transaction identifiers of

Arango, et al.      Informational - Expires  July 2001        [Page 91]

Internet Draft                MGCP 1.0bis                  January 2001

   incoming commands are compared to the transaction identifiers of the
   recent responses. If a match is found, the MGCP entity does not
   execute the transaction, but simply repeats the response. The
   remaining commands will be compared to the list of current
   transactions. If a match is found, the MGCP entity does not execute
   the transaction, which is simply ignored.

   The procedure uses a long timer value, noted T-HIST in the
   following.  The timer should be set larger than the maximum duration
   of a transaction, which should take into account the maximum number
   of repetitions, the maximum value of the repetition timer and the
   maximum propagation delay of a packet in the network.  A suggested
   value is 30 seconds.

   The copy of the responses can be destroyed either T-HIST seconds
   after the response is issued, or when the gateway (or the Call
   Agent) receives a confirmation that the response has been received,
   through the "Response Acknowledgement ". For transactions that are
   acknowledged through this attribute, the gateway shall keep a copy
   of the transaction-id (as opposed to the entire transaction
   response) for T-HIST seconds after the response is issued, in order
   to detect and ignore duplicate copies of the transaction request
   that could be produced by the network.

3.5.2.  Transaction Identifiers and Three Ways Handshake

   Transaction identifiers are integer numbers in the range from 0 to
   999,999,999. Call-agents may decide to use a specific number space
   for each of the gateways that they manage, or to use the same number
   space for all gateways that belong to some arbitrary group. Call
   agents may decide to share the load of managing a large gateway
   between several independent processes. These processes will share
   the same transaction number space. There are multiple possible
   implementations of this sharing, such as having a centralized
   allocation of transaction identifiers, or pre-allocating non-
   overlapping ranges of identifiers to different processes. The
   implementations must guarantee that unique transaction identifiers
   are allocated to all transactions that originate from a logical call
   agent, as defined in Section 4. Gateways can simply detect duplicate
   transactions by looking at the transaction identifier only.

   The Response Acknowledgement Attribute can be found in any command.
   It carries a set of "confirmed transaction-id ranges" for final
   responses received – provisional responses must not be confirmed. A
   given response should not be confirmed in two separate messages.

   MGCP entities may choose to delete the copies of the responses (but
   not the transaction-id) to transactions whose id is included in
   "confirmed transaction-id ranges" received in the Response
   Confirmation messages (command or response). They should silently
   discard further commands from that entity when the transaction-id
   falls within these ranges, and the response was issued less than T-
   HIST seconds ago.

Arango, et al.      Informational - Expires  July 2001        [Page 92]

Internet Draft                MGCP 1.0bis                  January 2001


   Entities should exercise due caution when acknowledging responses.
   In particular, a response should only be acknowledged if the
   response acknowledgement is sent to the same entity as the
   corresponding command (i.e. the command whose response is being
   acknowledged) was sent to.

   Likewise, entities should not blindly accept a response
   acknowledgement for a given response. However it is considered safe
   to accept a response acknowledgement for a given response, when that
   response acknowledgement is sent by the same entity as the command
   that generated that response.

   It should be noted, that use of response acknowledgements in
   commands is optional (as opposed to the required Response
   Acknowledgement response following a provisional response). The
   benefit of using it is that it reduces overall memory consumption.
   However, in order to avoid large messages, implementations should
   not generate large response acknowledgement lists. One strategy is
   to manage responses to commands on a per endpoint basis. A command
   for an endpoint can confirm a response to an older command for that
   same endpoint. Responses to commands with wildcarded endpoint names
   can be confirmed selectively with due consideration to message
   sizes, or alternatively simply not be acknowledged. Care must be
   taken to not confirm the same response twice or a response that is
   more than T-HIST seconds old.

   The "confirmed transaction-id ranges" values shall not be used if
   more than T-HIST seconds have elapsed since the entity issued its
   last response to the other entity, or when an entity resumes
   operation.  In this situation, commands should be accepted and
   processed, without any test on the transaction-id.

   Commands that carry the "Response Acknowledgement attribute" may be
   transmitted in disorder.  The union of the "confirmed transaction-id
   ranges" received in recent messages shall be retained.

3.5.3.  Computing Retransmission Timers

   It is the responsibility of the requesting entity to provide
   suitable time outs for all outstanding commands, and to retry
   commands when time outs have been exceeded. Furthermore, when
   repeated commands fail to be acknowledged, it is the responsibility
   of the requesting entity to seek redundant services and/or clear
   existing or pending connections.

   The specification purposely avoids specifying any value for the
   retransmission timers. These values are typically network dependent.
   The retransmission timers should normally estimate the timer by
   measuring the time spent between the sending of a command and the
   return of a response. At a minimum, a retransmission strategy
   involving exponential backoff must be implemented. One possibility


Arango, et al.      Informational - Expires  July 2001        [Page 93]

Internet Draft                MGCP 1.0bis                  January 2001

   is to use the algorithm implemented in TCP-IP, which uses two
   variables:

   *  the average acknowledgement delay, AAD, estimated through an
      exponentially smoothed average of the observed delays,

   *  the average deviation, ADEV, estimated through an exponentially
      smoothed average of the absolute value of the difference between
      the observed delay and the current average

   The retransmission timer, RTO, in TCP, is set to the sum of the
   average delay plus N times the average deviation, where N is a
   constant. In MGCP, the maximum value of the timer should however be
   bounded, in order to guarantee that no repeated packet will be
   received by the gateways after T-HIST seconds. A suggested maximum
   value for RTO is 4 seconds.

   After any retransmission, the MGCP entity should do the following:

   *  It should double the estimated value of the acknowledgement delay
      for this transaction, T-DELAY.

   *  It should compute a random value, uniformly distributed between
     0.5 T-DELAY and T-DELAY.

   *  It should set the retransmission timer (RTO) to the sum of that
     random value and N times the average deviation.

   This procedure has two effects. Because it includes an exponentially
   increasing component, it will automatically slow down the stream of
   messages in case of congestion. Because it includes a random
   component, it will break the potential synchronization between
   notifications triggered by the same external event.

   Note that the estimators AAD and ADEV should not be updated for
   transactions that involve retransmissions. Also, the first new
   transmission following a successful retransmission should use the
   RTO for that last retransmission. If this transmission succeeds
   without any retransmissions, the AAD and ADEV estimators are updated
   and RTO is determined as usual again. See e.g. [18] for further
   details.

3.5.4.  Piggy Backing

   There are cases when a Call Agent will want to send several messages
   at the same time to the same gateways, and vice versa.  When several
   MGCP messages have to be sent in the same UDP packet, they should be
   separated by a line of text that contains a single dot, as in for
   example:





Arango, et al.      Informational - Expires  July 2001        [Page 94]

Internet Draft                MGCP 1.0bis                  January 2001

      200 2005 OK

      DLCX 1244 card23/21@tgw-7.example.net MGCP 1.0
      C: A3C47F21456789F0
      I: FDE234C8

   The piggy-backed messages should be processed exactly as if they had
   been received in several simultaneous messages. However, if a
   message (command or response) needs to be retransmitted, the entire
   datagram must be retransmitted, not just the missing message.
   Furthermore, if a (new) datagram piggy-backs a currently outstanding
   command with a new command, retransmission of the old datagram with
   the outstanding command should cease. For example, assume command C1
   was sent in datagram D1, and later commands C1 and C2 are sent
   (piggy-backed) in datagram D2. Retransmission of D1 should then
   cease. This will prevent endpoints from inadvertently becoming
   disconnected when a backup call agent has taken over.

   The individual messages in the datagram must be processed in order
   starting with the first message, and each command must be responded
   to. Errors encountered in a message that was piggybacked must not
   affect any of the other messages received in that packet – each
   message is processed on its own.

3.5.5.  Provisional Responses

   Executing some transactions may require a long time. Long execution
   times may interact with the timer based retransmission procedure.
   This may result either in an inordinate number of retransmissions,
   or
   in timer values that become too long to be efficient.

   Gateways that can predict that a transaction will require a long
   execution time should send a provisional response, with response
   code 100. As a guideline, a transaction that requires external
   communication to complete, e.g. network resource reservation, should
   issue a provisional response. Furthermore entities should send this
   response if they receive a repetition of a transaction that is still
   being executed.

   Pure transactional semantics would imply, that provisional responses
   should not return any other information than the fact that the
   transaction is currently executing, however an optimistic approach
   allowing some information to be returned enables a reduction in the
   delay that would otherwise be incurred in the system.

   In order to reduce the delay in the system, it is recommended to
   include a connection identifier and session description in a
   provisional response to the CreateConnection command. If a session
   description should be returned by the ModifyConnection command, the
   session description should be included in the provisional response
   here as well. If the transaction completes successfully, the
   information returned in the provisional response MUST be repeated in

Arango, et al.      Informational - Expires  July 2001        [Page 95]

Internet Draft                MGCP 1.0bis                  January 2001

   the final response. It is considered a protocol error not to repeat
   this information or to change any of the previously supplied
   information in a successful response. If the transaction fails, an
   error code is returned - the information returned previously is no
   longer valid.

   A currently executing CreateConnection or ModifyConnection
   transaction MUST be cancelled if a DeleteConnection command for the
   endpoint is received. In that case, a response for the cancelled
   transaction SHOULD still be returned automatically, and a response
   for the cancelled transaction MUST be returned if a retransmission
   of the cancelled transaction is detected.

   MGCP entities that receive a provisional response shall switch to a
   longer repetition timer (LONGTRAN-TIMER) for that transaction.

   When the transaction finishes execution, the final response is sent
   and the by now obsolete provisional response is deleted. In order to
   ensure rapid detection of a lost final response, final responses
   issued after provisional responses for a transaction should be
   acknowledged.

   The endpoint should therefore include an empty "ResponseAck"
   parameter in those, and only those, final responses. The presence of
   the "ResponseAck" parameter in the final response should trigger a
   "Response Acknowledgement" response to be sent back to the endpoint.
   The Response Acknowledgement" response will then include the
   transaction-id of the response it acknowledges in the response
   header. Note, that for backwards compatibility, entities can not
   depend on receiving such a "response acknowledgement", however it is
   strongly recommended to support this behavior, as excessive delays
   in case of packet loss as well as excessive retransmissions may
   occur otherwise.

   Receipt of a "Response Acknowledgement" response is subject to the
   same time-out and retransmission strategies and procedures as
   responses to commands, i.e., the sender of the final response will
   retransmit it if a "Response Acknowledgement" is not received in
   time. For backwards compatibility, failure to receive a "response
   acknowledgement" should not affect the roundtrip time estimates for
   subsequent commands, and furthermore should not lead to the endpoint
   becoming "disconnected". The "Response Acknowledgment " response is
   never acknowledged.











Arango, et al.      Informational - Expires  July 2001        [Page 96]

Internet Draft                MGCP 1.0bis                  January 2001

4.  States, Failover and Race Conditions.

   In order to implement proper call signaling, the Call Agent must
   keep track of the state of the endpoint, and the gateway must make
   sure that events are properly notified to the Call Agent.  Special
   conditions exist when the gateway or the Call Agent are restarted:
   the gateway must be redirected to a new Call Agent during "failover"
   procedures, the Call Agent must take special action when the gateway
   is taken offline, or restarted.

4.1.  Failover Assumptions and Highlights

   The following protocol highlights are important to understanding
   Call Agent fail-over mechanisms:

   *  Call Agents are identified by their domain name (and optional
      port), not their network addresses, and several addresses can be
      associated with a domain name.

   *  An endpoint has one and only one Call Agent associated with it at
      any given point in time. The Call Agent associated with an
      endpoint is the current value of the "notified entity". The
      "notified entity" determines where the gateway will send it's
      commands. If the "notified entity" does not include a port
      number, the default Call Agent port number (2727) is assumed.

   *  NotifiedEntity is a parameter sent by the Call Agent to the
      gateway to set the "notified entity" for the endpoint.

   *  The "notified entity" for an endpoint is the last value of the
      NotifiedEntity parameter received for this endpoint. If no
      explicit NotifiedEntity parameter has ever been received, the
      "notified entity" defaults to a provisioned value. If no value
      was provisioned or an empty NotifiedEntity parameter was provided
      (both strongly discouraged) thereby making the "notified entity"
      empty, the "notified entity" is set to the source address of the
      last non-audit command for the endpoint. Thus auditing will not
      change the "notified entity".

   *  Responses to commands are sent to the source address of the
      command, regardless of the current "notified entity". When a
      Notify message needs to be piggy-backed with the response, the
      datagram is still sent to the source address of the new command
      received, regardless of the current "notified entity".

   The ability for the "notified entity" to resolve to multiple network
   addresses, allows a "notified entity" to represent a Call Agent with
   multiple physical interfaces on it and/or a logical Call Agent made
   up of multiple physical systems. The order of network addresses when
   a DNS name resolves to multiple addresses is non-deterministic so
   that Call Agent fail-over schemes should not depend on that order
   (e.g. a gateway should be able to send a "Notify" to any of the
   resolved network addresses). On the other hand, the system is likely

Arango, et al.      Informational - Expires  July 2001        [Page 97]

Internet Draft                MGCP 1.0bis                  January 2001

   to be most efficient if the gateway sends commands to the interface
   with which it already has a current association. Gateways may use
   the following algorithm to achieve that goal:

   *  if the "notified entity" resolves to multiple network addresses,
      and the source address of the request is one of those addresses,
      that network address is the preferred destination address for new
      commands.

   *  If on the other hand, the source address of the request is not
      one of the resolved addresses, the gateway must choose one of the
      resolved addresses.

   *  If the gateway fails to contact the network address chosen, it
      must try the alternatives in the resolved list as described in
      the retransmission section below.

   If an entire Call Agent becomes unavailable, the endpoints managed
   by that Call Agent will eventually become "disconnected". The only
   way for these endpoints to become connected again is either for the
   failed Call Agent to become available, or for a backup call agent to
   contact the affected endpoints with a new "notified entity".

   When a backup Call Agent has taken over control of a group of
   endpoints, it is assumed that the failed Call Agent will communicate
   and synchronize with the backup Call Agent in order to transfer
   control of the affected endpoints back to the original Call Agent.
   Alternatively, the failed Call Agent could simply become the backup
   Call Agent.

   We should note that handover conflict resolution between separate
   CA's is not in place - we are relying strictly on the CA's knowing
   what they are doing and communicating with each other (although
   AuditEndpoint can be used to learn about the current NotifiedEntity)

   Note that as mentioned earlier, the default "notified entity" may be
   provisioned and may include both domain name and port. For small
   gateways, provisioning may be done on a per endpoint basis. For much
   larger gateways, a single provisioning element may be provided for
   multiple endpoints or even for the entire gateway itself. In either
   case, once the gateway powers up, each endpoint must have its own
   "notified entity" so that provisioned values for an aggregation of
   endpoints must be copied to the "notified entity" for each endpoint
   in the aggregation before operation proceeds. Where possible, the
   RestartInProgress command on restart should be sent to the
   provisioned "notified entity" based on an aggregation that allows
   the "all of" wild-card to be used.

   Another way of viewing the use of "notified entity" is in terms of
   associations between gateways and Call Agents. The "notified entity"
   is a means to set up that association. The association is initially
   provisioned with a provisioned "notified entity", so that on power
   up Restart-in-Progress and persistent events that occur prior to the

Arango, et al.      Informational - Expires  July 2001        [Page 98]

Internet Draft                MGCP 1.0bis                  January 2001

   first NotificationRequest from Call Agents will be sent to the
   provisioned Call Agent. Once a Call Agent makes a request, however
   it may include the NotifiedEntity parameter and set up a new
   association.  Since the "notified entity" persists across calls, the
   association remains intact until a new "notified entity" is
   provided.

4.2.  Communicating with Gateways

   Endpoint names in gateways include a local name indicating the
   specific endpoint and a domain name indicating the host/gateway
   where the endpoint resides. Large gateways may have several
   interfaces for redundancy.

   In gateways that have routing capability, the domain name may
   resolve to a single network address with internal routing to that
   address from any of the gateway's interfaces. In others, the domain
   name may resolve to multiple network addresses, one for each
   interface. In the latter case, if a Call Agent fails to contact the
   gateway on one of the addresses, it should try the alternates.

4.3.  Retransmission, and Detection of Lost Associations:

   The media gateway control protocol is organized as a set of
   transactions, each of which is composed of a command and a response,
   commonly referred to as an acknowledgement. The MGCP messages, being
   carried over UDP, may be subject to losses. In the absence of a
   timely response, commands are repeated. MGCP entities are expected
   to keep in memory a list of the responses that they sent to recent
   transactions, i.e. a list of all the responses they sent over the
   last T-HIST seconds, and a list of the transactions that are
   currently being executed.

   The transaction identifiers of incoming commands are compared to the
   transaction identifiers of the recent responses. If a match is
   found, the MGCP entity does not execute the transaction, but simply
   repeats the response. If a match to a previously responded to
   transaction is not found, the transaction identifier of the incoming
   command is compared to the list of transactions that have not yet
   finished executing If a match is found, the MGCP entity does not
   execute the transaction, which is simply ignored - a final response
   will be provided when the execution of the command is complete. In
   the mean time, a provisional response should be issued.

   The repetition mechanism is used to guard against four types of
   possible errors:

   *  transmission errors, when for example a packet is lost due to
      noise on a line or congestion in a queue,

   *  component failure, when for example an interface to a Call Agent
      becomes unavailable,


Arango, et al.      Informational - Expires  July 2001        [Page 99]

Internet Draft                MGCP 1.0bis                  January 2001

   *  Call Agent failure, when for example an entire Call Agent becomes
      unavailable,

   *  failover, when a new Call Agent is "taking over" transparently.

   The elements should be able to derive from the past history an
   estimate of the packet loss rate due to transmission errors. In a
   properly configured system, this loss rate should be kept very low,
   typically less than 1%. If a Call Agent or a gateway has to repeat a
   message more than a few times, it is very legitimate to assume that
   something else than a transmission error is occurring. For example,
   given a loss rate of 1%, the probability that 5 consecutive
   transmission attempts fail is 1 in 100 billion, an event that should
   occur less than once every 10 days for a Call Agent that processes
   1,000 transactions per second. (Indeed, the number of repetition
   that is considered excessive should be a function of the prevailing
   packet loss rate.) We should note that the "suspicion threshold",
   which we will call "Max1", is normally lower than the "disconnection
   threshold", which we will call "Max2", which should be set to a
   larger value.


































Arango, et al.      Informational - Expires  July 2001       [Page 100]

Internet Draft                MGCP 1.0bis                  January 2001

      Command issued: N=0, T=0
              |
       transmission: N++
              |  +------------ retransmission: N++ -------------+
              |  |                                              |
              |  |       transmission                           |
              |  |  +---to new address -+<----------------------|--+
              |  |  |        N=0        |                       |  |
              V  V  V                   |                       |  |
        +-----------+                   |                       |  |
        | awaiting  |- new Call Agent ->+  +------------+       |  |
        |  response |-- timer elapsed  --->| T > T-Max ?|       |  |
        +-----------+                      +------------+       ^  |
              |                              |     |            |  |
              |               +----(yes)-----+    (no)          |  |
           response           |                    |            |  |
           received           |              +------------+     |  |
              |               |              | N > Max1 ? |-(no)+  |
              |               |              +------------+     ^  |
              v               |                    |            |  |
            (end)             |                  (yes)          |  |
                              |                    |            |  |
                              |     (if first address & N=Max1, |  |
                              |      or last address & N=Max2   |  |
                              |               check DNS)        |  |
                              |                    |            |  |
                              |           +---------------+     |  |
                              |           |more addresses?|(yes)|--+
                              |           +---------------+     |
                              |                    |            |
                              |                  (no)           |
                              |                    |            |
                              |              +------------+     |
                              |              | N > Max2 ? |(no)-+
                              |              +------------+
                              |                    |
                              |                  (yes)
                              |                    |
                              |                    v
                              +------------>(disconnected)

   A classic retransmission algorithm would simply count the number of
   successive repetitions, and conclude that the association is broken
   after re-transmitting the packet an excessive number of times
   (typically between 7 and 11 times.) In order to account for the
   possibility of an undetected or in-progress "failover", we modify
   the classic algorithm as follows:

   *  We request that the gateway always checks for the presence of a
      new Call Agent. It can be noticed either by:

      -  receiving a command where the NotifiedEntity points to the new
         Call Agent, or

Arango, et al.      Informational - Expires  July 2001       [Page 101]

Internet Draft                MGCP 1.0bis                  January 2001


      -  receiving a redirection response pointing to a new Call Agent.

      If a new Call Agent is detected, the gateway starts
      retransmitting outstanding commands for the endpoint(s)
      redirected to that new agent. Responses to new or old commands
      are still transmitted to the source address of the command.

   *  Prior to any retransmission, it is checked that the time elapsed
      since the sending of the initial datagram is no greater than T-
      MAX. If more than T-MAX t
                              i
                               m
                                e
                                  
                                  has elapsed, the endpoint becomes
      disconnected.

   *  we request that if the number of repetitions for this Call Agent
      is larger than "Max1", that the gateway actively queries the name
      server in order to detect the possible change of the Call Agent
      interfaces.

   *  The gateway may have learned several IP addresses for the call
      agent. If the number of repetitions for this IP address is larger
      than "Max1" and lower than "Max2", and there are more addresses
      that have not been tried, then the gateway should direct the
      retransmissions to alternate addresses.

   *  If there are no more interfaces to try, and the number of
      repetitions for this address is Max2, then the gateway contacts
      the DNS one more time to see if any other interface should have
      become available. If not, the gateway is now disconnected and
      must initiate the "disconnected" procedure.

   The above procedure will maximize the chances of detecting an
   ongoing failover. It poses indeed two very specific problems, the
   potentially long delays of a timer based procedure and the risk of
   confusion caused by the use of cryptographic protections.

   In order to automatically adapt to network load, MGCP specifies
   exponentially increasing timers.  If the initial timer is set to 200
   milliseconds, the loss of a fifth retransmission will be detected
   after about 6 seconds.  This is probably an acceptable waiting delay
   to detect a failover.  The repetitions should continue after that
   delay not only in order to perhaps overcome a transient connectivity
   problem, but also in order to allow some more time for the execution
   of a failover - waiting a total delay of 30 seconds is probably
   acceptable.

   It is however important that the maximum delay of retransmissions be
   bounded. Prior to any retransmission, it is checked that the time
   (T) elapsed since the sending of the initial datagram is no greater
   than T-MAX. If more than T-MAX time has elapsed, the endpoint
   becomes disconnected. The value T-MAX is related to the T-HIST
   value: the
   T-HIST value must be greater than or equal to T-MAX plus the maximum
   propagation delay in the network.

Arango, et al.      Informational - Expires  July 2001       [Page 102]

Internet Draft                MGCP 1.0bis                  January 2001


   The default value for T-MAX is 20 seconds. Thus, if the assumed
   maximum propagation delay is 10 seconds, then responses to old
   transactions must be kept for a period of at least 30 seconds. The
   importance of having the sender and receiver agree on these values
   cannot be overstated.

   The default value for Max1 is 5 retransmissions and the default
   value for Max2 is 7 retransmissions. Both of these values may be
   altered by the provisioning process.

4.4.  Race Conditions

   MGCP deals with race conditions through the notion of a "quarantine
   list" and through explicit detection of desynchronization e.g. for
   mismatched hook state due to glare for an endpoint.

   MGCP does not assume that the transport mechanism will maintain the
   order of commands and responses. This may cause race conditions,
   that may be obviated through a proper behavior of the Call Agent.
   (Note that some race conditions are inherent to distributed systems;
   they would still occur, even if the commands were transmitted in
   strict order.)

   In some cases, many gateways may decide to restart operation at the
   same time.  This may occur, for example, if an area loses power or
   transmission capability during an earthquake or an ice storm.  When
   power and transmission are reestablished, many gateways may decide
   to send "RestartInProgress" commands simultaneously, leading to very
   unstable operation.

4.4.1.  Quarantine List

   MGCP controlled gateways will receive "notification requests" that
   ask them to watch for a list of "events". The protocol elements that
   determine the handling of these events are the "Requested Events"
   list, the "Digit Map" and the "Detect Events" list.

   When the endpoint is initialized, the requested events list only
   consists of persistent events for the endpoint, and the digit map is
   assumed empty. After reception of a command, the gateway starts
   observing the endpoint for occurrences of the events mentioned in
   the list, including persistent events.

   The events are examined as they occur. The action that follows is
   determined by the "action" parameter associated to the event in the
   list of requested events, and also by the digit map. The events that
   are defined as "accumulate" or "accumulate according to digit map"
   are accumulated in a list of events, the events that are marked as
   "accumulate according to the digit map" will additionally be
   accumulated in the "current dial string". This will go on until one
   event is encountered that triggers a Notification which will be sent
   to the current "notified entity".

Arango, et al.      Informational - Expires  July 2001       [Page 103]

Internet Draft                MGCP 1.0bis                  January 2001


   The gateway, at this point, will transmit the notification command
   and will place the endpoint in a "notification" state. As long as
   the endpoint is in this notification state, the events that are to
   be detected on the endpoint are stored in a "quarantine" buffer for
   later processing. The events are, in a sense, "quarantined". All
   events that are specified by the union of the RequestedEvents
   parameter and the most recently received DetectEvents parameter or,
   in the absence of the latter, all events that are referred to in the
   RequestedEvents, shall be detected and quarantined, regardless of
   the action associated to the event. Persistent events are here being
   viewed as implicitly included in RequestedEvents.

   The endpoint exits the "notification state" when the acknowledgement
   of the Notify command is received. The Notify command may be
   retransmitted in the "notification state", as specified in Section
   3.5. When the endpoint exits the "notification state" it resets the
   list of observed events and the "current dial string" of the
   endpoint to a null value.

   Following that point, the behavior of the gateway depends on the
   value of The QuarantineHandling parameter in the triggering
   notification request. If the Call Agent specified that it expected
   at most one notification in response to the notification request
   command, then the gateway should simply keep on accumulating events
   in the quarantine list until it receives the next notification
   request command.

   If the gateway is authorized to send multiple successive Notify
   commands, it will proceed as follows. When the gateway exits the
   "notification state", it resets the list of observed events and the
   "current dial string" of the endpoint to a null value and starts
   processing the list of quarantined events, using the already
   received list of requested events and digit map. When processing
   these events, the gateway may encounter an event which requires a
   Notify command to be sent. If that is the case, the gateway can
   adopt one of the two following behaviors:

   *  it can immediately transmit a Notify command that will report all
      events that were accumulated in the list of observed events until
      the triggering event, included, leaving the unprocessed events in
      the quarantine list,

   *  or it can attempt to empty the quarantined list and transmit a
      single Notify command reporting several sets of events and
      possibly several dial strings. The dial string is reset to a null
      value after each triggering event. The events that follow the
      last triggering event are left in the quarantine list.

   If the gateway transmits a Notify command, the endpoint will reenter
   and remain in the "notification state" until the acknowledgement is
   received. If the gateway does not find a quarantined event that
   requests a Notify command, it places the end point in a normal

Arango, et al.      Informational - Expires  July 2001       [Page 104]

Internet Draft                MGCP 1.0bis                  January 2001

   state. Events are then processed as they come, in exactly the same
   way as if a Notification Request command had just been received.

   A gateway may receive at any time a new Notification Request command
   for the end point. When a new notification request is received in
   the notification state, the gateway shall ensure that the pending
   notification is received by the Call Agent prior to a successful
   response to the new NotificationRequest. It does so by using the
   "piggy-backing" functionality of the protocol. The messages will
   then be sent in a single packet to the source of the new
   NotificationRequest, regardless of the source and "notified entity"
   for the old and new command. The steps involved are the following:

   a) the gateway builds a message that carries in a single packet a
      repetition of the old pending Notify command and the
      acknowledgement of the new notification request.

   b) the endpoint is then taken out of the "notification state"
      without waiting for the acknowledgement of the Notify command.

   c) a copy of the unacknowledged Notify command is kept until an
      acknowledgement is received.  If a timer elapses, the Notify will
      be retransmitted (to the source of the new notification request),
      in a packet that will also carry a repetition of the
      acknowledgement of the new notification request.

   d) if the acknowledgement to the new notification request is lost,
      the Call Agent will retransmit the Notification Request.  The
      gateway will reply to this repetition by retransmitting in a
      single packet the unacknowledged Notify and the acknowledgement
      of the new notification request (step a).

   e) if the gateway has to transmit a new Notify before the previous
      Notify is acknowledged, it should construct a packet that
      piggybacks a repetition of the old Notify, a repetition of the
      acknowledgement of the last notification request and the new
      Notify. This datagram will be sent to the current "notified
      entity".

   f) Gateways that cannot piggyback several messages in the same
      datagram should elect to leave the endpoint in the "notification"
      state as long as the last Notify is not acknowledged.

   The procedure is illustrated by the following diagram:










Arango, et al.      Informational - Expires  July 2001       [Page 105]

Internet Draft                MGCP 1.0bis                  January 2001

    +-------------------+
    | Processing Events |<----------------------------------+
    +-------------------+                                   |
             |                                              |
     Need to send NTFY                                      |
             |                                              |
             v                                              |
    +-------------------+                                   |
    | Outstanding NTFY  |---- No -------+                   |
    | + RQNT response ? |               |                   |
    +-------------------+               v                   |
             |                    +-----------+             |
            Yes                   | Send NTFY |             |
             |                    +-----------+             |
             v                          |                   |
    +--------------------+              v                   |
    | Piggyback new NTFY |     +--------------------+       |
    | w. old outstanding |---->| Notification State |       |
    | datagram           |     +--------------------+       |
    +--------------------+       |               |          |
                             new RQNT        NTFY response  |
                             received        received       |
                                 |               |          |
                   +-------------+               v          |
                   |                      +-------------+   |
                   v                 +----| Step mode ? |   |
       +-----------------------+     |    +-------------+   |
       | Piggyback new RQNT    |     |           |          |
       | response with *new*   |     No         Yes         |
       | outstandding datagram |     |           |          |
       +-----------------------+     |           v          |
                  |                  |   +---------------+  |
                  |                  |   | Wait for RQNT |  |
                  |                  |   +---------------+  |
                  |                  |           |          |
                  |                  |     RQNT received    |
                  |                  |           |          |
                  |                  |           v          |
                  |                  |    +------------+    |
                  |                  |    | Apply RQNT |--->+
                  |                  |    +------------+    |
                  v                  v                      |
                  +----------------->+--------------------->+

   After receiving the Notification Request command, the requested
   events list and digit map (if a new one was provided) are replaced
   by the newly received parameters, and the list of observed events
   and current dial string are reset to a null value.  The behavior is
   conditioned by the value of the QuarantineHandling parameter. The
   parameter may specify that quarantined events, and observed events,
   should be discarded, in which case they will be. If the parameter
   specifies that the quarantined events should be processed, the
   gateway will start processing the list of quarantined events and

Arango, et al.      Informational - Expires  July 2001       [Page 106]

Internet Draft                MGCP 1.0bis                  January 2001

   observed events, using the newly received list of requested events
   and digit map. When processing these events, the gateway may
   encounter an event which requires a Notify command to be sent. If
   that is the case, the gateway will immediately transmit a Notify
   command that will report all events that were accumulated in the
   list of observed events until the triggering event, included,
   leaving the unprocessed events in the quarantine buffer, and will
   enter the "notification state".

   A new notification request may be received while the gateway has
   accumulated events according to the previous notification requests,
   but has not yet detected a notification-triggering events.  The
   handling of not-yet-notified events is determined, as with the
   quarantined events, by the quarantine handling parameters:

   *  If the quarantine-handling parameter specifies that quarantined
      events shall be ignored, the observed events list is simply
      reset.

   *  If the quarantine-handling parameter specifies that quarantined
      events shall be processed, the observed event list is transferred
      to the quarantined event list.  The observed event list is then
      reset, and the quarantined event list is processed.

   Call Agents SHOULD provide the response to a successful Notify
   message and the new NotificationRequest in the same datagram using
   the piggy-backing mechanism.

4.4.2.  Explicit Detection

   A key element of the state of several endpoints is the position of
   the hook. A race condition may occur when the user decides to go
   off-hook before the Call Agent has the time to ask the gateway to
   notify an off-hook event (the "glare" condition well known in
   telephony), or if the user goes on-hook before the Call Agent has
   the time to request the event's notification.

   To avoid this race condition, the gateway should check the condition
   of the endpoint before acknowledging a NotificationRequest. It
   should return an error:

   1. If the gateway is requested to notify an "off-hook" transition
      while the phone is already off-hook, (error code 401 – phone off
      hook)

   2. If the gateway is requested to notify an "on-hook" or "flash
      hook" condition while the phone is already on-hook (error code
      402 – phone on hook).

   Additionally, individual signal definitions can specify that a
   signal will only operate under certain conditions, e.g., ringing may
   only be possible if the phone is already off-hook. If such
   prerequisites exist for a given signal, the gateway MUST return the

Arango, et al.      Informational - Expires  July 2001       [Page 107]

Internet Draft                MGCP 1.0bis                  January 2001

   error specified in the signal definition if the prerequisite is not
   met.

   It should be noted, that the condition check is performed at the
   time the notification request is received, where as the actual event
   that caused the current condition may have either been reported, or
   ignored earlier, or it may currently be quarantined.

   The other state variables of the gateway, such as the list of
   RequestedEvents or list of requested signals, are entirely replaced
   after each successful NotificationRequest, which prevents any long
   term discrepancy between the Call Agent and the gateway.

   When a NotificationRequest is unsuccessful, whether it is included
   in a connection-handling command or not, the gateway will simply
   continue as if the command had never been received. As all other
   transactions, the NotificationRequest should operate as an atomic
   transaction, thus any changes initiated as a result of the command
   should be reverted.

   Another race condition may occur when a Notify is issued shortly
   before the reception by the gateway of a NotificationRequest. The
   RequestIdentifier is used to correlate Notify commands with
   NotificationRequest commands thereby enabling the Call Agent to
   determine if the Notify command was generated before or after the
   gateway received the new NotificationRequest. This is especially
   important to avoid deadlocks in "step" mode.

4.4.3.  Transactional Semantics

   As the potential transaction completion times increase, e.g. due to
   external resource reservations, a careful definition of the
   transactional semantics becomes increasingly important. In
   particular the issue of race conditions, specifically as it relates
   to hook-state must be defined carefully.

   An important point to consider is, that the hook-state may in fact
   change between the time a transaction is initiated and the time it
   completes. More generally, we may say that the successful completion
   of a transaction depends on one or more pre-conditions where one or
   more of the pre-conditions may change dynamically during the
   execution of the transaction.

   The simplest semantics for this is simply to require that all pre-
   conditions MUST be met from the time the transaction is initiated
   until the transaction completes. Thus, if any of the preconditions
   change during the execution of the transaction, the transaction MUST
   fail. Furthermore, as soon as the transaction is initiated, all new
   events are quarantined. When the outcome of the transaction is
   known, all quarantined events are then processed.

   As an example, consider a transaction that includes a request for
   the "off-hook" event. When the transaction is initiated the phone is

Arango, et al.      Informational - Expires  July 2001       [Page 108]

Internet Draft                MGCP 1.0bis                  January 2001

   "on-hook" and this pre-condition is therefore met. If the hook-state
   changes to "off-hook" before the transaction completes, the pre-
   condition is no longer met, and the transaction therefore
   immediately fails. The "off-hook" event will now be stored in the
   "quarantine" buffer which then gets processed.

   Another related issue is the use of wildcards, especially the "all
   of" wildcard which may match more than one endpoint. When a command
   is requested, and the endpoint identifier matches more than one
   endpoint, transactional semantics still apply. Thus, the command
   must either succeed for all the endpoints, or it must fail for all
   of them. A single response is consequently always issued.

4.4.4.  Ordering of Commands, and Treatment of Disorder

   MGCP does not mandate that the underlying transport protocol
   guarantees the sequencing of commands sent to a gateway or an
   endpoint. This property tends to maximize the timeliness of actions,
   but it has a few draw backs. For example:

   *  Notify commands may be delayed and arrive to the Call Agent after
      the transmission of a new Notification Request command,

   *  If a new NotificationRequest is transmitted before a previous one
      is acknowledged, there is no guarantee that the previous one will
      not be received in second position.

   Call Agents that want to guarantee consistent operation of the
   endpoints can use the following rules:

   1) When a gateway handles several endpoints, commands pertaining to
      the different endpoints can be sent in parallel, for example
      following a model where each endpoint is controlled by its own
      process or its own thread.

   2) When several connections are created on the same endpoint,
      commands pertaining to different connections can be sent in
      parallel.

   3) On a given connection, there should normally be only one
      outstanding command (create or modify).  However, a
      DeleteConnection command can be issued at any time.  In
      consequence, a gateway may sometimes receive a ModifyConnection
      command that applies to a previously deleted connection.  Such
      commands will fail, and an error code should be returned.

   4) On a given endpoint, there should normally be only one
      outstanding NotificationRequest command at any time.  The
      RequestId parameter should be used to correlate Notify commands
      with the triggering notification request.

   5) In some cases, an implicitly or explicitly wildcarded
      DeleteConnection command that applies to a group of endpoints can

Arango, et al.      Informational - Expires  July 2001       [Page 109]

Internet Draft                MGCP 1.0bis                  January 2001

      step in front of a pending CreateConnection command.  The Call
      Agent should individually delete all connections whose completion
      was pending at the time of the global DeleteConnection command.
      Also, new CreateConnection commands for endpoints named by the
      wild-carding cannot be sent until the wild-carded
      DeleteConnection command is acknowledged.

   6) When commands are embedded within each other, sequencing
      requirements for all commands must be adhered to. For example a
      Create Connection command with a Notification Request in it must
      adhere to the sequencing for CreateConnection and
      NotificationRequest at the same time.

   7) AuditEndpoint and AuditConnection is not subject to any
      sequencing.

   8) RestartInProgress must always be the first command sent by an
      endpoint as defined by the restart procedure. Any other command
      or response, except for responses to auditing, must be delivered
      after this RestartInProgress command (piggy-backing allowed).

   9) When multiple messages are piggy-backed in a single packet, the
      messages are always processed in order.

   10) On a given endpoint, there should normally be only one
      outstanding EndpointConfiguration command at any time.

   Gateways must not make any assumptions as to whether Call Agents
   follow the rules or not. Consequently gateways must always respond
   to commands, regardless of whether they adhere to the above rules or
   not.

   Where a single outstanding command is expected (ModifyConnection,
   NotificationRequest, and EndpointConfiguration), but the same
   command is received in a new transaction before the old finishes
   executing, the gateway may choose to fail the previous command
   (recommended) or continue executing the commands in order for the
   affected endpoint(s) and connection(s). In the former case, the use
   of error code 400 (transient error) is recommended.

4.4.5.  Fighting the Restart Avalanche

   Let's suppose that a large number of gateways are powered on
   simultaneously.  If they were to all initiate a RestartInProgress
   transaction, the Call Agent would very likely be swamped, leading to
   message losses and network congestion during the critical period of
   service restoration. In order to prevent such avalanches, the
   following behavior is suggested:

   1) When a gateway is powered on, it should initiate a restart timer
      to a random value, uniformly distributed between 0 and a maximum
      waiting delay (MWD). Care should be taken to avoid synchronicity


Arango, et al.      Informational - Expires  July 2001       [Page 110]

Internet Draft                MGCP 1.0bis                  January 2001

      of the random number generation between multiple gateways that
      would use the same algorithm.

   2) The gateway should then wait for either the end of this timer,
      the reception of a command from the Call Agent, or the detection
      of a local user activity, such as for example an off-hook
      transition on a residential gateway.

   3) When the timer elapses, when a command is received, or when an
      activity is detected, the gateway should initiate the restart
      procedure.

   The restart procedure simply requires the endpoint to guarantee that
   the first non-audit message (command or non-501 response to commands
   other than auditing) that the Call Agent sees from this endpoint is
   a RestartInProgress message informing the Call Agent about the
   restart. The endpoint is free to take full advantage of piggy-
   backing to achieve this. Endpoints that are considered in-service
   will have a restartMethod of "restart", where as endpoints
   considered out-of-service will have a restartMethod of "forced".
   Endpoints that are out of service should respond with error code 501
   (not ready) to non-audit commands if possible.

   Should the gateway enter the "disconnected" state while carrying out
   the restart procedure, the disconnected procedure specified in
   Section 4.4.6 must be carried out, except that a "restart" rather
   than "disconnected" message is sent during the procedure.

   It is expected that each endpoint in a gateway will have a
   provisionable Call Agent, i.e., "notified entity", to direct the
   initial restart message towards. When the collection of endpoints in
   a gateway is managed by more than one Call Agent, the above
   procedure must be performed for each collection of endpoints managed
   by a given Call Agent. The gateway MUST take full advantage of wild-
   carding to minimize the number of RestartInProgress messages
   generated when multiple endpoints in a gateway restart and the
   endpoints are managed by the same Call Agent. Note that during
   startup, it is possible for endpoints to start out as being out-of-
   service, and then become in-service as part of the gateway
   initialization procedure. A gateway may thus choose to send first a
   "forced" RestartInProgress for all its endpoints, and subsequently a
   "restart" RestartInProgress for the endpoints that come in-service.
   Alternatively, the gateway may simply send "restart"
   RestartInProgress for only those endpoints that are in-service, and
   "forced" RestartInProgress for the specific endpoints that are out-
   of-service. Wild-carding MUST still be used to minimize the number
   of messages sent though.

   The value of MWD is a configuration parameter that depends on the
   type of the gateway. The following reasoning can be used to
   determine the value of this delay on residential gateways.



Arango, et al.      Informational - Expires  July 2001       [Page 111]

Internet Draft                MGCP 1.0bis                  January 2001

   Call agents are typically dimensioned to handle the peak hour
   traffic load, during which, in average, 10% of the lines will be
   busy, placing calls whose average duration is typically 3 minutes.
   The processing of a call typically involves 5 to 6 MGCP transactions
   between each endpoint and the Call Agent. This simple calculation
   shows that the Call Agent is expected to handle 5 to 6 transactions
   for each end point, every 30 minutes on average, or, to put it
   otherwise, about one transaction per end point every 5 to 6 minutes
   on average. This suggest that a reasonable value of MWD for a
   residential gateway would be 10 to 12 minutes. In the absence of
   explicit configuration, residential gateways should adopt a value of
   600 seconds for MWD.

   The same reasoning suggests that the value of MWD should be much
   shorter for trunking gateways or for business gateways, because they
   handle a large number of endpoints, and also because the usage rate
   of these endpoints is much higher than 10% during the peak busy
   hour, a typical value being 60%. These endpoints, during the peak
   hour, are thus expected to contribute about one transaction per
   minute to the Call Agent load. A reasonable algorithm is to make the
   value of MWD per "trunk" endpoint six times shorter than the MWD per
   residential gateway, and also inversely proportional to the number
   of endpoints that are being restarted. for example MWD should be set
   to 2.5 seconds for a gateway that handles a T1 line, or to 60
   milliseconds for a gateway that handles a T3 line.

4.4.6.  Disconnected Endpoints

   In addition to the restart procedure, gateways also have a
   "disconnected" procedure, which is initiated when an endpoint
   becomes "disconnected" as described in Section 4.3. It should here
   be noted, that endpoints can only become disconnected when they
   attempt to communicate with the Call Agent. The following steps are
   followed by an endpoint that becomes "disconnected":

   1. A "disconnected" timer is initialized to a random value,
      uniformly distributed between 0 and a provisionable
      "disconnected" initial waiting delay (Tdinit), e.g., 15 seconds.
      Care MUST be taken to avoid synchronicity of the random number
      generation between multiple gateways and endpoints that would use
      the same algorithm.

   2. The gateway then waits for either the end of this timer, the
      reception of a command from the Call Agent, or the detection of a
      local user activity for the endpoint, such as for example an off-
      hook transition.

   3. When the "disconnected" timer elapses, when a command is
      received, or when a local user activity is detected, the gateway
      initiates the "disconnected" procedure for the endpoint. In the
      case of local user activity, a provisionable "disconnected"
      minimum waiting delay (Tdmin) must furthermore have elapsed since
      the gateway became disconnected or the last time it initiated the

Arango, et al.      Informational - Expires  July 2001       [Page 112]

Internet Draft                MGCP 1.0bis                  January 2001

      "disconnected" procedure in order to limit the rate at which the
      procedure is performed.

   4. If the "disconnected" procedure still left the endpoint
      disconnected, the "disconnected" timer is then doubled, subject
      to a provisionable "disconnected" maximum waiting delay (Tdmax),
      e.g., 600 seconds, and the gateway proceeds with step 2 again.

   The "disconnected" procedure is similar to the restart procedure in
   that it now simply states that the endpoint MUST send a
   RestartInProgress command to the Call Agent informing it that the
   endpoint was disconnected and furthermore guarantee that the first
   non-audit message (command or response to command other than
   auditing) that the Call Agent now sees from this endpoint MUST be
   this RestartInProgress command. The endpoint MUST take full
   advantage of piggy-backing in achieving this. The Call Agent may
   then for instance decide to audit the endpoint, or simply clear all
   connections for the endpoint.

   This specification purposely does not specify any additional
   behavior for a disconnected endpoint. Vendors MAY for instance
   choose to provide silence, play reorder tone, or even enable a
   downloaded wav file to be played.

   The default value for Tdinit is 15 seconds, the default value for
   Tdmin, is 15 seconds, and the default value for Tdmax is 600
   seconds.



























Arango, et al.      Informational - Expires  July 2001       [Page 113]

Internet Draft                MGCP 1.0bis                  January 2001

5.  Security Requirements

   If unauthorized entities could use the MGCP, they would be able to
   set-up unauthorized calls, or to interfere with authorized calls. We
   expect that MGCP messages will always be carried over secure
   Internet connections, as defined in the IP security architecture as
   defined in RFC 2401, using either the IP Authentication Header,
   defined in RFC 2402, or the IP Encapsulating Security Payload,
   defined in RFC 2406.  The complete MGCP protocol stack would thus
   include the following layers:

                -------------------------------
               |              MGCP             |
               |-------------------------------|
               |              UDP              |
               |-------------------------------|
               |          IP security          |
               | (authentication or encryption)|
               |-------------------------------|
               |              IP               |
               |-------------------------------|
               |       transmission media      |
                -------------------------------

   Adequate protection of the connections will be achieved if the
   gateways and the Call Agents only accept messages for which IP
   security provided an authentication service. An encryption service
   will provide additional protection against eavesdropping, thus
   forbidding third parties from monitoring the connections set up by a
   given endpoint

   The encryption service will also be requested if the session
   descriptions are used to carry session keys, as defined in SDP.

   These procedures do not necessarily protect against denial of
   service attacks by misbehaving gateways or misbehaving Call Agents.
   However, they will provide an identification of these misbehaving
   entities, which should then be deprived of their authorization
   through maintenance procedures.

5.1.  Protection of Media Connections

   MGCP allows Call Agent to provide gateways with "session keys" that
   can be used to encrypt the audio messages, protecting against
   eavesdropping.

   A specific problem of packet networks is "uncontrolled barge-in".
   This attack can be performed by directing media packets to the IP
   address and UDP port used by a connection. If no protection is
   implemented, the packets will be decompressed and the signals will
   be played on the "line side".



Arango, et al.      Informational - Expires  July 2001       [Page 114]

Internet Draft                MGCP 1.0bis                  January 2001

   A basic protection against this attack is to only accept packets
   from known sources, however this tends to conflict with RTP
   principles.  But this has two inconveniences: it slows down
   connection establishment and it can be fooled by source spoofing:

   *  To enable the address-based protection, the Call Agent must
      obtain the source address of the e-gress gateway and pass it to
      the in-gress gateway.  This requires at least one network round
      trip, and leaves us with a dilemma: either allow the call to
      proceed without waiting for the round trip to complete, and risk
      for example "clipping" a remote announcement, or wait for the
      full round trip and settle for slower call-set-up procedures.

   *  Source spoofing is only effective if the attacker can obtain
      valid pairs of source and destination addresses and ports, for
      example by listening to a fraction of the traffic. To fight
      source spoofing, one could try to control all access points to
      the network.  But this is in practice very hard to achieve.

   An alternative to checking the source address is to encrypt and
   authenticate the packets, using a secret key that is conveyed during
   the call set-up procedure. This will no slow down the call set-up,
   and provide strong protection against address spoofing.































Arango, et al.      Informational - Expires  July 2001       [Page 115]

Internet Draft                MGCP 1.0bis                  January 2001

6. Packages

   As described in Section 2.1.6, packages are the preferred way of
   extending MGCP. In this section we describe the requirements
   associated with defining a package.

   A package must have a unique package name defined. The package name
   can be registered with the IANA, as long as it does not start with
   the characters "x-" or "x+" which are reserved for experimental
   packages. Please refer to Appendix B for IANA considerations.

   A package can define one or more of the following extensions:

   *  BearerInformation

   *  LocalConnectionOptions

   *  ExtensionParameters

   *  ConnectionModes

   *  Events

   *  Signals

   *  Actions

   *  DigitMapLetters

   *  ConnectionParameters

   *  RestartMethods

   *  ReasonCodes

   *  Return codes

   For each of the above types of extensions supported by the package,
   the package definition must contain a description of the extension
   as defined in the following sections. Please note, that package
   extensions, just like any other extension, must adhere to the MGCP
   grammar.

6.1 BearerInformation

   BearerInformation extensions shall include:

   *  The name and encoding of the BearerInformation extension.

   *  The possible values and encoding of those values that can be
      assigned to the BearerInformation extension.



Arango, et al.      Informational - Expires  July 2001       [Page 116]

Internet Draft                MGCP 1.0bis                  January 2001

   *  A description of the operation of the BearerInformation
      extension. As part of this description the default value (if any)
      if the extension is omitted in an EndpointConfiguration command
      must be defined. It may be necessary to make a distinction
      between the default value before and after the initial
      application of the parameter, for example if the parameter
      retains its previous value once specified, until explicitly
      altered. If default values are not described, then the extension
      parameter simply defaults to empty in all EndpointConfiguration
      commands.

   Note that the extension must be included in the result for an
   AuditEndpoint command auditing the BearerInformation.

6.2 LocalConnectionOptions

   LocalConnectionOptions extensions shall include:

   *  The name and encoding of the LocalConnectionOptions extension.

   *  The possible values and encoding of those values that can be
      assigned to the LocalConnectionOptions extension.

   *  A description of the operation of the LocalConnectionOptions
      extension. As part of this description the following must be
      specified:

   *  The default value (if any) if the extension is omitted in a
      CreateConnection command.

   *  The default value if omitted in a ModifyConnection command. This
      may be to simply retain the previous value (if any) or clear it.
      If nothing is specified, the value is cleared.

   *  If Auditing of capabilities will result in the extension being
      returned, then a description to that effect as well as with what
      possible values and their encoding (note that the package itself
      will be always be returned). If nothing is specified, the
      extension will not be returned when auditing capabilities.

   Also note, that the extension must be included in the result for an
   AuditConnection command auditing the LocalConnectionOptions.

6.3 ExtensionParameters

   Extension parameter extensions shall include

   *  The name and encoding of the extension parameter.

   *  The possible values and encoding of those values that can be
      assigned to the extension parameter.



Arango, et al.      Informational - Expires  July 2001       [Page 117]

Internet Draft                MGCP 1.0bis                  January 2001

   *  For each of the commands defined in this specification, whether
      the extension parameter is Mandatory, Optional, or Forbidden in
      requests as well as responses. Note that extension parameters
      should normally not be mandatory.

   *  A description of the operation of the extension parameter. As
      part of this description the default value (if any) if the
      extension is omitted in a command must be defined. It may be
      necessary to make a distinction between the default value before
      and after the initial application of the parameter, for example
      if the parameter retains its previous value once specified, until
      explicitly altered. If default values are not described, then the
      extension parameter simply defaults to empty in all commands.

   *  Whether the extension can be audited in AuditEndpoint and/or
      AuditConnection as well as the values returned. If nothing is
      specified, then auditing of the extension parameter can only be
      done for AuditEndpoint, and the value returned will be the
      current value for the extension. Note that this may be empty.

6.4 ConnectionModes

   Extension Connection Modes shall include:

   *  The name and encoding of the extension connection mode.

   *  A description of the operation of the extension connection mode.

   *  A description of the interaction a connection in the extension
      connection mode will have with other connections in each of the
      modes defined in this specification. If such a description is not
      provided, the extension connection mode will not have any
      interaction with other connections on the endpoint.

   Extension connection modes are not included in the list of modes in
   a response to an AuditEndpoint for Capabilities since the event
   package will be reported in the list of event packages.

6.5 Events and Signals

   The event/signal definition shall include the precise name of the
   event/signal (i.e., the code used in MGCP), a plain text definition
   of the event/signal, and, when appropriate, the precise definition
   of the corresponding events/signals, for example the exact
   frequencies of audio signal such as dial tones or DTMF tones.

   The package description must provide, for each event/signal, the
   following information:

   *  The description of the event/signal and its purpose, which should
      mean the actual signal that is generated by the client (i.e., xx
      ms FSK tone) as well as the resulting user observed result (i.e.,
      MW light on/off).

Arango, et al.      Informational - Expires  July 2001       [Page 118]

Internet Draft                MGCP 1.0bis                  January 2001


   *  The detailed characteristics of the event/signal, such as for
      example frequencies and amplitude of audio signals, modulations
      and repetitions,

   *  The typical and maximum duration of the event/signal if
      applicable.

   *  An indication of whether the signal or event can be applied to a
      connection (across a media stream).

   For events that are not signals, the following must be provided as
   well:

   *  An indication if the event is persistent. By default, events are
      not persistent.

   *  An indication if there is an auditable event-state associated
      with the event. By default, events do not have auditable event-
      states.

   For signals that are not events, the following must be provided as
      well:

   *  The type of signal (OO, TO, BR). Time-Out signals should have an
      indication of the default time-out value. In some cases, time-out
      values may be variable (if dependent on some action to complete
      such as out-pulsing digits).

   The following format is recommended for defining events and signals
   in conformance with the above:

    ------------------------------------------------------------------
   | Symbol  |   Definition               |  R  |   S     Duration    |
   |---------|----------------------------|-----|---------------------|
   |         |                            |     |                     |
   |         |                            |     |                     |
    ------------------------------------------------------------------

   where:

   *  Symbol indicates the event code used for the event/signal, e.g.
      "hd".

   *  Definition gives a brief definition of the event/signal

   *  R contains an "x" if the event can be detected or one or more of
      the following symbols:
      -  "P" if the event is persistent.
      -  "S" if the events is an event-state that may be audited.
      -  "C" if the event can be detected on a connection.

   *  S contains one of the following if it is a signal

Arango, et al.      Informational - Expires  July 2001       [Page 119]

Internet Draft                MGCP 1.0bis                  January 2001

      -  "OO" if the signal is On/Off signal.
      -  "TO" if the signal is a Time-Out signal.
      -  "BR" if the signal is a Brief signal.

   The table should then be followed by a more comprehensive
   description of each event/signal defined.

6.5.1 Default and Reserved Events

   All packages that contain Time-Out type signals contain the
   operation fail ("of") and operation complete ("oc") events,
   irrespective of whether they are provided as part of the package
   description or not. These events are needed to support Time-Out
   signals and can not be overridden in packages with Time-Out signals.

   If a package without Time-Out signals does contain definitions for
   the "oc" and "of" events, the event definitions provided in the
   package may over-ride those indicated here. Such practice is however
   discouraged and is purely allowed to avoid potential backwards
   compatibility problems.

   It is however considered good practice to explicitly mention that
   the two events are supported in accordance with their default
   definitions, which are as follows:

    ------------------------------------------------------------------
   | Symbol  |   Definition               |  R  |   S     Duration    |
   |---------|----------------------------|-----|---------------------|
   | oc      | Operation Complete         |  x  |                     |
   | of      | Operation Failure          |  x  |                     |
    ------------------------------------------------------------------

   Operation complete (oc):   The operation complete event is generated
   when the gateway was asked to apply one or several signals of type
   TO on the endpoint, and one or more of those signals completed
   without being stopped by the detection of a requested event such as
   off-hook transition or dialed digit. The completion report may carry
   as a parameter the name of the signal that came to the end of its
   live time, as in:

      O: G/oc(G/rt)

   In this case, the observed event occurred because the "rt" signal in
   the "G" package timed out.

   If the reported signal was applied on a connection, the parameter
   supplied will include the name of the connection as well, as in:

      O: G/oc(G/rt@0A3F58)

   When the operation complete event is requested, it cannot be
   parameterized with any event parameters. When the package name is
   omitted as part of the signal name, the default package is assumed.

Arango, et al.      Informational - Expires  July 2001       [Page 120]

Internet Draft                MGCP 1.0bis                  January 2001



   Operation failure (of):    The operation failure event may be
   generated when the endpoint was asked to apply one or several
   signals of type TO on the endpoint, and one or more of those signals
   failed prior to timing out. The completion report may carry as a
   parameter the name of the signal that failed, as in:

      O: G/of(G/rt)

   In this case a failure occurred in producing the "rt" signal in the
   "G" package.

   When the reported signal was applied on a connection, the parameter
   supplied will include the name of the connection as well, as in:

      O: G/of(G/rt@0A3F58)

   When the operation failure event is requested, event parameters can
   not be specified. When the package name is omitted, the default
   package name is assumed.

6.6 Actions

   Extension Actions shall include:

   *  The name and encoding of the extension action.

   *  If the extension action takes any action parameters, then the
      name, encoding, and possible values of those parameters.

   *  A description of the operation of the extension action.

   *  A listing of the actions in this specification the extension can
      be combined with. If such a listing is not provided, the
      extension action cannot be combined with any other action in this
      specification.

   *  If more than one extension action is defined in the package, then
      a listing of the actions in the package the extension can be
      combined with. If such a listing is not provided, the extension
      action cannot be combined with any other action in the package.

   Extension actions defined in two or more different packages should
   not be used simultaneously, unless very careful consideration to
   their potential interaction and side-effects has been given.

6.7 DigitMapLetters

   Extension Digit Map Letters shall include:

   *  The name and encoding of the extension digit map letter(s).


Arango, et al.      Informational - Expires  July 2001       [Page 121]

Internet Draft                MGCP 1.0bis                  January 2001

   *  A description of the meaning of the extension digit map
      letter(s).

   Note that extension DigitMapLetters do not follow the normal naming
   conventions for extensions defined in packages. More specifically
   the package name and slash ("/") will not be part of the extension
   name, thereby forming a flat and limited name space with potential
   name clashing.

   A package shall therefore not define a digit map letter extension
   whose encoding has already been used in another package. If two
   packages have used the same encoding for a digit map letter
   extension, and those two packages are supported by the same
   endpoint, the result of using that digit map letter extension is
   undefined.

6.8 ConnectionParameters

   Extension Connection Parameters shall include:

   *  The name and encoding of the connection parameter extension.

   *  The possible values and encoding of those values that can be
      assigned to the connection parameter extension.

   *  A description of how those values are derived.

   Note that the extension connection parameter must be included in the
   result for an AuditConnection command auditing the connection
   parameters.

6.9 RestartMethods

   Extension Restart Methods shall include:

   *  The name and encoding for the restart method.

   *  A description of the restart method including the circumstances
      that leads to the generation of the restart method. Those
      circumstances should be limited to events caused by another
      extension defined in the package to ensure the recipient will be
      able to interpret the extension restart method correctly.

   Note that the extension restart method may have to be provided in
   the result for an AuditEndpoint command auditing the restart method.

6.10 Reason Codes

   Extension reason codes shall include:

   *  The number for the reason code. The number must be in the range
      800 to 899.


Arango, et al.      Informational - Expires  July 2001       [Page 122]

Internet Draft                MGCP 1.0bis                  January 2001

   *  A description of the extension reason code including the
      circumstances that leads to the generation of the reason code.
      Those circumstances should be limited to events caused by another
      extension defined in the package to ensure the recipient will be
      able to interpret the extension reason code correctly.

   Note that the extension reason code may have to be provided in the
   result for an AuditEndpoint command auditing the reason code.

6.11 Return Codes

   Extension Return Codes shall include:

   *  The number for the extension return code. The number must be in
      the range 800 to 899.

   *  A description of the extension return code including the
      circumstances that leads to the generation of the extension
      return code. Those circumstances should be limited to events
      caused by another extension defined in the package to ensure the
      recipient will be able to interpret the extension return code
      correctly.
































Arango, et al.      Informational - Expires  July 2001       [Page 123]

Internet Draft                MGCP 1.0bis                  January 2001

7.  Versions and Compatibility

7.1.  Differences between RFC 2705bis and RFC 2705

   RFC 2705 was issued in October 1999, as the last update of draft
   version 0.5. RFC 2705bis benefits from further implementation
   experience. The main differences between RFC 2705 and RFC 2705bis
   are:

   *  Contains several clarifications, editorial changes and resolution
      of known inconsistencies.

   *  Clarified behavior of mixed wild-carding.

   *  Allowed IPv6 addresses in endpoint-names.

   *  Clarified Digit Map matching rules.

   *  Added Timer T description in Digit Maps.

   *  Clarified use of wildcards in several commands.

   *  Event and Signal Parameters formally defined for events and
      signals.

   *  Persistent events now allowed in base MGCP protocol.

   *  Clarified that mode of second connection in a CreateConnection
      command will be set to "send/receive".

   *  Removed procedures and specification for NAS's (will be provided
      as package instead).

   *  Removed procedures and specification for ATM (will be provided as
      package instead).

   *  Added missing attributes in Capabilities.

   *  Added Response Acknowledgement response (return code 000) and
      included in three-way handshake.

   *  ResponseAck parameter changed to be allowed in all commands.

   *  Added return codes 405, 532-537, and 540, and defined return
      codes in range 800-899 to be package specific return codes.

   *  Added reason code 903, and defined reason codes 800-899 to be
      package specific reason codes.

   *  Added section clarifying codec negotiation procedure.




Arango, et al.      Informational - Expires  July 2001       [Page 124]

Internet Draft                MGCP 1.0bis                  January 2001

   *  Corrected Connection Mode to be optional in ModifyConnection
      commands.

   *  Corrected LocalConnectionDescriptor to be optional in response to
      CreateConnection commands.

   *  Corrected usage of and requirements for SDP to be strictly RFC
      2327 compliant.

   *  Added example sections for commands, responses, and some call
      flows.

   *  Enhanced description of provisional responses and interaction
      with three-way handshake.

   *  Enhanced description of fail-over and the role of "notified
      entity". An empty "notified entity" has been allowed, although
      strongly discouraged.

   *  Clarified retransmission procedure and removed "wrong key"
      considerations from it.

   *  Clarified the section on computing retransmission timers.

   *  Added section on transaction semantics.

   *  Clarified relationship between endpoint service state and
      RestartMethods for restarts and auditing.

   *  Clarified operation for transitioning from "restart procedure" to
      "disconnected state".

   *  Allowed auditing commands and responses to bypass the "restart"
      and "disconnected" procedures.

   *  Deleted the "Proposed MoveConnection command".

   *  Removed packages from protocol specification (will be provided in
      separate documents instead).

   *  Package concept formally extended to be primary extension
      mechanism now allowing extensions for the following to be defined
      in packages as well:

      -  BearerInformation

      -  LocalConnectionOptions

      -  ExtensionParameters

      -  Connection Modes



Arango, et al.      Informational - Expires  July 2001       [Page 125]

Internet Draft                MGCP 1.0bis                  January 2001

      -  Actions

      -  Digit Map Letters

      -  Connection Parameters

      -  Restart Methods

      -  Reason Codes

      -  Return Codes

   *  Requirements and suggested format for package definitions added.

   *  Defined "operation complete" and "operation failure" events to be
      automatically present in packages with Time-Out signals.

   *  IANA registration procedures for packages and other extensions
      added.

   *  Updated grammar to fix known errors and support new extensions in
      a backwards compatible manner.

   *  Connection Mode interaction table added.

7.2.  Differences between Version 1.0 and draft-0.5

   Draft 0-5 was issued in February 1999, as the last update of draft
   version 0.1. Version 1.0 benefits from implementation experience,
   and also aligns as much as possible with the CableLabs' NCS project.
   The main differences between the February draft and version 1.0 are:

   *  Specified more clearly that the encoding of three
      LocalConnectionOptions parameters, Encoding Method, Packetization
      Period and Bandwidth, shall follow the conventions laid out in
      SDP.

   *  Specified how the quarantine handling parameter governs the
      handling of detected but not yet specified events.

   *  Specified that unexpected timers or digits should trigger
      transmission of the dialed string.

   *  Removed the digit map syntax description from section 2.1.5 (it
      was redundant with section 3.4.)

   *  Corrected miscellaneous bugs in the formal syntax description.

   *  Aligned specification of commands with the CableLabs NCS
      specification.  This mostly affects the AuditEndpoint and
      RestartInProgress commands.



Arango, et al.      Informational - Expires  July 2001       [Page 126]

Internet Draft                MGCP 1.0bis                  January 2001

   *  Aligned the handling of retransmission with the CableLabs NCS
      specification.

   *  Added the provisional response return code and corresponding
      behavior description.

   *  Added an optional reason code parameter to restart in progress.

   *  Added the possibility to audit the restart method, restart delay
      and reason code.

7.3.  Differences between draft-04 and draft-05

   Differences are minor: corrected the copyright statement, and
   corrected a bug in the formal description.

7.4.  Differences between draft-03 and draft-04

   Draft 04 corrects a number of minor editing mistakes that were
   pointed out during the review of draft 03, issued on February 1.

7.5.  Differences between draft-02 and draft-03

   The main differences between draft-02, issued in January 22 1998,and
   draft 03 are:

   *  Introduced a discussion on endpoint types,

   *  Introduced a discussion of the connection set-up procedure, and
      of the role of connection parameters,

   *  Introduced a notation of the connection identifier within event
      names,

   *  Documented the extension procedure for the LocalConnectionOptions
      parameter and for the ConnectionParameters parameter,

   *  Introduced a three-way handshake procedure, using a ResponseAck
      parameter, in order to allow gateways to delete copies of old
      responses without waiting for a 30 seconds timer,

   *  Expanded the security section to include a discussion of
      "uncontrolled barge-in".

   *  Proposed a "create two connections" command, as an appendix.

7.6.  Differences between draft-01 and draft-02

   The main differences between draft-01, issued in November 1998, and
   draft 02 are:

   *  Added an ABNF description of the protocol.


Arango, et al.      Informational - Expires  July 2001       [Page 127]

Internet Draft                MGCP 1.0bis                  January 2001

   *  Specification of an EndpointConfiguration command,

   *  Addition of a "two endpoints" mode in the create connection
      command,

   *  Modification of the package wildcards from "$/$" to "*/all" at
      the Request of early implementers,

   *  Revision of some package definitions to better align with
      external specifications.

   *  Addition of a specification for the handling of "failover".

   *  Revision of the section on race conditions.

7.7.  The making of MGCP from IPDC and SGCP

   MGCP version 0.1 results from the fusion of the SGCP and IPDC
   proposals.

7.8.  Changes between MGCP and Initial Versions of SGCP

   MGCP version 0.1 (which subsumes SGCP version 1.2) introduces the
   following changes from SGCP version 1.1:

   *  Protocol name changed to MGCP.

   *  Introduce a formal wildcarding structure in the name of
      endpoints, inspired from IPDC, and detailed the usage of wildcard
      names in each operation.

   *  Naming scheme for events, introducing a package structure
      inspired from IPDC.

   *  New operations for audit endpoint, audit connection (requested by
      the CableLabs) and restart (inspired from IPDC).

   *  New parameter to control the behavior of the notification
      request.

   *  Improved text on the detection and handling of race conditions.

   *  Syntax modification for event reporting, to incorporate package
      names.

   *  Definition of basic event packages (inspired from IPDC).

   *  Incorporation of mandatory and optional extension parameters,
      inspired by IPDC.

  SGCP version 1.1 introduces the following changes from version SGCP
  1.0:


Arango, et al.      Informational - Expires  July 2001       [Page 128]

Internet Draft                MGCP 1.0bis                  January 2001

   *  Extension parameters (X-??:)

   *  Error Code 511 (Unrecognized extension).

   *  All event codes can be used in RequestedEvents, SignalRequests
      and ObservedEvents parameters.

   *  Error Code 512 (Not equipped to detect requested event).

   *  Error Code 513 (Not equipped to generate requested signal).

   *  Error Code 514 (Unrecognized announcement).

   *  Specific Endpoint-ID can be returned in creation commands.

   *  Changed the code for the ASDI display from "ad" to "asdi" to
      avoid conflict with the digits A and D.

   *  Changed the code for the answer tone from "at" to "aw" to avoid
      conflict with the digit A and the timer mark T

   *  Changed the code for the busy tone from "bt" to "bz" to avoid
      conflict with the digit B and the timer mark T

   *  Specified that the continuity tone value is "co" (CT was
      incorrectly used in several instances; CT conflicts with .)

   *  Changed the code for the dial tone from "dt" to "dl" to avoid
      conflict with the digit D and the timer mark T

   *  Added a code point for announcement requests.

   *  Added a code point for the "wink" event.

   *  Set the "octet received" code in the "Connection Parameters" to
      "OR" (was set to RO, but then "OR" was used throughout all
      examples.)

   *  Added a "data" mode.

   *  Added a description of SDP parameters for the network access mode
      (NAS).

   *  Added four flow diagrams for the network access mode.

   *  Incorporated numerous editing suggestions to make the description
      easier to understand. In particular, cleared the confusion
      between requests, queries, functions and commands.

   *  Defined the continuity test mode as specifying a dual-tone
      transponder, while the loopback mode can be used for a single
      tone test.


Arango, et al.      Informational - Expires  July 2001       [Page 129]

Internet Draft                MGCP 1.0bis                  January 2001

   *  Added event code "OC", operation completed.

   *  Added the specification of the "quarantine list", which clarifies
      the expected handling of events and notifications.

   *  Added the specification of a "wildcard delete" operation.
















































Arango, et al.      Informational - Expires  July 2001       [Page 130]

Internet Draft                MGCP 1.0bis                  January 2001

8.  Security Considerations

   Security issues are discussed in section 5.



















































Arango, et al.      Informational - Expires  July 2001       [Page 131]

Internet Draft                MGCP 1.0bis                  January 2001

9.  Acknowledgements

   We want to thank here the many reviewers who provided us with advice
   on the design of SGCP and then MGCP, notably Sankar Ardhanari,
   Francois Berard, David Auerbach, Bob Biskner, David Bukovinsky,
   Charles Eckel, Jerry Kamitses, Oren Kudevitzki, Barry Hoffner, Troy
   Morley, Dave Oran, Jeff Orwick, John Pickens, Lou Rubin, Chip Sharp,
   Paul Sijben, Kurt Steinbrenner, Joe Stone and Stuart Wray.

   The version 0.1 of MGCP is heavily inspired by the "Internet
   Protocol Device Control" (IPDC) designed by the Technical Advisory
   Committee set up by Level 3 Communications. Whole sets of text have
   been retrieved from the IP Connection Control protocol, IP Media
   Control protocol, and IP Device Management. The authors wish to
   acknowledge the contribution to these protocols made by Ilya
   Akramovich, Bob Bell, Dan Brendes, Peter Chung, John Clark, Russ
   Dehlinger, Andrew Dugan, Isaac Elliott, Cary FitzGerald, Jan
   Gronski, Tom Hess, Geoff Jordan, Tony Lam, Shawn Lewis, Dave Mazik,
   Alan Mikhak, Pete O'Connell, Scott Pickett, Shyamal Prasad, Eric
   Presworsky, Paul Richards, Dale Skran, Louise Spergel, David
   Sprague, Raj Srinivasan, Tom Taylor and Michael Thomas.

































Arango, et al.      Informational - Expires  July 2001       [Page 132]

Internet Draft                MGCP 1.0bis                  January 2001

10.  References

   [1]  Bradner, S., "The Internet Standards Process -- Revision 3",
        BCP 9, RFC 2026, October 1996.

   [2]  Bradner, S., "Key words for use in RFCs to Indicate Requirement
        Levels", BCP 14, RFC 2119, March 1997

   [3]  Schulzrinne, H., Casner, S., Frederick, R. and V. Jacobson,
        "RTP: A Transport Protocol for Real-Time Applications", RFC
        1889, January 1996.

   [4]  Schulzrinne, H., "RTP Profile for Audio and Video Conferences
        with Minimal Control", RFC 1890, January 1996.

   [5]  Handley, M and V. Jacobson, "SDP: Session Description
        Protocol", RFC 2327, April 1998.

   [6]  Handley, M., "SAP - Session Announcement Protocol", Work in
        Progress.

   [7]  Handley, M., Schulzrinne, H. and E. Schooler, "Session
        Initiation Protocol (SIP)", RFC 2543, March 1999.

   [8]  Schulzrinne, H., Rao, A. and R. Lanphier, "Real Time Streaming
        Protocol (RTSP)", RFC 2326, April 1998.

   [9]  ITU-T, Recommendation Q.761, "FUNCTIONAL DESCRIPTION OF THE
        ISDN USER PART OF SIGNALING SYSTEM No. 7", (Malaga-
        Torremolinos, 1984; modified at Helsinki, 1993).

   [10] ITU-T, Recommendation Q.762, "GENERAL FUNCTION OF MESSAGES AND
        SIGNALS OF THE ISDN USER PART OF SIGNALING SYSTEM No. 7",
        (MalagaTorremolinos, 1984; modified at Helsinki, 1993).

   [11] ITU-T, Recommendation H.323 (02/98), "PACKET-BASED MULTIMEDIA
        COMMUNICATIONS SYSTEMS".

   [12] ITU-T, Recommendation H.225, "Call Signaling Protocols and
        Media Stream Packetization for Packet Based Multimedia
        Communications Systems".

   [13] ITU-T, Recommendation H.245 (02/98), "CONTROL PROTOCOL FOR
        MULTIMEDIA COMMUNICATION".

   [14] Kent, S. and R. Atkinson, "Security Architecture for the
        Internet Protocol", RFC 2401, November 1998.

   [15] Kent, S. and R. Atkinson, "IP Authentication Header", RFC 2402,
        November 1998.




Arango, et al.      Informational - Expires  July 2001       [Page 133]

Internet Draft                MGCP 1.0bis                  January 2001

   [16] Kent, S. and R. Atkinson, "IP Encapsulating Security Payload
        (ESP)", RFC 2406, November 1998.

   [17] Crocker, D. and P. Overell, "Augmented BNF for Syntax
        Specifications: ABNF", RFC 2234, November 1997.

   [18] PacketCableTM Network-Based call Signaling Specification, PKT-
        SP-EC-MGCP-I02-991201.

   [19] Yergeau, F., "UTF-8, a transformation format of ISO 10646", RFC
        2279, January 1998.

   [20] Braden, R., "Requirements for Internet Hosts -- Communication
        Layers", RFC 1122, October 1989.








































Arango, et al.      Informational - Expires  July 2001       [Page 134]

Internet Draft                MGCP 1.0bis                  January 2001

11.  Authors' Addresses

   Mauricio Arango
   901 San Antonio Road, UMPK15-214
   Palo Alto, CA 94303
   Phone:
   Email: Mauricio.Arango@sun.com


   Andrew Dugan
   Level3 Communications
   1025 Eldorado Blvd
   Broomfield, CO 80021
   Phone: +1 720 888 2983
   EMail: andrew.dugan@level3.com


   Isaac Elliott
   Level3 Communications
   1025 Eldorado Blvd., Bldg 4000
   Broomfield, CO 80021
   Phone: +1 720 888 6763
   EMail: ike.elliott@level3.com


   Christian Huitema
   Microsoft Corporation
   One Microsoft Way
   Redmond, WA 98052-6399
   Phone:
   EMail: huitema@microsoft.com


   Scott Pickett
   Vertical Networks
   1148 East Arques Ave
   Sunnyvale, CA 94086
   Phone: +1 408 585 3200
   EMail: ScottP@vertical.com


   Flemming Andreasen
   Cisco Systems
   499 Thornall Street, 8th Floor
   Edison, NJ 08837
   Phone: +1 732 452 1667
   EMail: fandreas@cisco.com


   Bill Foster
   Cisco Systems
   771 Alder Drive
   Milpitas, CA 95035

Arango, et al.      Informational - Expires  July 2001       [Page 135]

Internet Draft                MGCP 1.0bis                  January 2001

   Phone: +1 408 527 8791
   EMail: bfoster@cisco.com


   Rajesh Kumar
   Cisco Systems
   3850 Zanker Road
   San Jose, CA 95134
   Phone: +1 408 527 0811
   Email: rkumar@cisco.com












































Arango, et al.      Informational - Expires  July 2001       [Page 136]

Internet Draft                MGCP 1.0bis                  January 2001

Appendix A: Formal Syntax Description of the Protocol

   In this section, we provide a formal description of the protocol
   syntax, following the "Augmented BNF for Syntax Specifications"
   defined in RFC 2234. It should be noted, that ABNF does not provide
   for implicit specification of linear white space and MGCP messages
   must thus follow the explicit linear white space rules provided in
   the grammar below. However, in line with general robustness
   principles, implementors are strongly encouraged to tolerate
   additional linear white space in messages received.


MGCPMessage = MGCPCommand / MGCPResponse

MGCPCommand = MGCPCommandLine 0*(MGCPParameter) [EOL *SDPinformation]

MGCPCommandLine = MGCPVerb 1*(WSP) <transaction-id> 1*(WSP)
                        <endpointName> 1*(WSP) MGCPversion EOL

MGCPVerb = "EPCF" / "CRCX" / "MDCX" / "DLCX" / "RQNT"
         / "NTFY" / "AUEP" / "AUCX" / "RSIP" / extensionVerb

extensionVerb  = "X" 3(ALPHA / DIGIT)

transaction-id = 1*9(DIGIT)

endpointName      = localEndpointName "@" DomainName
LocalEndpointName = LocalNamePart 0*("/" LocalNamePart)
LocalNamePart     = AnyName / AllName / NameString
AnyName           = "$"
AllName           = "*"
NameString        = 1*(range-of-allowed-characters)
; VCHAR except "$", "*", "/", "@"
range-of-allowed-characters  = %x21-23 / %x25-29 / %2B-2E
                             / %30-3F / %x41-7E

DomainName = 1*256(ALPHA / DIGIT / "." / "-")    ; as defined
           / "#" <number> / "[" <dotnum> "]"     ; in RFC 821
           / "[" Ipv6address "]"                 ; see RFC 2372

MGCPversion = "MGCP" 1*(WSP) 1*(DIGIT) "." 1*(DIGIT)
                            [1*(WSP) ProfileName]
ProfileName = VCHAR *( WSP / VCHAR)   ; Was range-of-allowed-characters

MGCPParameter = ParameterValue EOL









Arango, et al.      Informational - Expires  July 2001       [Page 137]

Internet Draft                MGCP 1.0bis                  January 2001

; Check infoCode if more parameter values defined
; Most optional values can only be omitted when auditing
ParameterValue = ("K" ":" 0*WSP  [ResponseAck])
               / ("B" ":" 0*WSP  [BearerInformation])
               / ("C" ":" 0*WSP  [CallId])
               / ("I" ":" 0*WSP  [ConnectionId])
               / ("N" ":" 0*WSP  [NotifiedEntity])
               / ("X" ":" 0*WSP  [RequestIdentifier])
               / ("L" ":" 0*WSP  [LocalConnectionOptions])
               / ("M" ":" 0*WSP  ConnectionMode)
               / ("R" ":" 0*WSP  [RequestedEvents])
               / ("S" ":" 0*WSP  [SignalRequests])
               / ("D" ":" 0*WSP  [DigitMap])
               / ("O" ":" 0*WSP  [ObservedEvents])
               / ("P" ":" 0*WSP  [ConnectionParameters])
               / ("E" ":" 0*WSP  ReasonCode)
               / ("Z" ":" 0*WSP  [SpecificEndpointID])
               / ("Z2" ":" 0*WSP SecondEndpointID)
               / ("I2" ":" 0*WSP SecondConnectionID)
               / ("F" ":" 0*WSP  [RequestedInfo])
               / ("Q" ":" 0*WSP  QuarantineHandling )
               / ("T" ":" 0*WSP  [DetectEvents])
               / ("RM" ":" 0*WSP RestartMethod)
               / ("RD" ":" 0*WSP RestartDelay)
               / ("A" ":" 0*WSP  [Capabilities])
               / ("ES" ":" 0*WSP [EventStates])
               / (extensionParameter ":" 0*WSP [parameterString])

; A final response may include an empty ResponseAck
ResponseAck =  confirmedTransactionIdRange
               *( ","  confirmedTransactionIdRange )

confirmedTransactionIdRange = 1*9DIGIT ["-" 1*9DIGIT]

BearerInformation = BearerAttribute 0*("," 0*WSP BearerAttribute)
BearerAttribute   = ("e" ":" <BearerEncoding>)
                  / (BearerExtensionName [":"BearerExtensionValue])
BearerExtensionName  = PackageLCOExtensionName
BearerExtensionValue = LocalOptionExtensionValue
BearerEncoding = "A" / "mu"

CallId = 1*32(HEXDIG)

; The audit request response may include a list of identifiers
ConnectionId = 1*32(HEXDIG) 0*("," 1*32(HEXDIG))
SecondConnectionID = ConnectionId

NotifiedEntity = [LocalName "@"] DomainName [":" portNumber]
LocalName  = LocalEndpointName            ; No internal structure
                                          ; was 1*32(suitableCharacter)
portNumber = 1*5(DIGIT)

RequestIdentifier = 1*32(HEXDIG)

Arango, et al.      Informational - Expires  July 2001       [Page 138]

Internet Draft                MGCP 1.0bis                  January 2001


LocalConnectionOptions = LocalOptionValue 0*(WSP)
                           0*("," 0*(WSP) LocalOptionValue 0*(WSP))
LocalOptionValue = ("p"   ":" <packetizationPeriod> )
                 / ("a"  ":" <compressionAlgorithm> )
                 / ("b"  ":" <bandwidth> )
                 / ("e"  ":" <echoCancellation> )
                 / ("gc" ":" <gainControl> )
                 / ("s"  ":" <silenceSuppression> )
                 / ("t"  ":" <typeOfService> )
                 / ("r"  ":" <resourceReservation> )
                 / ("k"  ":" <encryptiondata>)
                 / ("nt" ":" ( <typeOfNetwork> /
                                    <supportedTypeOfNetwork> )
                 / (localOptionExtensionName
                         [":" <localOptionExtensionValue>])  
 
Capabilities =  CapabilityValue 0*(WSP)
                     0*("," 0*(WSP) CapabilityValue 0*(WSP))  
CapabilityValue = LocalOptionValue
                / ("v" ":" <supportedPackages>)
                / ("m" ":" <supportedModes> )
 
packetizationPeriod  = 1*4(DIGIT)["-" 1*4(DIGIT)]
compressionAlgorithm = algorithmName 0*(";" algorithmName)
algorithmName        = 1*32(SuitableLCOCharacter)
bandwidth            = 1*4(DIGIT)["-" 1*4(DIGIT)]
echoCancellation     = "on" / "off"
gainControl          = "auto" / ["-"]1*4(DIGIT)
silenceSuppression   = "on" / "off"
typeOfService        = 2HEXDIG
resourceReservation  = "g" / "cl" / "be"

;encryption parameters are coded as in SDP (RFC 2327)
;NOTE that encryption key may contain an algorithm
;as specified in RFC 1890
encryptiondata = ( "clear" ":" <encryptionKey> )
               / ( "base64" ":" <encodedEncryptionKey> )
               / ( "uri" ":" <URItoObtainKey> )
               / ( "prompt" ) ; defined in SDP, not usable in MGCP!
; was 1*(SuitableCharacter / SP)
encryptionKey = 1*(SuitableLCOCharacter) / quotedString
; See RFC 2045
encodedEncryptionKey = 1*(ALPHA / DIGIT / "+" / "/" / "=")
URItoObtainKey = 1*(SuitableLCOCharacter) / quotedString

typeOfNetwork = "IN" / "ATM" / "LOCAL" / OtherTypeOfNetwork
; Registered with IANA - see RFC 2327
OtherTypeOfNetwork     = 1*(SuitableLCOCharacter)
supportedTypeOfNetwork = typeOfNetwork *(";" typeOfNetwork)

supportedModes    = ConnectionMode 0*(";" ConnectionMode)


Arango, et al.      Informational - Expires  July 2001       [Page 139]

Internet Draft                MGCP 1.0bis                  January 2001


supportedPackages = packageName 0*(";" packageName)

packageName = 1*(ALPHA / DIGIT / HYPHEN) ; Hyphen neither first or last

localOptionExtensionName = VendorLCOExtensionName
                         / PackageLCOExtensionName
                         / OtherLCOExtensionname
VendorLCOExtensionName   = "x" ("+"/"-") 1*32(SuitableExtLCOCharacter)
PackageLCOExtensionName  = packageName "/"
                            1*32(SuitablePkgExtLCOCharacter)
; must not start with "x-" or "x+"
OtherLCOExtensionName    = 1*32(SuitableExtLCOCharacter)

localOptionExtensionValue = (1*32(SuitableLCOCharacter) / quotedString)
                              *(";" *WSP (1*32(SuitableLCOCharacter)
                                                      / quotedString)))

;Note: No "data" mode.
ConnectionMode = "sendonly" / "recvonly" / "sendrecv"
               / "confrnce" / "inactive" / "loopback"
               / "conttest" / "netwloop" / "netwtest"
               / ExtensionConnectionMode
ExtensionConnectionMode = PkgExtConnectionMode
PkgExtConnectionMode    = packageName "/" 1*(ALPHA / DIGIT)

RequestedEvents = requestedEvent 0*("," 0*(WSP) requestedEvent)
requestedEvent  = (eventName ["(" requestedActions ")"])
                / (eventName "(" requestedActions ")"
                                       "(" eventParameters ")" )
eventName = [(packageName / "*") "/"]
                (eventId / "all" / eventRange)
                              ["@" (ConnectionId / "$" / "*")]
; Was 1*(SuitableCharacter)
eventId = 1*(ALPHA / DIGIT / HYPHEN)
                                ; Hyphen neither first or last
eventRange = "[" 1*(DigitMapLetter / (DIGIT "-" DIGIT) /
                        (DTMFLetter "-" DTMFLetter)) "]"
DTMFLetter = "A" / "B" / "C" / "D"        ; Was undefined

requestedActions = requestedAction 0*("," 0*(WSP) requestedAction)
requestedAction  = "N" / "A" / "D" / "S" / "I" / "K"
                 / "E" "(" EmbeddedRequest ")"
                 / ExtensionAction
ExtensionAction  = PackageExtAction
PackageExtAction = packageName "/" Action ["(" ActionParameters ")"]
Action = 1*ALPHA
ActionParameters = eventParameters        ; May contain actions

;NOTE: Should tolerate different order when receiving, e.g. for NCS.
EmbeddedRequest = (      "R" "(" EmbeddedRequestList ")"
                   ["," "S" "(" EmbeddedSignalRequest ")"]
                   ["," "D" "(" EmbeddedDigitMap ")"] )

Arango, et al.      Informational - Expires  July 2001       [Page 140]

Internet Draft                MGCP 1.0bis                  January 2001

               / (      "S" "(" EmbeddedSignalRequest ")"
                   ["," "D" "(" EmbeddedDigitMap ")"] )
               / (      "D" "(" EmbeddedDigitMap ")" )

EmbeddedRequestList   = RequestedEvents
EmbeddedSignalRequest = SignalRequests
EmbeddedDigitMap = DigitMap

SignalRequests   = SignalRequest 0*("," 0*(WSP) SignalRequest )
SignalRequest    = eventName [ "(" eventParameters ")" ]

eventParameters  = eventParameter 0*("," 0*(WSP) eventParameter)
eventParameter   = eventParameterValue
                 / eventParameterName "=" eventParameter
                 / eventParameterName "(" eventParameters ")"
eventParameterString = 1*(SuitableEventParamCharacter)
eventParameterName   = eventParameterString
eventParameterValue  = eventParameterString / quotedString

DigitMap           = DigitString  / "(" DigitStringList ")"
DigitStringList    = DigitString 0*( "|" DigitString )
DigitString        = 1*(DigitStringElement)
DigitStringElement = DigitPosition ["."]
DigitPosition      = DigitMapLetter / DigitMapRange
; NOTE "X" is now included
DigitMapLetter     = DIGIT / "#" / "*" / "A" / "B" / "C" / "D" / "T"
                   / "X" / ExtensionDigitMapLetter
ExtensionDigitMapLetter = "E" / "F" / "G" / "H" / "I" / "J" / "K"
                        / "L" / "M" / "N" / "O" / "P" / "Q" / "R"
                        / "S" / "U" / "V" / "W" / "Y" / "Z"
; NOTE "[x]" is now allowed
DigitMapRange = "x" / "[" 1*DigitLetter "]"
DigitLetter   = *((DIGIT "-" DIGIT ) / DigitMapLetter)

ObservedEvents = SignalRequests

EventStates    = SignalRequests

ConnectionParameters = ConnectionParameter
                        0*( "," 0*(WSP) ConnectionParameter )
ConnectionParameter  = ( "PS" "=" packetsSent )
                    / ( "OS" "=" octetsSent )
                    / ( "PR" "=" packetsReceived )
                    / ( "OR" "=" octetsReceived )
                    / ( "PL" "=" packetsLost )
                    / ( "JI" "=" jitter )
                    / ( "LA" "=" averageLatency )
                    / ( ConnectionParameterExtensionName
                              "=" ConnectionParameterExtensionValue )
packetsSent     = 1*9(DIGIT)
octetsSent      = 1*9(DIGIT)
packetsReceived = 1*9(DIGIT)
octetsReceived  = 1*9(DIGIT)

Arango, et al.      Informational - Expires  July 2001       [Page 141]

Internet Draft                MGCP 1.0bis                  January 2001

packetsLost     = 1*9(DIGIT)
jitter          = 1*9(DIGIT)
averageLatency  = 1*9(DIGIT)

ConnectionParameterExtensionName = VendorCPExtensionName
                                 /    PackageCPExtensionName
VendorCPExtensionName  = "X" "-" 2*ALPHA
PackageCPExtensionName = packageName "/" CPName
CPName = 1*(ALPHA / DIGIT / HYPHEN)
ConnectionParameterExtensionValue = 1*9(DIGIT)

ReasonCode = 3DIGIT
             [1*(WSP) "/" packageName]     ; Only for 8xx
             [WSP 1*(%x20-7E)]

SpecificEndpointID = endpointName
SecondEndpointID   = endpointName

RequestedInfo = infoCode 0*("," infoCode)

infoCode = "B" / "C" / "I" / "N" / "X" / "L" / "M" / "R" / "S"
         / "D" / "O" / "P" / "E" / "Z" / "Q" / "T" / "RC" / "LC"
         / "A" / "ES" / "RM" / "RD" / extensionParameter

QuarantineHandling = loopControl / processControl
                   / (loopControl "," processControl )
loopControl    = "step" / "loop"
processControl = "process" / "discard"

DetectEvents = eventName 0*("," eventName)

RestartMethod = "graceful" / "forced" / "restart" / "disconnected"
              / "cancel-graceful" / extensionRestartMethod
extensionRestartMethod = PackageExtensionRM
PackageExtensionRM     = packageName "/" 1*32(ALPHA / DIGIT / HYPHEN)
RestartDelay = 1*6(DIGIT)

extensionParameter = VendorExtensionParameter
                   / PackageExtensionParameter
                   / OtherExtensionParameter
VendorExtensionParameter  = "X" ("-"/"+") 1*6(ALPHA / DIGIT)
PackageExtensionParameter = packagename "/"
                            1*32(ALPHA / DIGIT / HYPHEN)
; must not start with "x-" or x+"
OtherExtensionParameter   = 1*32(ALPHA / DIGIT / HYPHEN)

parameterString = 1*(%x20-7F) ; First and last must not be white space

MGCPResponse = MGCPResponseLine 0*(MGCPParameter) [EOL *SDPinformation]

MGCPResponseLine = <responseCode> 1*(WSP) <transaction-id>
                        [1*(WSP) "/" packageName]    ; Only for 8xx


Arango, et al.      Informational - Expires  July 2001       [Page 142]

Internet Draft                MGCP 1.0bis                  January 2001

                             [WSP <responseString>] EOL
responseCode = 3DIGIT
responseString = *(%x20-7E)

SuitableCharacter =   DIGIT / ALPHA / "+" / "-" / "_" / "&"
                  / "!" / "'" / "|" / "=" / "#" / "?" / "/"
                  / "." / "$" / "*" / ";" / "@" / "[" / "]"
                  / "^" / "`" / "{" / "}" / "~"

SuitablePkgExtLCOCharacter =  SuitableLCOCharacter

SuitableExtLCOCharacter =   DIGIT / ALPHA / "+" / "-" / "_" / "&"
                        / "!" / "'" / "|" / "=" / "#" / "?" /
                        / "." / "$" / "*" /       "@" / "[" / "]"
                        / "^" / "`" / "{" / "}" / "~"

SuitableLCOCharacter = SuitableExtLCOCharacter / "/"

SuitableEventCharacter =   DIGIT / ALPHA / "+" / "-" / "_" / "&"
                       / "!" / "'" / "|" /       "#" / "?" / "/"
                       / "." / "$" / "*" / ";" / "@" / "[" / "]"
                       / "^" / "`" / "{" / "}" / "~"

; VCHAR except """, "(", ")", and ","
SuitableEventParamCharacter = %x21 / %x23-27 / %x2A-2B / %x2D-7E

; NOTE: UTF8 encoded
quotedString  = DQUOTE visibleString
                 0*(quoteEscape visibleString) DQUOTE
quoteEscape   = DQUOTE DQUOTE
visibleString = (%x00-21 / %x23-FF)

EOL = CRLF / LF

HYPHEN = "-"

SDPinformation = ;See RFC 2327

















Arango, et al.      Informational - Expires  July 2001       [Page 143]

Internet Draft                MGCP 1.0bis                  January 2001

Appendix B: IANA Considerations

B.1. Packages

   Packages can be registered with the IANA according to the following
   procedure:

   The package must have a unique string name which must not start with
   the two characters "x-" or "x+".

   The package name must be registered with IANA as well as a reference
   to the document that describes the package. The document must have a
   stable URL and must be contained on public web server.

   A contact name, e-mail and postal address for the package must be
   provided. The contact information shall be updated by the defining
   organization as necessary.

B.2. Local Connection Options

   Packages are the preferred extension mechanism, however for
   backwards compatibility, local connection options beyond those
   provided in this specification can be registered with IANA. Each
   local connection option must have a unique string name which must
   not start with "x-" or "x+". The name of the local connection option
   must be registered with IANA as well as a reference to the document
   that describes the local connection option. The document must have a
   stable URL and must be contained on a public web server.

   A contact name, e-mail and postal address for the local connection
   option must be provided.























Arango, et al.      Informational - Expires  July 2001       [Page 144]

Internet Draft                MGCP 1.0bis                  January 2001

Appendix C: Mode Interactions

   An MGCP connection can establish one or more media streams. These
   streams are either incoming (from a remote endpoint) or outgoing
   (generated at the handset microphone).  The "connection mode"
   parameter establishes the direction and generation of these streams.
   When there is only one connection to an endpoint, the mapping of
   these streams is straightforward; the handset plays the incoming
   stream over the handset speaker and generates the outgoing stream
   from the handset microphone signal, depending on the mode parameter.

   However, when several connections are established to an endpoint,
   there can be many incoming and outgoing streams. Depending on the
   connection mode used, these streams may interact differently with
   each other and the streams going to/from the handset.
   The table below describes how different connections should be mixed
   when one or more connections are concurrently "active". An active
   connection is here defined as a connection that is in one of the
   following modes:

   *  "send/receive"
   *  "send only"
   *  "receive only"
   *  "conference"

   Connections in "network loopback", "network continuity test", or
   "inactive" modes are not affected by connections in the "active"
   modes. The Table uses the following conventions:

   *  Ai is the incoming media stream from Connection A
   *  Bi is the incoming media stream from Connection B
   *  Hi is the incoming media stream from the Handset Microphone
   *  Ao is the outgoing media stream to Connection A
   *  Bo is the outgoing media stream to Connection B
   *  Ho is the outgoing media stream to the Handset earpiece
   *  NA indicates No Stream whatever

   "netw" in the following table indicates either "netwloop" or
   "netwtest" mode.















Arango, et al.      Informational - Expires  July 2001       [Page 145]

Internet Draft                MGCP 1.0bis                  January 2001

     -------------------------------------------------------------
    |       |               Connection A Mode                     |
    |       |-----------------------------------------------------
    |       |sendonly|recvonly|sendrecv|confrnce|inactive|  netw  |
    |-------|-----------------------------------------------------|
    | |Send | Ao=Hi  | Ao=NA  | Ao=Hi  | Ao=Hi  | Ao=NA  | Ao=Ai  |
    |C|only | Bo=Hi  | Bo=Hi  | Bo=Hi  | Bo=Hi  | Bo=Hi  | Bo=Hi  |
    |o|     | Ho=NA  | Ho=Ai  | Ho=Ai  | Ho=Ai  | Ho=NA  | Ho=NA  |
    |n|-----------------------------------------------------------
    |n|recv |        | Ao=NA  | Ao=Hi  | Ao=Hi  | Ao=NA  | Ao=Ai  |
    |e|only |        | Bo=NA  | Bo=NA  | Bo=NA  | Bo=NA  | Bo=NA  |
    |c|     |        |Ho=Ai+Bi|Ho=Ai+Bi|Ho=Ai+Bi| Ho=Bi  | Ho=Bi  |
    |t|-----------------------------------------------------------|
    |i|send |        |        | Ao=Hi  | Ao=Hi  | Ao=NA  | Ao=Ai  |
    |o|recv |        |        | Bo=Hi  | Bo=Hi  | Bo=Hi  | Bo=Hi  |
    |n|     |        |        |Ho=Ai+Bi|Ho=Ai+Bi| Ho=Bi  | Ho=Bi  |
    | |-----------------------------------------------------------|
    |B|conf |        |        |        |Ao=Hi+Bi| Ao=NA  | Ao=Ai  |
    | |rnce |        |        |        |Ho=Ai+Bi| Bo=Hi  | Bo=Hi  |
    |M|     |        |        |        |Ho=Ai+Bi| Ho=Bi  | Ho=Bi  |
    |o|-----------------------------------------------------------|
    |d|Inac |        |        |        |        | Ao=NA  | Ao=Ai  |
    |e|tive |        |        |        |        | Bo=NA  | Bo=NA  |
    | |     |        |        |        |        | Ho=NA  | Ho=NA  |
    | |-----------------------------------------------------------|
    | |netw |        |        |        |        |        | Ao=Ai  |
    | |     |        |        |        |        |        | Bo=Bi  |
    | |     |        |        |        |        |        | Ho=NA  |
     -------------------------------------------------------------

   If there are three or more "active" channels they will still
   interact as defined in the table above with the outgoing media
   streams mixed for each interaction. (Union of all streams) If
   internal resources are used up and the streams cannot be mixed, the
   gateway should return a resources Not available error.



















Arango, et al.      Informational - Expires  July 2001       [Page 146]

Internet Draft                MGCP 1.0bis                  January 2001

Appendix D: Example Command Encodings

   This appendix provides examples of commands and responses shown with
   the actual encoding used. Examples are provided for each command.
   All commentary shown in the commands and responses is optional.

D.1. NotificationRequest

   The first example illustrates a NotificationRequest that will ring a
   phone and look for an off-hook event:

      RQNT 1201 aaln/1@rgw-2567.whatever.net MGCP 1.0
      N: ca@ca1.whatever.net:5678
      X: 0123456789AC
      R: l/hd(N)
      S: g/rg

   The response indicates that the transaction was successful:

      200 1201 OK

   The second example illustrates a NotificationRequest that will look
   for and accumulate an off-hook event, and then provide dial-tone and
   accumulate digits according to the digit map provided. The "notified
   entity" is set to "ca@ca1.whatever.net:5678", and since the
   SignalRequests parameter is empty (it could have been omitted as
   well), all currently active TO signals will be stopped. All events
   in the quarantine buffer will be processed, and the list of events
   to detect in the "notification" state will include fax tones in
   addition to the "requested events" and persistent events:

      RQNT 1202 aaln/1@rgw-2567.whatever.net MGCP 1.0
      N: ca@ca1.whatever.net:5678
      X: 0123456789AC
      R: hd(A, E(S(dl),R(oc, hu, [0-9#*T](D))))
      D: (0T|00T|#xxxxxxx|*xx|91xxxxxxxxxx|9011x.T)
      S:
      Q: process
      T: ft

   The response indicates that the transaction was successful:

      200 1202 OK

D.2. Notify

   The example below illustrates a Notify message that notifies an off-
   hook event followed by a 12-digit number beginning with "91". A
   transaction identifier correlating the Notify with the
   NotificationRequest it results from is included. The command is sent
   to the current "notified entity", which typically will be the actual
   value supplied in the NotifiedEntity parameter, i.e.,


Arango, et al.      Informational - Expires  July 2001       [Page 147]

Internet Draft                MGCP 1.0bis                  January 2001

   "ca@ca1.whatever.net:5678" – a failover situation could have changed
   this:

      NTFY 2002 aaln/1@rgw-2567.whatever.net MGCP 1.0
      N: ca@ca1.whatever.net:5678
      X: 0123456789AC
      O: hd,9,1,2,0,1,8,2,9,4,2,6,6

   The Notify response indicates that the transaction was successful:

      200 2002 OK

D.3. CreateConnection

   The first example illustrates a CreateConnection command to create a
   connection on the endpoint specified. The connection will be part of
   the specified CallId. The LocalConnectionOptions specify that G.711
   u-law will be the codec used and the packetization period will be 10
   ms. The connection mode will be "receive only":

      CRCX 1204 aaln/1@rgw-2567.whatever.net MGCP 1.0
      C: A3C47F21456789F0
      L: p:10, a:PCMU
      M: recvonly

   The response indicates that the transaction was successful, and a
   connection identifier for the newly created connection is therefore
   included. A session description for the new connection is included
   as well – note that it is preceded by an empty line.

      200 1204 OK
      I: FDE234C8

      v=0
      o=- 25678 753849 IN IP4 128.96.41.1
      s=-
      c=IN IP4 128.96.41.1
      t=0 0
      m=audio 3456 RTP/AVP 0

   The second example illustrates a CreateConnection command containing
   a notification request and a RemoteConnectionDescriptor:












Arango, et al.      Informational - Expires  July 2001       [Page 148]

Internet Draft                MGCP 1.0bis                  January 2001

      CRCX 1205 aaln/1@rgw-2569.whatever.net MGCP 1.0
      C: A3C47F21456789F0
      L: p:10, a:PCMU
      M: sendrecv
      X: 0123456789AD
      R: hd
      S: rg
      v=0
      o=- 25678 753849 IN IP4 128.96.41.1
      s=-
      c=IN IP4 128.96.41.1
      t=0 0
      m=audio 3456 RTP/AVP 0

   The response indicates that the transaction failed, because the
   phone was already off-hook. Consequently, neither a connection-id
   nor a session description is returned:

      401 1205 Phone off-hook

   Our third example illustrates the use of the provisional response
   and the three-way handshake. We create another connection this time
   using dynamic quality of service and acknowledging the previous
   response received:

      CRCX 1206 aaln/1@rgw-2569.whatever.net MGCP 1.0
      K: 1205
      C: A3C47F21456789F0
      L: p:10, a:PCMU
      M: inactive

      v=0
      o=- 25678 753849 IN IP4 128.96.41.1
      s=-
      c=IN IP4 128.96.41.1
      t=0 0
      m=audio 3456 RTP/AVP 0

   A provisional response is returned initially:

      100 1206 Pending
      I: DFE233D1

      v=0
      o=- 4723891 7428910 IN IP4 128.96.63.25
      s=-
      c=IN IP4 128.96.63.25
      t=0 0
      m=audio 3456 RTP/AVP 0

   A little later, the final response is received:



Arango, et al.      Informational - Expires  July 2001       [Page 149]

Internet Draft                MGCP 1.0bis                  January 2001

      200 1206 OK
      K:
      I: DFE233D1

      v=0
      o=- 4723891 7428910 IN IP4 128.96.63.25
      s=-
      c=IN IP4 128.96.63.25
      t=0 0
      m=audio 3456 RTP/AVP 0

   The Call Agent acknowledges the final response as requested:

      000 1206

   and the transaction is complete.

D.4. ModifyConnection

   The first example shows a ModifyConnection command that simply sets
   the connection mode of a connection to "send/receive" – the
   "notified entity" is set as well:

      MDCX 1209 aaln/1@rgw-2567.whatever.net MGCP 1.0
      C: A3C47F21456789F0
      I: FDE234C8
      N: ca@ca1.whatever.net
      M: sendrecv

   The response indicates that the transaction was successful:

      200 1209 OK

   In the second example, we pass a session description and include a
   notification request with the ModifyConnection command. The endpoint
   will start playing ring-back tones to the user until it detects
   audio on the connection specified for the media start event:

      MDCX 1210 aaln/1@rgw-2567.whatever.net MGCP 1.0
      C: A3C47F21456789F0
      I: FDE234C8
      M: recvonly
      X: 0123456789AE
      R: hu, ma@FDE234C8
      S: rt

      v=0
      o=- 4723891 7428910 IN IP4 128.96.63.25
      s=-
      c=IN IP4 128.96.63.25
      t=0 0
      m=audio 3456 RTP/AVP 0


Arango, et al.      Informational - Expires  July 2001       [Page 150]

Internet Draft                MGCP 1.0bis                  January 2001

   The response indicates that the transaction was successful:

      200 1206 OK

D.5. DeleteConnection (from the Call Agent)

   In this example, the Call Agent simply instructs the gateway to
   delete the connection FDE234C8 on the endpoint specified:

      DLCX 1210 aaln/1@rgw-2567.whatever.net MGCP 1.0
      C: A3C47F21456789F0
      I: FDE234C8

   The response indicates success, and that the connection was deleted.
   Connection parameters for the connection are therefore included as
   well:

      250 1210 OK
      P: PS=1245, OS=62345, PR=780, OR=45123, PL=10, JI=27, LA=48

D.6. DeleteConnection (from the gateway)

   In this example, the gateway sends a DeleteConnection command to the
   Call Agent to instruct it that a connection on the specified
   endpoint has been deleted. The ReasonCode specifies the reason for
   the deletion, and Connection Parameters for the connection are
   provided as well:

      DLCX 1210 aaln/1@rgw-2567.whatever.net MGCP 1.0
      C: A3C47F21456789F0
      I: FDE234C8
      E: 900 – Hardware error
      P: PS=1245, OS=62345, PR=780, OR=45123, PL=10, JI=27, LA=48

   The Call Agent sends a success response to the gateway:

      200 1210 OK

D.7. DeleteConnection (multiple connections from the Call Agent)

   In the first example, the Call Agent instructs the gateway to delete
   all connections related to call "A3C47F21456789F0" on the specified
   endpoint:

      DLCX 1210 aaln/1@rgw-2567.whatever.net MGCP 1.0
      C: A3C47F21456789F0

   The response indicates success and that the connection(s) were
   deleted:

      250 1210 OK



Arango, et al.      Informational - Expires  July 2001       [Page 151]

Internet Draft                MGCP 1.0bis                  January 2001

   In the second example, the Call Agent instructs the gateway to
   delete all connections related to all of the endpoints specified:

      DLCX 1210 aaln/*@rgw-2567.whatever.net MGCP 1.0

   The response indicates success:

      250 1210 OK

D.8. AuditEndpoint

   In the first example, the Call Agent wants to learn what endpoints
   are present on the gateway specified, hence the use of the "all of"
   wild-card for the local portion of the endpoint-name:

      AUEP 1200 *@rgw-2567.whatever.net MGCP 1.0

   The gateway indicates success and includes a list of endpoint names:

      200 1200 OK
      Z: aaln/1@rgw-2567.whatever.net
      Z: aaln/2@rgw-2567.whatever.net

   In the second example, the capabilities of one of the endpoints is
   requested:

      AUEP 1201 aaln/1@rgw-2567.whatever.net MGCP 1.0 NCS 1.0
      F: A

   The response indicates success and the capabilities as well. Two
   codecs are supported, however with different capabilities.
   Consequently two separate capability sets are returned:

      200 1201 OK
      A: a:PCMU, p:10-100, e:on, s:off, v:L;S, m:sendonly;
               recvonly;sendrecv;inactive;netwloop;netwtest
      A: a:G729A, p:30-90, e:on, s:on, v:L;S, m:sendonly;
               recvonly;sendrecv;inactive;confrnce;netwloop

   Note that the carriage return in the Capabilities lines are shown
   for formatting reasons only - they are not permissible in a real
   implementation.

   In the third example, the Call Agent audits all possible information
   for the endpoint:

      AUEP 2002 aaln/1@rgw-2567.whatever.net MGCP 1.0 NCS 1.0
      F: R,D,S,X,N,I,T,O,ES

   The response indicates success:




Arango, et al.      Informational - Expires  July 2001       [Page 152]

Internet Draft                MGCP 1.0bis                  January 2001

      200 2002 OK
      R: L/hu,oc(N),[0-9](N)
      D:
      S: vmwi(+)
      X: 0123456789B1
      N: [128.96.41.12]
      I: 32F345E2
      T: ft
      O: hd,9,1,2
      ES: hd

   The list of requested events contains three events. Where no package
   name is specified, the default package is assumed. The same goes for
   actions, so the default action – Notify - must therefore be assumed
   for the "L/hu" event. The omission of a value for the "digit map"
   means the endpoint currently does not have a digit map. There are
   currently no active time-out signals, however the OO signal "vmvi"
   is currently on and is consequently included – in this case it was
   parameterized, however the parameter could have been excluded. The
   current "notified entity" refers to an IP-address and only a single
   connection exists for the endpoint. The current value of
   DetectEvents is "ft", and the list of ObservedEvents contains the
   four events specified. Finally, the event-states audited reveals
   that the phone was off-hook at the time the transaction was
   processed.

D.9. AuditConnection

   The first example shows an AuditConnection command where we audit
   the CallId, NotifiedEntity, LocalConnectionOptions, Connection Mode,
   LocalConnectionDescriptor, and the Connection Parameters:

      AUCX 2003 aaln/1@rgw-2567.whatever.net MGCP 1.0
      I: 32F345E2
      F: C,N,L,M,LC,P

   The response indicates success and includes information for the
   RequestedInfo:

      200 2003 OK
      C: A3C47F21456789F0
      N: ca@ca1.whatever.net
      L: p:10, a:PCMU
      M: sendrecv
      P: PS=395, OS=22850, PR=615, OR=30937, PL=7, JI=26, LA=47

      v=0
      o=- 4723891 7428910 IN IP4 128.96.63.25
      s=-
      c=IN IP4 128.96.63.25
      t=0 0
      m=audio 1296 RTP/AVP 0


Arango, et al.      Informational - Expires  July 2001       [Page 153]

Internet Draft                MGCP 1.0bis                  January 2001

   In the second example, we request to audit
   RemoteConnectionDescriptor and LocalConnectionDescriptor:

      AUCX 1203 aaln/2@rgw-2567.whatever.net MGCP 1.0 NCS 1.0
      I: FDE234C8
      F: RC,LC

   The response indicates success, and includes information for the
   RequestedInfo. In this case, no RemoteConnectionDescriptor exists,
   hence only the protocol version field is included for the
   RemoteConnectionDescriptor:

      200 1203 OK

      v=0
      o=- 4723891 7428910 IN IP4 128.96.63.25
      s=-
      c=IN IP4 128.96.63.25
      t=0 0
      m=audio 1296 RTP/AVP 0

      v=0

D.10. RestartInProgress

   The first example illustrates a RestartInProgress message sent by an
   gateway to inform the Call Agent that the specified endpoint will be
   taken out of service in 300 seconds:

      RSIP 1200 aaln/1@rgw-2567.whatever.net MGCP 1.0
      RM: graceful
      RD: 300

   The Call Agent’s response indicates that the transaction was
   successful:

      200 1200 OK

   In the second example, the RestartInProgress message sent by the
   gateway informs the Call Agent, that all of the gateway’s endpoints
   are being placed in service in 0 seconds, i.e., they are back in
   service. The delay could have been omitted as well:

      RSIP 1204 *@rgw-2567.whatever.net MGCP 1.0 NCS 1.0
      RM: restart
      RD: 0

   The Call Agent’s response indicates success, and furthermore
   provides the endpoints in question with a new "notified entity":

      200 1204 OK
      N: CA-1@whatever.net


Arango, et al.      Informational - Expires  July 2001       [Page 154]

Internet Draft                MGCP 1.0bis                  January 2001

   Alternatively, the command could have failed with a new "notified
   entity" as in:

      521 1204 OK
      N: CA-1@whatever.net

   In that case, the command would then have to be retried in order to
   satisfy the "restart procedure", this time going to Call Agent "CA-
   1@whatever.net".













































Arango, et al.      Informational - Expires  July 2001       [Page 155]

Internet Draft                MGCP 1.0bis                  January 2001

Appendix E: Endpoint Naming Conventions

   The following sections provide some example endpoint naming
   conventions.

E.1. Analog Access Line Endpoints

   The string "aaln", MAY be used as the first term in a local endpoint
   name for analog access line endpoints. Terms following "aaln" should
   follow the physical hierarchy of the gateway so that if the gateway
   has a number of RJ11 ports, the local endpoint name could look like
   the following:

      aaln/#

   where "#" is the number of the analog line (RJ11 port) on the
   gateway

   On the other hand, the gateway may have a number of physical plug-in
   units, each of which contain some number of RJ11 ports, in which
   case, the local endpoint name might look like the following:

      aaln/<unit #>/#

   where <unit #> is the number of the plug in unit in the gateway and
   "#" is the number of the analog line (RJ11 port) on that unit.

E.2. Digital Trunks

   The string "ds" MAY be used for the first term of digital endpoints
   with a naming convention that follows the physical and digital
   hierarchy such as:

      ds/<unit-type1>-<unit #>/<unit-type2>-<unit #>/.../<channel #>

   where: <unit-type> identifies the particular hierarchy level. Some
   example values of <unit-type> are: "s", "su", "oc3", "ds3", "e3",
   "ds2", "e2", "ds1", "e1" where "s" indicates a slot number and "su"
   indicates a sub-unit within a slot.

   The <unit #> is a decimal number which is used to reference a
   particular instance of a <unit-type> at that level of the hierarchy.
   The number of levels and naming of those levels is based on the
   physical hierarchy within the media gateway.

E.3. Virtual Endpoints

   Another type of endpoint is one that is not associated with a
   physical interface (such as an analog or digital endpoint). This
   type of endpoint is called a virtual endpoint and is often used to
   represent some DSP resources that gives the endpoint some
   capability. Examples are announcement, IVR or conference bridge


Arango, et al.      Informational - Expires  July 2001       [Page 156]

Internet Draft                MGCP 1.0bis                  January 2001

   devices. These devices may have multiple instances of DSP functions
   so that a possible naming convention is:

      <virtual-endpoint-type>/<endpoint-#>

   where < virtual-endpoint-type> may be some string representing the
   type of endpoint (such as "ann" for announcement server or cnf for
   conference server) and <endpoint-#> would identify a particular
   endpoint within the device. If the physical hierarchy of the server
   includes plug-in DSP cards, another level of hierarchy in the local
   endpoint name may be used to describe the plug in unit.

   A virtual endpoint may be created as the result of using the "any
   of" wildcard. Similarly, a virtual endpoint may cease to exist once
   the last connection on the virtual endpoint is deleted. The
   definition of the virtual endpoint must detail both of these
   aspects.





































Arango, et al.      Informational - Expires  July 2001       [Page 157]

Internet Draft                MGCP 1.0bis                  January 2001

Appendix F: Example Call Flows

   The message flow tables in this section use the following
   abbreviations:

   *  rgw = Residential Gateway
   *  ca  = Call Agent
   *  n+  = step 'n' is repeated one or more times

   Note that any use of upper and lower case within the text of the
   messages is to aid readability and is not in any way a requirement.
   The only requirement involving case is to be case insensitive at all
   times.

F.1. Restart

F.1.1. Residential Gateway Restart

   The following table shows a message sequence that might occur when a
   call agent (ca) is contacted by two independent residential gateways
   (rgw1 and rgw2) which have restarted.

                 Table F.1: Residential Gateway Restart
 ---------------------------------------------------------------------
|step#|    usr1    |    rgw1    |     ca     |    rgw2    |    usr2   |
|=====|============|============|============|============|===========|
|  1  |            |    rsip -> |            |            |           |
|     |            |            | <- ack     |            |           |
|-----|------------|------------|------------|------------|-----------|
|  2  |            |            | <- auep    |            |           |
|     |            |     ack -> |            |            |           |
|-----|------------|------------|------------|------------|-----------|
|  3+ |            |            | <- rqnt    |            |           |
|     |            |     ack -> |            |            |           |
|-----|------------|------------|------------|------------|-----------|
|  4  |            |            |            | <- rsip    |           |
|     |            |            |     ack -> |            |           |
|-----|------------|------------|------------|------------|-----------|
|  5  |            |            |    auep -> |            |           |
|     |            |            |            | <- ack     |           |
|-----|------------|------------|------------|------------|-----------|
|  6+ |            |            |    rqnt -> |            |           |
|     |            |            |            | <- ack     |           |
 ---------------------------------------------------------------------

   Step 1 - RestartInProgress (rsip) from rgw1 to ca

   rgw1 uses DNS to determine the domain name of ca and send to the
   default port of 2727.  The command consists of the following:

      rsip 0 *@rgw1.whatever.net mgcp 1.0
      rm: restart


Arango, et al.      Informational - Expires  July 2001       [Page 158]

Internet Draft                MGCP 1.0bis                  January 2001

   The "*" is used to inform ca that all endpoints of rgw1 are being
   restarted, and "restart" is specified as the restart method. The
   Call Agent "ca" acknowledges the command with an acknowledgement
   message containing the transaction id (in this case 0) for the
   command. It sends the acknowledgement to rgw1 using the same port
   specified in as the source port for the rsip. If none was indicated,
   it uses the default port of 2727.

      200 0 ok

   A response code in mandatory. In this case, "200", indicates "the
   requested transaction was executed normally". The response string is
   optional. In this case, "ok" is included as an additional
   description.

   Step 2 - AuditEndpoint (auep) from ca to rgw1

   The command consists of the following:

      auep 153 *@rgw1.whatever.net mgcp 1.0

   The "*" is used to request audit information from rgw1 of all its
   endpoints. rgw1 acknowledges the command with an acknowledgement
   message containing the id (in this case 153) of the command, and it
   includes a list of its endpoints. In this example, rgw1 has two
   endpoints, aaln/1 and aaln/2.

      200 153 ok
      Z: aaln/1@rgw1.whatever.net
      Z: aaln/2@rgw1.whatever.net

   Once it has the list of endpoint ids, ca may send individual
   AuditEndpoint commands in which the "*" is replaced by the id of the
   given endpoint. As its response, rgw1 would replace the endpoint id
   list returned in the example with the endpoint capabilities of the
   endpoint. This optional message exchange is not shown in this
   example.

   Step 3 - NotificationRequest (rqnt) from ca to each endpoint of rgw1

   In this case, ca sends two rqnts, one for aaln/1:

      rqnt 154 aaln/1@rgw1.whatever.net mgcp 1.0
      r: l/hd(n)
      x: 3456789a0

   and a second for aaln/2:

      rqnt 155 aaln/2@rgw1.whatever.net mgcp 1.0
      r: l/hd(n)
      x: 3456789a1



Arango, et al.      Informational - Expires  July 2001       [Page 159]

Internet Draft                MGCP 1.0bis                  January 2001

   Note that the in requested events parameter line, the event is fully
   specified as "l/hd", i.e. with the package name, in order to avoid
   any potential ambiguity. This is the recommended behavior.  For the
   sake of clarity, the action, which in this case is to Notify, is
   explicitly specified by including the "(n)".  If no action is
   specified, Notify is assumed as the default regardless of the event.
   If any other action is desired, it must be stated explicitly.

   The expected response from rgw1 to these requests is an
   acknowledgement from aaln/1 as follows:

      200 154 ok

   and from aaln/2:

      200 155 ok

   Step 4 RestartInProgress (rsip) from rgw2 to ca

      rsip 0 *@rgw2.whatever.net mgcp 1.0
      rm: restart

   followed by the acknowledgement from ca:

      200 0 ok

   Step 5 - AuditEndpoint (auep) from ca to rgw2

      auep 156 *@rgw2.whatever.net mgcp 1.0

   followed by an acknowledgement from rgw2:

      200 156 ok
      z: aaln/1@rgw2.whatever.net
      z: aaln/2@rgw2.whatever.net

   Step 6 - NotificationRequest (rqnt) from ca to each endpoint of rgw2

      rqnt 157 aaln/1@rgw2.whatever.net mgcp 1.0
      r: l/hd(n)
      x: 3456789a2

   followed by:

      rqnt 158 aaln/2@rgw2.whatever.net mgcp 1.0
      r: l/hd(n)
      x: 3456789a3

   with rgw2 acknowledging for aaln/1:

      200 157 ok

   and for aaln/2:

Arango, et al.      Informational - Expires  July 2001       [Page 160]

Internet Draft                MGCP 1.0bis                  January 2001


      200 158 ok

F.1.2. Call Agent Restart

   The following table shows the message sequence which occurs when a
   call agent (ca) restarts. How it determines the address information
   of the gateways, in this case rgw1 and rgw2, is not covered in this
   document. For interoperability, it is recommended to provide the
   ability to configure the call agent to send AUEP (*) to specific
   addresses and ports.

                 Table F.2: Residential Gateway Restart
 ---------------------------------------------------------------------
| # |     usr1    |    rgw1    |     ca     |    rgw2    |     usr2   |
|===|=============|============|============|============|============|
| 1 |             |            | <- auep    |            |            |
|   |             |     ack -> |            |            |            |
|---|-------------|------------|------------|------------|------------|
| 2+|             |            | <- rqnt    |            |            |
|   |             |     ack -> |            |            |            |
|---|-------------|------------|------------|------------|------------|
| 3 |             |            |    auep -> |            |            |
|   |             |            |            | <- ack     |            |
|---|-------------|------------|------------|------------|------------|
| 4+|             |            |    rqnt -> |            |            |
|   |             |            |            | <- ack     |            |
 ---------------------------------------------------------------------

   Step 1 - AuditEndpoint (auep) from ca to rgw1

   The command consists of the following:

      auep 0 *@rgw1.whatever.net mgcp 1.0

   The "*" is used to request audit information from rgw1 of all its
   endpoints. rgw1 acknowledges the command with an acknowledgement
   message containing the transaction id (in this case 0) of the
   command, and it includes a list of its endpoints. In this example,
   rgw1 has two endpoints, aaln/1 and aaln/2.

      200 0 ok
      z: aaln/1@rgw1.whatever.net, aaln/2@rgw1.whatever.net

   Once it has the list of endpoint ids, ca may send individual
   AuditEndpoint commands in which the "*" is replaced by the id of the
   given endpoint. As its response, rgw1 would replace the endpoint id
   list returned in the example with the endpoint capabilities of the
   endpoint. This optional message exchange is not shown in this
   example.

   Step 2 - NotificationRequest (rqnt) off-hook from ca to rgw1


Arango, et al.      Informational - Expires  July 2001       [Page 161]

Internet Draft                MGCP 1.0bis                  January 2001

   In this case, ca sends two rqnts, one for aaln/1:

      rqnt 1 aaln/1@rgw1.whatever.net mgcp 1.0
      r: l/hd(n)
      x: 234567890

   and a second for aaln/2:

      rqnt 2 aaln/2@rgw1.whatever.net mgcp 1.0
      r: l/hd(n)
      x: 234567891

   The expected response from rgw1 to these requests is an
   acknowledgement from aaln/1 as follows:

      200 1 ok

   and from aaln/2:

      200 2 ok

   Step 3 - AuditEndpoint (auep) from ca to rgw2

      auep 3 *@rgw2.whatever.net mgcp 1.0

   followed by an acknowledgement from rgw2:

      200 3 ok
      z: aaln/1@rgw2.whatever.net, aaln/2@rgw2.whatever.net

   Step 4 - NotificationRequest (rqnt) from ca to each endpoint of rgw2

      rqnt 4 aaln/1@rgw2.whatever.net mgcp 1.0
      r: l/hd(n)
      x: 234567892

   followed by:

      rqnt 5 aaln/2@rgw2.whatever.net mgcp 1.0
      r: l/hd(n)
      x: 234567893

   with rgw2 acknowledging for aaln/1:

      200 4 ok

   and for aaln/2:

      200 5 ok

F.2. Connection Creation



Arango, et al.      Informational - Expires  July 2001       [Page 162]

Internet Draft                MGCP 1.0bis                  January 2001

F.2.1  Residential Gateway to Residential Gateway

   The following table shows the message sequence which occurs when a
   user (usr1) makes a call through a residential gateway (rgw1) to a
   user served by another residential gateway (rgw2). This example
   illustrates the communication between the residential gateways and
   the call agent (ca) only. The local name of the endpoints in this
   example is aaln/1 for both gateways, and references within the
   description of the steps to rgw1 and rgw2 can be assumed to refer to
   aaln/1 of rgw1 and aaln/1 of rgw2.  Note that this is only an
   example and is not the only legal call scenario.











































Arango, et al.      Informational - Expires  July 2001       [Page 163]

Internet Draft                MGCP 1.0bis                  January 2001

           Table F.3: Residential Gateway Connection Creation
 ---------------------------------------------------------------------
| # |     usr1    |    rgw1    |     ca     |    rgw2    |     usr2   |
|===|=============|============|============|============|============|
| 1 |  offhook -> |    ntfy -> |            |            |            |
|   |             |            | <- ack     |            |            |
|---|-------------|------------|------------|------------|------------|
| 2 | <- dialtone |            | <- rqnt    |            |            |
|   |             |     ack -> |            |            |            |
|---|-------------|------------|------------|------------|------------|
| 3 |   digits -> |    ntfy -> |            |            |            |
|   |             |            | <- ack     |            |            |
|---|-------------|------------|------------|------------|------------|
| 4 |             |            | <- rqnt    |            |            |
|   |             |     ack -> |            |            |            |
|---|-------------|------------|------------|------------|------------|
| 5 | <- recvonly |            | <- crcx    |            |            |
|   |             |     ack -> |            |            |            |
|---|-------------|------------|------------|------------|------------|
| 6 |             |            |    crcx -> |            | sendrcv -> |
|   |             |            |            | <- ack     |            |
|---|-------------|------------|------------|------------|------------|
| 7 | <- recvonly |            | <- mdcx    |            |            |
|   |             |     ack -> |            |            |            |
|---|-------------|------------|------------|------------|------------|
| 8 | <- ringback |            | <- rqnt    |            |            |
|   |             |     ack -> |            |            |            |
|---|-------------|------------|------------|------------|------------|
| 9 |             |            |    rqnt -> |            | ringing -> |
|   |             |            |            | <- ack     |            |
|---|-------------|------------|------------|------------|------------|
|10 |             |            |            | <- ntfy    | <- offhook |
|   |             |            |     ack -> |            |            |
|---|-------------|------------|------------|------------|------------|
|11 |             |            |    rqnt -> |            |            |
|   |             |            |            | <- ack     |            |
|---|-------------|------------|------------|------------|------------|
|12 |             |            | <- rqnt    |            |            |
|   |             |     ack -> |            |            |            |
|---|-------------|------------|------------|------------|------------|
|13 | <- sendrcv  |            | <- mdcx    |            |            |
|   |             |     ack -> |            |            |            |
 ---------------------------------------------------------------------

   Step 1 - Notify (ntfy) offhook from rgw1 to ca

   This ntfy is the result of usr1 going offhook and assumes ca had
   previously sent an rqnt with RequestId 445678944 to rgw1
   requesting notification in the event of an offhook:

      ntfy 12 aaln/1@rgw1.whatever.net mgcp 1.0
      o: l/hd
      x: 445678944

Arango, et al.      Informational - Expires  July 2001       [Page 164]

Internet Draft                MGCP 1.0bis                  January 2001


   Acknowledgement from ca:

      200 12 ok

   Step 2 - Request Notification (rqnt) for digits from ca to rgw1

   Request rgw1 to notify if on-hook and collect digits according to
   the digit map, and to provide dialtone:

      rqnt 1057 aaln/1@rgw1.whatever.net mgcp 1.0
      r: l/hu(n), d/[0-9#*T](d)
      s: l/dl
      x: 445678945
      d: 5xxx

   Acknowledgement from rgw1:

      200 1057 ok

   Step 3 - Notify (ntfy) digits from rgw1 to ca

      ntfy 13 aaln/1@rgw1.whatever.net mgcp 1.0
      o: d/5, d/0, d/0, d/1
      x: 445678945

   Acknowledgement from ca:

      200 13 ok

   Step 4 - Request Notification (rqnt) from ca to rgw1

   Request rgw1 to notify in the event of an on-hook transition:

      rqnt 1058 aaln/1@rgw1.whatever.net mgcp 1.0
      r: l/hu(n)
      x: 445678946

   Acknowledgement from rgw1:

      200 1058 ok

   Step 5 - Create Connection (crcx) from ca to rgw1

   Request a new connection on rgw1 with the specified local connection
   options, including 20 msec as the packetization period, G.711 u-law
   as the codec, and receive only as the mode:

      crcx 1059 aaln/1@rgw1.whatever.net mgcp 1.0
      c: 9876543210abcdef
      l: p:20, a:PCMU
      m: recvonly


Arango, et al.      Informational - Expires  July 2001       [Page 165]

Internet Draft                MGCP 1.0bis                  January 2001

   It is recommended to support these connection options for the
   purpose of interoperability. Acknowledgement from rgw1 that a new
   connection, "456789fedcba5", has been created; followed by a blank
   line and then the SDP parameters:

      200 1059 ok
      i: 456789fedcba5

      v=0
      o=- 23456789 98765432 IN IP4 192.168.5.7
      s=-
      c=IN IP4 192.168.5.7
      t=0 0
      m=audio 6058 RTP/AVP 0

   Step 6 - Create Connection (crcx) from ca to rgw2

   Request a new connection on rgw2.  The request includes the session
   description returned by rgw1 such that a two way connection can be
   initiated:

      crcx 2052 aaln/1@rgw2.whatever.net mgcp 1.0
      c: 9876543210abcdef
      l: p:20, a:PCMU
      m: sendrecv

      v=0
      o=- 23456789 98765432 IN IP4 192.168.5.7
      s=-
      c=IN IP4 192.168.5.7
      t=0 0
      m=audio 6058 RTP/AVP 0

   Acknowledgement from rgw2 that a new connection, "67890af54c9", has
   been created; followed by a blank line and then the SDP parameters:

      200 2052 ok
      i: 67890af54c9

      v=0
      o=- 23456889 98865432 IN IP4 192.168.5.8
      s=-
      c=IN IP4 192.168.5.8
      t=0 0
      m=audio 6166 RTP/AVP 0

   Step 7 - Modify Connection (mdcx) from ca to rgw1

   Request rgw1 to modify the existing connection, "456789fedcba5", to
   use the session description returned by rgw2 establishing a half
   duplex connection which, though not used in this example, could be
   used to provide usr1 with in band ringback tone, announcements, etc:


Arango, et al.      Informational - Expires  July 2001       [Page 166]

Internet Draft                MGCP 1.0bis                  January 2001

      mdcx 1060 aaln/1@rgw1.whatever.net mgcp 1.0
      c: 9876543210abcdef
      i: 456789fedcba5
      l: p:20, a:PCMU
      M: recvonly

      v=0
      o=- 23456889 98865432 IN IP4 192.168.5.8
      s=-
      c=IN IP4 192.168.5.8
      t=0 0
      m=audio 6166 RTP/AVP 0

   Acknowledgement from rgw1:

      200 1060 ok

   Step 8 - Request Notification (rqnt) from ca for rgw1 to provide
   ringback

   Request rgw1 to notify in the event of an on-hook transition, and
   also to provide ringback tone:

      rqnt 1061 aaln/1@rgw1.whatever.net mgcp 1.0
      r: l/hu(n)
      s: g/rt
      x: 445678947

   Acknowledgement from rgw1:

      200 1061 ok

   Step 9 - Request Notification (rqnt) from ca to rgw2 to provide
   ringing

   Request rgw2 to continue to look for offhook and provide ringing:

      rqnt 2053 aaln/1@rgw2.whatever.net mgcp 1.0
      r: l/hd(n)
      s: l/rg
      x: 445678948

   Acknowledgement from rgw2:

      200 2053 ok

   Step 10 - Notify (ntfy) offhook from rgw2 to ca

      ntfy 27 aaln/1@rgw2.whatever.net mgcp 1.0
      o: l/hd
      x: 445678948

   Acknowledgement from ca:

Arango, et al.      Informational - Expires  July 2001       [Page 167]

Internet Draft                MGCP 1.0bis                  January 2001


      200 27 ok

   Step 11 - Request Notification (rqnt) of on-hook from ca to rgw2

      rqnt 2054 aaln/1@rgw2.whatever.net mgcp 1.0
      r: l/hu(n)
      x: 445678949

   Acknowledgement from rgw2:

      200 2054 ok

   Step 12 - Request Notification (rqnt) of on-hook from ca to rgw1

      rqnt 1062 aaln/1@rgw1.whatever.net mgcp 1.0
      r: l/hu(n)
      x: 445678950

   Acknowledgement from rgw1:

      200 1062 ok

   Step 13 - Modify Connection (mdcx) from ca to rgw1

   Request rgw1 to modify the existing connection, "456789fedcba5", to
   sendrecv such that a full duplex connection is initiated:

      mdcx 1063 aaln/1@rgw1.whatever.net mgcp 1.0
      c: 9876543210abcdef
      i: 456789fedcba5
      m: sendrecv

   Acknowledgement from rgw1:

      200 1063 ok

F.3  Connection Deletion

F.3.1  Residential Gateway to Residential Gateway

   The following table shows the message sequence which occurs when a
   user (usr2) initiates the deletion of an existing connection on a
   residential gateway (rgw2) with a user served by another residential
   gateway (rgw1). This example illustrates the communication between
   the residential gateways and the call agent (ca) only. The local
   name of the endpoints in this example is aaln/1 for both gateways,
   and references within the description of the steps to rgw1 and rgw2
   can be assumed to refer to aaln/1 of rgw1 and aaln/1 of rgw2.





Arango, et al.      Informational - Expires  July 2001       [Page 168]

Internet Draft                MGCP 1.0bis                  January 2001

            Table F.4: Residential Gateway Connection Deletion
 ---------------------------------------------------------------------
| # |     usr1    |    rgw1    |     ca     |    rgw2    |     usr2   |
|===|=============|============|============|============|============|
| 1 |             |            |            | <- ntfy    | <- on-hook |
|   |             |            |     ack -> |            |            |
|---|-------------|------------|------------|------------|------------|
| 2 |             |            |    dlcx -> |            |            |
|   |             |            |            | <- ack     |            |
|---|-------------|------------|------------|------------|------------|
| 3 |             |            | <- dlcx    |            |            |
|   |             |     ack -> |            |            |            |
|---|-------------|------------|------------|------------|------------|
| 4 |             |            |    rqnt -> |            |            |
|   |             |            |            | <- ack     |            |
|---|-------------|------------|------------|------------|------------|
| 5 |  on-hook -> |    ntfy -> |            |            |            |
|   |             |            | <- ack     |            |            |
|---|-------------|------------|------------|------------|------------|
| 6 |             |            | <- rqnt    |            |            |
|   |             |     ack -> |            |            |            |
 ---------------------------------------------------------------------

   Step 1 - Notify (ntfy) offhook from rgw1 to ca

   This ntfy is the result of usr2 going on-hook and assumes that ca
   had
   previously sent an rqnt to rgw2 requesting notification in the event
   of
   an on-hook (see end of Connection Creation sequence):

      ntfy 28 aaln/1@rgw2.whatever.net mgcp 1.0
      o: l/hu
      x: 445678949

   Acknowledgement from ca:

      200 28 ok

   Step 2 - Delete Connection (dlcx) from ca to rgw2

   Requests rgw2 to delete the connection "67890af54c9":

      dlcx 2055 aaln/1@rgw1.whatever.net mgcp 1.0
      c: 9876543210abcdef
      i: 67890af54c9

   Acknowledgement from rgw2. Note the response code of "250" meaning
   "the connection was deleted":

      250 2055 ok

   Step 3 - Delete Connection (dlcx) from ca to rgw1

Arango, et al.      Informational - Expires  July 2001       [Page 169]

Internet Draft                MGCP 1.0bis                  January 2001


   Requests rgw1 to delete the connection "456789fedcba5":

      dlcx 1064 aaln/1@rgw1.whatever.net mgcp 1.0
      c: 9876543210abcdef
      i: 456789fedcba5

   Acknowledgement from rgw1:

      250 1064 ok

   Step 4 - NotificationRequest (rqnt) from ca to rgw2

   Requests rgw2 to notify ca in the event of an offhook transition:

      rqnt 2056 aaln/1@rgw2.whatever.net mgcp 1.0
      r: l/hd(n)
      x: 445678951

   Acknowledgement from rgw2:

      200 2056 ok

   Step 5 - Notify (ntfy) on-hook from rgw1 to ca

   Notify ca that usr1 at rgw1 went back on-hook:

      ntfy 15 aaln/1@rgw1.whatever.net mgcp 1.0
      o: l/hu
      x: 445678950

   Acknowledgement from ca:

      200 15 ok

   Step 6 - NotificationRequest (rqnt) offhook from ca to rgw1

   Requests rgw1 to notify ca in the event of an offhook transition:

      rqnt 1065 aaln/1@rgw1.whatever.net mgcp 1.0
      r: l/hd(n)
      x: 445678952

   Acknowledgement from rgw1:

      200 1065 ok








Arango, et al.      Informational - Expires  July 2001       [Page 170]

Internet Draft                MGCP 1.0bis                  January 2001

Full Copyright Statement

   Copyright (C) The Internet Society (2001).  All Rights Reserved.

   This document and translations of it may be copied and furnished to
   others, and derivative works that comment on or otherwise explain it
   or assist in its implementation may be prepared, copied, published
   and distributed, in whole or in part, without restriction of any
   kind, provided that the above copyright notice and this paragraph
   are included on all such copies and derivative works.  However, this
   document itself may not be modified in any way, such as by removing
   the copyright notice or references to the Internet Society or other
   Internet organizations, except as needed for the purpose of
   developing Internet standards in which case the procedures for
   copyrights defined in the Internet Standards process must be
   followed, or as required to translate it into languages other than
   English.

   The limited permissions granted above are perpetual and will not be
   revoked by the Internet Society or its successors or assigns.

   This document and the information contained herein is provided on an
   "AS IS" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING
   TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING
   BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION
   HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF
   MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.



























Arango, et al.      Informational - Expires  July 2001       [Page 171]

Internet Draft                MGCP 1.0bis                  January 2001

Acknowledgement

   Funding for the RFC Editor function is currently provided by the
   Internet Society.


















































Arango, et al.      Informational - Expires  July 2001       [Page 172]
